{"link":"1143395","name":"EMS SQL Manager 2008 for SQL Server v3.3.0.1 [СУБД]","date":"02-Окт-08 18:10","author":"-TZAR-","description":"\nEMS SQL Manager 2008 for SQL Server 3.3.0.1Год выпуска: 30.09.2008\nВерсия: 3.3.0.1\nРазработчик: EMS\nСайт разработчика: http://www.sqlmanager.net/ru/products/mssql/manager\nПлатформа: Windows\nСовместимость с Vista: полная\nЯзык интерфейса: английский, русский\nТаблэтка: присутствуетОписание:\nEMS SQL Manager for SQL Server - это высокопроизводительная программа для разработки и администрирования сервера Microsoft SQL. SQL Manager работает со всеми версиями SQL Server, начиная с седьмой, и поддерживает все новейшие возможности SQL Server, включая новые типы данных (datetimeoffset, hierarchyid, geometry, geography и другие), табличные типы и параметры табличных значений, триггеры входа, резервные копии с сжатием и многое другое. Программа включает в себя множество инструментов, таких как Визуальный конструктор баз данных, который позволяет быстро создавать базы данных SQL Server, Визуальный конструктор запросов для построения сложных запросов к SQL Server и множество других полезных инструментов для эффективного администрирования SQL Server. Современный, графический интерфейс и оптимальная система мастеров настроек будут понятны даже новичку.Ключевые особенности: * Поддержка SQL Server 2008\n* Поддержка данных в кодировке Unicode\n* Быстрая навигация и управление базами данных\n* Элементарное управление всеми объектами SQL Server\n* Эффективные инструменты управления данными\n* Эффективное управление параметрами безопасности\n* Великолепные графические и текстовые инструменты для построения запросов\n* Впечатляющие возможности импорта и экспорта данных\n* Мощный визуальный конструктор баз данных\n* Простые и удобные мастера для выполнения административных задач SQL Server\n* Другие необходимые инструменты для простой и удобной работы SQL Server\n* Конструктор отчетов с понятным мастером создания отчетов\n* Современный графический интерфейс пользователя\n\nЧто нового в SQL Manager for SQL Server 3.3?\n\n   1. Добавлена поддержка новых функциональных особенностей SQL Server 2008:          * Сжатые таблицы и индексы.          * Filestream для полей и файловых групп.          * Индексы с условием.          * Разреженные столбцы (Sparse Columns).   2. Конструктор запросов.          * Если таблица имеет связи посредством внешних ключей с другими таблицами из запроса, то при добавлении таблицы в запрос добавляются соответствующие выражения JOIN.          * В некоторых случаях при переименовании таблиц и переходе на вкладку SQL возникала ошибка “Cannot bind JOIN expression”. Исправлено.   3. Проводник БД.          * Добавлена возможность менять порядок хостов путем перетаскивания их мышкой.          * Пользовательские роли и роли приложения теперь обозначаются разными значками.          * При выделении нескольких серверных объектов и при использовании команды “Редактировать объект” открывался редактор только одного из них. Исправлено.          * Теперь при подключении к базе данных можно отключить предупреждение, что у базы установлено не максимальное значение параметра Compatibility level.          * Помощник SQL. Для серверных объектов не работала команда “Редактировать объекты”. Исправлено.   4. Регистрационная информация базы данных. Добавлена опция “Schema-organized database tree”, при отключении которой для данной базы в Проводнике БД строится дерево без разбивки объектов по схемам.   5. Свойства базы данных. Добавлена информация о владельце базы данных.   6. Добавлена возможность правки результатов запросов из связанных таблиц.   7. Для идентификационных полей теперь можно установить отрицательное начальное значение и отрицательный шаг.   8. Мастер восстановления БД. Добавлена возможность отключения всех пользователей при восстановлении существующей базы данных.   9. Отчет HTML. Добавлена возможность изменения размера шрифта в разделе DDL.  10. Окно редактирования метаданных теперь можно закрыть с помощью клавиши Esc.  11. При удалении пользовательского типа данных иногда возникала ошибка Access Violation. Исправлено.  12. Редактор очереди. Если при редактировании очереди отменить изменения в окне редактирования метаданных с помощью операции отката, то произведенные в редакторе изменения пропадали. Исправлено.  13. Комментарии объектов, содержащих национальные символы, отображались неверно, если значение свойства Collation для базы данных отличалось от значения языка клиентского компьютера. Исправлено.  14. Извлечение базы данных. Исправлено несколько ошибок, связанных с неверным порядком выражений, неполным определением некоторых объектов и некоторых других.  15. Окно автозаполнения кода. Некоторые системные функции дублировались в списке. Исправлено.  16. Параметры кода. Список доступных параметров не открывался, если имя объекта было заключено в квадратные скобки. Исправлено.  17. Визуальный конструктор баз данных. На некоторых принтерах не печатались иконки полей и таблиц. Исправлено.  18. Редактор таблиц. Не работала команда обновления на вкладке “Свойства”.  19. При подключении к базе данных с уровнем совместимости 8 на сервере SQL Server 2005 появлялось сообщение об ошибке и не обновлялись объекты Contracts и Routes. Исправлено.  20. Если в панели управления в диалоге “Язык и региональные стандарты” на первой и последней закладках установлены разные языки и в этих языках разные дробные разделители, то при открытии данных таблиц с полями типа NUMERIC возникала ошибка. Исправлено.  21. Сетка данных. В случае использования формата даты с текстовым месяцем (напр. dd-MMM-yyyy) при редактировании даты возникала ошибка. Исправлено.  22. Для некоторых команд из контекстного меню быстрого кода неправильно указывались “горячие клавиши”. Исправлено.  23. Другие улучшения и исправления.\n\n\nScreens\n\n\n\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:067635BBF3A542CB5487BB7008F532B9473540BE&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=EMS%20SQL%20Manager%202008%20for%20SQL%20Server%20v3.3.0.1%20%5B%D0%A1%D0%A3%D0%91%D0%94%5D","torrent_link":"dl.php?t=1143395","thanked_list":[{"id":"37816621","name":"bor_2014 ","data":"(18-Фев-20)"},{"id":"5404377","name":"BatalinVA ","data":"(24-Сен-19)"},{"id":"40040084","name":"Axe57 ","data":"(10-Фев-19)"},{"id":"42012810","name":"panalexpan97 ","data":"(18-Фев-18)"},{"id":"6732501","name":"hyper911 ","data":"(14-Дек-17)"},{"id":"25712205","name":"vanikin9 ","data":"(12-Окт-17)"},{"id":"158990","name":"tosha30 ","data":"(14-Июн-17)"},{"id":"14925286","name":"dLMODh1Qhh ","data":"(06-Май-17)"},{"id":"11641594","name":"MrHalg ","data":"(28-Мар-17)"},{"id":"39506767","name":"pooh06 ","data":"(06-Дек-16)"},{"id":"9580548","name":"Hr. Schwein ","data":"(26-Окт-16)"},{"id":"14361300","name":"habramit ","data":"(28-Сен-16)"},{"id":"5152181","name":"Zunder86 ","data":"(12-Июл-16)"},{"id":"15220197","name":"vapollonova ","data":"(04-Июл-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"9490466","name":"KOSTKOR ","data":"(22-Янв-16)"},{"id":"15570156","name":"zurfishe ","data":"(13-Янв-16)"},{"id":"0","name":"Гость","data":"(07-Дек-15)"},{"id":"10694630","name":"Dima0101010101 ","data":"(24-Ноя-15)"},{"id":"18804110","name":"Jilio ","data":"(19-Июн-15)"},{"id":"37473372","name":"kugelmann ","data":"(27-Май-15)"},{"id":"1971614","name":"konvita2 ","data":"(16-Апр-15)"},{"id":"17149222","name":"thermo4 ","data":"(14-Фев-15)"},{"id":"14913372","name":"sash_nt ","data":"(29-Янв-15)"},{"id":"23592212","name":"jefttut ","data":"(27-Янв-15)"},{"id":"9274308","name":"kjbnn ","data":"(19-Янв-15)"},{"id":"17726701","name":"beralus ","data":"(18-Янв-15)"},{"id":"13319980","name":"::Green:: ","data":"(27-Май-14)"},{"id":"14166695","name":"mv1955 ","data":"(18-Фев-14)"},{"id":"4992660","name":"ilnar9 ","data":"(16-Янв-14)"},{"id":"20304957","name":"oleggoran ","data":"(12-Ноя-13)"},{"id":"13382445","name":"pterodacte1 ","data":"(22-Окт-13)"},{"id":"9703563","name":"valnech ","data":"(22-Сен-13)"},{"id":"13676025","name":"RыжаЯ_Я ","data":"(12-Авг-13)"},{"id":"12459806","name":"Kuzmich2008 ","data":"(01-Июл-13)"},{"id":"8970537","name":"Vikkens ","data":"(02-Май-13)"},{"id":"20645472","name":"egob ","data":"(08-Мар-13)"},{"id":"28083193","name":"antlltna ","data":"(06-Мар-13)"},{"id":"2550769","name":"vitmark ","data":"(05-Мар-13)"},{"id":"6694331","name":"Pluto2008 ","data":"(14-Янв-13)"},{"id":"18200558","name":"AngelTMB38 ","data":"(14-Дек-12)"},{"id":"994467","name":"laaua ","data":"(03-Сен-12)"},{"id":"13843327","name":"seal-zone ","data":"(03-Сен-12)"},{"id":"23292184","name":"BratislawMMZ ","data":"(26-Авг-12)"},{"id":"14240512","name":"andrews_1 ","data":"(18-Авг-12)"},{"id":"15698470","name":"gorelli ","data":"(12-Авг-12)"},{"id":"0","name":"Гость","data":"(02-Мар-12)"},{"id":"0","name":"Гость","data":"(06-Мар-11)"}]}