{"link":"1340456","name":"EMS SQL Manager 2007 for PostgreSQL v4.5.0.1 [СУБД]","date":"12-Дек-08 19:55","author":"-TZAR-","description":"\nEMS SQL Manager 2007 for PostgreSQL v4.5.0.1Год выпуска: 12/10/2008\nВерсия: 4.5.0.1\nРазработчик: EMS Database Management Solutions\nПлатформа: Windows 2k - Vista\nЯзык: eng / rus\nТаблетка: ПрисутствуетОписание: EMS SQL Manager for PostgreSQL – это высокопроизводительная программа для разработки и администрирования серверов баз данных PostgreSQL. SQL Manager for PostgreSQL работает со всеми версиями PostgreSQL и поддерживает все самые новые возможности PostgreSQL, включая типы данных enumerated, text search, XML и UUID, порядок сортировки индексных ключей PostgreSQL, массивы составных типов и другие. Программа включает в себя множество инструментов, таких как Визуальный конструктор баз данных, который позволяет быстро создавать базы данных PostgreSQL, Визуальный конструктор запросов для построения сложных запросов к PostgreSQL, мощный редактор BLOB и многие другие полезные инструменты для эффективного администрирования PostgreSQL. Современный, графический интерфейс и оптимальная система мастеров настроек будут понятны даже новичку.Ключевые особенности * Поддержка данных UTF8\n* Великолепные графические и текстовые инструменты для построения запросов\n* Современный графический интерфейс пользователя\n* Быстрая навигация и управление базами данных\n* Эффективные инструменты управления данными\n* Полная совместимость со всеми версиями PostgreSQL, вплоть до версии 8.3\n* Улучшенный проводник баз данных для более простого управления объектами PostgreSQL\n* Эффективное управление параметрами безопасности\n* Впечатляющие возможности импорта и экспорта данных\n* Мощный визуальный конструктор баз данных\n* Простые и удобные мастера для выполнения задач PostgreSQL\n* Соединение при помощи переадресации локальных портов через SSH туннель\n* Доступ к серверу PostgreSQL посредством протокола HTTP\n\nЧто нового в SQL Manager for PostgreSQL 4.5.0.1\n\n   1.  Регистрационная информация базы данных.          * Большинство параметров раздела \"Сетка | Настройки данных\" в диалоге \"Настройки окружения\" теперь можно настраивать для каждой базы данных индивидуально в окне регистрационной информации баз данных. Значения параметров, заданных в диалоге Настройки окружения теперь используются только как значения по умолчанию для вновь регистрируемых баз данных.          * Добавлена опция “Schema-organized database tree”, при отключении которой для данной базы в Проводнике БД строится дерево без разбивки объектов по схемам.          * Для журналов метаданных и Редактора SQL теперь есть возможность задать и сохранять данные в кодировке Unicode или ANSI.   2. Конструктор запросов.          * Если таблица имеет связи посредством внешних ключей с другими таблицами из запроса, то при добавлении таблицы в запрос добавляются соответствующие выражения JOIN.          * В некоторых случаях при переименовании таблиц и переходе на вкладку SQL возникала ошибка “Cannot bind JOIN expression”. Исправлено.   3. Редактор функций.          * Теперь можно посмотреть результат выполнения функций, возвращающих курсор.          * Если для аргумента функции DOUBLE PRECISION задать значение 0, при выполнении функции это значение заменялось на NULL.   4. Теперь поддерживается Unicode в теле функций, представлениях, правилах, проверочных ограничениях, описаниях объектов, значениях по умолчанию для полей, доменов и в других свойствах объектов.   5. Проводник БД.          * Теперь многие объекты из различных расширений сервера PostgreSQL считаются системными и не показываются, если для базы данных отключена опция “Показывать системные объекты”.          * Улучшенный диалог поиска объектов.          * На панели инструментов поиска добавлена кнопка переключения режима поиска.          * Добавлена возможность менять порядок хостов путем перетаскивания их мышкой.          * При закрытии программы сохраняется информация о последней рабочей базе, и при повторном запуске эта база автоматически выбирается в дереве.          * При двойном щелчке по папке объектов, она раскрывается или сворачивается.   6. Визуальный конструктор баз данных.          * Теперь таблицы располагаются более плотно при обратном проектировании (reverse engineering).          * Настройки выравнивания объектов на диаграмме не работали после открытия диаграммы из файла.          * На некоторых принтерах не печатались иконки полей и таблиц. Исправлено.   7. Вкладка \"Данные | Вид BLOB\". Добавлена вкладка XML для просмотра содержимого BLOB поля в виде XML.   8. Сетка данных. Изменение принципа работы в асинхронном режиме – использование отдельного подключения для каждой сетки данных позволяет производить выборку данных без потери возможности одновременного использования остальных функций программы.   9. Извлечение базы данных, экспорт в сценарии SQL. Сейчас сценарий создается сразу в выбранной кодировке символов, что значительно уменьшает время его создания.  10. Настройки. Во всех формах настроек добавлена возможность возврата к установкам по умолчанию как для всех параметров, так и для конкретной категории.  11. Редакторы представлений и правил. Теперь при открытии Редактора SQL запрос форматируется с помощью SQL Formatter. Также DDL представлений теперь не содержит лишних скобок в выражениях.  12. Теперь в качестве владельца объекта можно задать и роль (для PostgreSQL версии 8.1 и выше).  13. Список окон. Добавлена команда закрытия всех окон баз данных (“Close All Database Windows”).  14. Редактор внешних ключей. Теперь в редакторе можно посмотреть и отредактировать описание внешнего ключа.  15. Значение опции “Serial fields as integer” теперь распространяется не только на DDL таблицы, но и на все места, где отображается тип поля.  16. На закладке Редакторы объектов в диалоге \"Настройки окружения\" добавлена опция, позволяющая выбрать, разбивать ли функции опции в DDL на несколько строк, или показывать все опции в одну строку.  17. Редактор таблиц. Мастера экспорта/импорта данных и экспорта в сценарии SQL теперь доступны, даже если данные таблицы не открыты.  18. Мастер сохранения настроек. Теперь если файл для экспорта настроек уже существует, то выдается запрос на его перезапись или генерацию уникального имени.  19. Редактор проверочных ограничений. Теперь можно менять размер окна, размер сохраняется между сеансами работы.  20. Сетка данных. Теперь цвет курсора меняется, если сетка данных неактивна.  21. Редактор SQL. В качестве имени запроса можно было задать имя уже существующего запроса. Исправлено.  22. Параметры кода.          * Параметры кода не всегда отображались для второго и последующих аргументов функции.          * При наличии нескольких функций с одинаковым именем и разными аргументами показывались аргументы только одной из них. Исправлено.          * Если автоматическое отображение параметров кода было отключено, то параметры не показывались даже при нажатии Ctrl+Shift+Space. Исправлено.  23. Исправлены ошибки, связанные с неверным отображением в DDL типов полей для массивов на основе пользовательских типов данных.  24. Редактор SQL.          * Исправлено несколько ошибок, связанных с некорректной подсветкой SQL кода.          * Если при сохранении содержимого в файл указать кодировку, отличную от Unicode, при последующем сохранении кодировка сбрасывалась в Unicode.  25. При соединении через HTTP туннель если при сохранении объекта возникала ошибка, то она не отображалась в окне изменения метаданных, и всегда позволялось зафиксировать изменения, хотя реально на сервере изменения не произвелись.  26. В дереве зависимостей и на вкладке Зависимости не отображались зависимости составных и табличных типов с другими объектами.  27. При редактировании или удалении записей таблиц, содержащих polygon и/или point поля, иногда возникала ошибка. Исправлено.  28. Отладчик функций. Возникала ошибка синтаксиса (“Syntax error”) при открытии функций с конструкцией FOR ... IN. Исправлено.  29. Числовые поля большой точности не совсем корректно редактировались и отображались в гриде. Исправлено.  30. После изменения порядка столбцов значения последовательностей SERIAL полей не восстанавливались.  31. При некоторых настройках PostgreSQL сервера при редактировании поля money возникала ошибка. Исправлено.  32. Свойства базы данных. Если описание базы данных содержало символ \"\\\", при сохранении возникала ошибка. Исправлено.  33. Другие исправления и улучшения.\n\n\nScreens\n\n \n \n \n \n \n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:5D66A2284E15648AA33DC0B5F0B04B2CF1E3A86F&tr=http%3A%2F%2Fbt2.t-ru.org%2Fann%3Fmagnet&dn=EMS%20SQL%20Manager%202007%20for%20PostgreSQL%20v4.5.0.1%20%5B%D0%A1%D0%A3%D0%91%D0%94%5D","torrent_link":"dl.php?t=1340456","thanked_list":[{"id":"40746623","name":"schura7493 ","data":"(22-Фев-23)"},{"id":"21528438","name":"Vero&Slava ","data":"(19-Дек-22)"},{"id":"46359420","name":"Vladimir-1969 ","data":"(06-Дек-22)"},{"id":"13752282","name":"lua ","data":"(22-Янв-21)"},{"id":"38116754","name":"незнайко ","data":"(21-Июл-20)"},{"id":"227003","name":"bloodden ","data":"(06-Апр-20)"},{"id":"21761518","name":"ketmm1 ","data":"(18-Фев-20)"},{"id":"29880664","name":"vsart68 ","data":"(30-Янв-18)"},{"id":"18562312","name":"Eskogito ","data":"(01-Дек-17)"},{"id":"4628531","name":"jimmhockins ","data":"(01-Авг-17)"},{"id":"1559747","name":"lam007 ","data":"(16-Июн-17)"},{"id":"15698470","name":"gorelli ","data":"(25-Мар-17)"},{"id":"17016270","name":"uservs ","data":"(12-Янв-17)"},{"id":"23552493","name":"vaall1 ","data":"(16-Ноя-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"29871226","name":"Kuzya8791 ","data":"(05-Мар-16)"},{"id":"16302893","name":"f0rky ","data":"(01-Дек-15)"},{"id":"18977054","name":"DORIAN78 ","data":"(19-Окт-15)"},{"id":"6668697","name":"stmorozov ","data":"(17-Сен-15)"},{"id":"28532866","name":"Evgenii61 ","data":"(14-Июл-15)"},{"id":"8869819","name":"ls_1204 ","data":"(02-Фев-15)"},{"id":"9044152","name":"elqwert ","data":"(03-Окт-14)"},{"id":"13910047","name":"_D_E_M_O_N_ ","data":"(26-Сен-14)"},{"id":"8397003","name":"Meldiga ","data":"(21-Фев-14)"},{"id":"19123995","name":"vik_ON_t ","data":"(12-Фев-14)"},{"id":"12520293","name":"Scr1pt1k ","data":"(05-Фев-14)"},{"id":"13680745","name":"Rusk51 ","data":"(14-Ноя-13)"},{"id":"4834230","name":"buchiks ","data":"(10-Окт-13)"},{"id":"25431683","name":"gpkuklin ","data":"(04-Сен-13)"},{"id":"18543222","name":"Gospodin nikto ","data":"(27-Авг-13)"},{"id":"26677548","name":"SilverVik ","data":"(05-Июн-13)"},{"id":"18114934","name":"AngelOSH ","data":"(25-Май-13)"},{"id":"421695","name":"Seaward ","data":"(19-Фев-13)"},{"id":"7512500","name":"Sirius-2 ","data":"(30-Окт-12)"},{"id":"19228246","name":"ramzay_77 ","data":"(14-Сен-12)"},{"id":"994467","name":"laaua ","data":"(03-Сен-12)"},{"id":"10512158","name":"4RESTER ","data":"(17-Июл-12)"},{"id":"17574280","name":"teodorism ","data":"(28-Май-12)"},{"id":"11093432","name":"igor_rudyk ","data":"(25-Сен-11)"},{"id":"9457680","name":"huminclouds ","data":"(15-Июн-11)"},{"id":"5565900","name":"zmr ","data":"(28-Май-11)"},{"id":"4785274","name":"Harrowere ","data":"(11-Мар-11)"},{"id":"0","name":"Гость","data":"(06-Мар-11)"},{"id":"5362187","name":"Илья29 ","data":"(08-Янв-11)"},{"id":"7791654","name":"antonov945 ","data":"(13-Ноя-10)"},{"id":"4880498","name":"tetradon_ ","data":"(27-Июн-10)"},{"id":"5683825","name":"ShurGent ","data":"(16-Июн-10)"},{"id":"10357389","name":"Roland Taverner ","data":"(07-Май-10)"},{"id":"0","name":"Гость","data":"(01-Дек-09)"},{"id":"0","name":"Гость","data":"(29-Окт-09)"},{"id":"0","name":"Гость","data":"(18-Сен-09)"}]}