{"link":"1402185","name":"Sybase PowerDesigner 15.0.0.2613 [СУБД]","date":"04-Янв-09 13:27","author":"kain_pl","description":"\nSybase PowerDesigner 15.0.0.2613Год выпуска: 2008\nВерсия: 15.0.0.2613\nРазработчик: Sybase\nПлатформа: Windows Vista/XP/2003\nЯзык интерфейса: Только английский\nТаблэтка: Присутствует\nСистемные требования:\nMicrosoft Windows XP/Server 2003/Vista\n1.5 GHz processor\n1 GB RAM\nSVGA or higher графический адаптер и совместимый цветной монитор (800x600)\nCD-ROM drive\nДо 500MB для инсталляции.\nОписание:\nSybase PowerDesigner – полнофункциональный инструментарий для создания бизнес-приложений, включающий в себя средства моделирования бизнес-процессов, возможности концептуального и физического проектирования баз данных, возможности моделирования с использованием UML, и предоставляющий централизованный репозитарий для хранения моделей и объектов.\nОсновные особенности продукта PowerDesigner:\n* Моделирование бизнес-процессов на основе диаграмм потоков управления.\n* Технологии моделирования данных (концептуальная и физическая модель), основанные на индустриальном стандарте «сущность/связь» (entity/relationship), включая технологии моделирования хранилищ данных (схемы «звезда» и «снежинка», многомерное моделирование, привязка к конкретному источнику данных).\n* Стандартные диаграммы UML: use case, activity, sequence, диаграммы классов, компонентов и другие диаграммы.\n* Поддержка UML 2.\n* Генерация на основе диаграмм классов исходных текстов для Java, C#, C++, PowerBuilder и VB.Net.\n* Генерация операторов DDL (Data Definition Language) более чем для 50 РСУБД включая Oracle вплоть до версии 10g, IBM DB/2 до v8, Microsoft SQL Server 2000, Sybase ASE, ASA and IQ, MySQL и для многих других\n* Поддержка EJB 2.0.\n* Определение сложных пользовательских типов данных, включая Java-классы и хранимые Java–процедуры, содержащиеся в БД.\n* Обратное проектирование схемы базы данных в концептуальную и физическую модель.\n* Обратное проектирование существующей бизнес-логики в диаграммы классов (Java, PowerBuilder, C#, VB.Net).\n* Прямое и обратное проектирование XML-приложений в диаграммы классов. Поддержка XML-DTD, XML-схемы и XML-данных.\n* Интеграция с популярными средствами разработки на Java и с ведущими сертифицированными под J2EE/EJB 2.0 серверами приложений.\n* Requirement Model, специализированная модель для документирования и анализа требований предъявляемых к создаваемой информационной системе.\n* Information Liquidity Model, модель предназначенная для проектирования систем репликации данных.\n* Современный, графический, настраиваемый пользовательский интерфейс, содержащий\n    * общую оболочку;    * обозреватель объектов;    * область редактирования диаграмм;    * область состояния. \n* Улучшенное управление моделями, включая синхронизацию объектов, моделей и баз данных.\n* Расширенный, независимый от модели генератор отчетов, позволяющий получить документ, включающий в себя информацию по нескольким моделям.\nЦентрализованный репозитарий обеспечивает:\n* возможность одновременной работы над одной моделью большого числа различных аналитиков и проектировщиков;\n* хранение, управление и создание версий моделей PowerDesigner и других документов;\n* поиск объектов в модели и их повторное использование в других моделях;\n* эффективное управление взаимосвязями между моделями.\nПреимущества PowerDesigner\nСнижение затрат при разработке Web-служб через проектирование\n* Быстрая разработка с применением UML – с интеграцией со средствами разработки для ускорения создания Web-служб – делает простым и доступным создание сложных Web-служб.\n* Быстрая разработка базы данных, которая поддерживает Web-службы в области хранения существующих или новых данных, упрощает взаимодействие разработчика и администратора базы данных.\n* Оперативный учет всех изменений на этапе проектирования позволяет снизить общие затраты на разработку.\nУникальная усовершенствованная технология синхронизации многочисленных моделей\nПоскольку бизнес-моделирование и техническое моделирование тесно взаимосвязаны, информация обо всех изменениях, происходящие в деловой сфере или на рынке, доводится непосредственно до сотрудников IT-отдела компании, позволяя им адаптировать Web-службы и дизайн системы в соответствии с требованиями бизнеса, поддерживая, а не сдерживая его развитие.\nКомпоненты Sybase PowerDesigner\nВ зависимости от ваших требований к проектированию и разработке, вы можете выбрать только необходимые модули PowerDesigner, т.е. приобрести только тот комплект функциональных возможностей, который вам необходим.\nPhysicalArchitect (PDM)\nФизическое проектирование и генерация базы данных, включая моделирование хранилищ данных. Этот модуль, входящий в состав минимальной конфигурации, обеспечивает инструментальные средства, необходимые для создания физических моделей баз данных, как OLTP, так и OLAP, генерации SQL-кода и реинжиниринга существующих баз данных из гетерогенных источников.\nDataArchitect (PDM, CDM)\nДвухуровневое, итерационное проектирование баз данных и генерация операторов SQL, создающих базу данных спроектированной структуры. Поддерживает интегрированное физическое и концептуальное моделирование данных (включая моделирование хранилищ данных), позволяя вам проектировать и генерировать базы данных для более чем 50 РСУБД и настольных платформ.\nObjectArchitect (PDM, CDM, OOM)\nОбъектно-ориентированный анализ и проектирование в комбинации с двухуровневым, итерационным проектированием баз данных и языком описания базы данных (DLL). Теперь, с расширенной поддержкой UML, интегрированной с возможностями моделирования данных от DataArchitect, модуль ObjectArchitect делает максимально эффективной работу проектировщиков баз данных и приложений. Разработчикам доступны 9 типов UML-диаграмм - use case, activity, sequence, collaboration, statechart, диаграммы классов, компонентов, и другие.\nDeveloper (PDM, OOM)\nОбъектное моделирование и физическое проектирование баз данных. Это идеальный инструмент для разработчика. Физическое моделирование данных, интегрированное с UML-моделированием (use case, activity, sequence, диаграммы классов и компонентов), включающее возможности генерации сложного объектного кода и реинжиниринг.\nStudio (BPM, PDM, CDM, OOM)\nПоставляемый в редакциях Personal и Enterprise, модуль Studio объединяет в себе технологии моделирования бизнес-процессов с возможностями расширенного UML-моделирования и моделирования данных. Комбинируя все необходимые методы моделирования в одной среде, эти модули дают возможность бизнес- и IT-менеджерам с их командами разработчиков совместно строить бизнес-системы, эффективно поддерживающие работу вашего предприятия.\nViewer\nОбеспечивает всем IT-специалистам вашей организации единое представление информации о моделировании. Этот модуль, работающий только в режиме чтения (read-only), обеспечивает графическое представление информации обо всех смоделированных компонентах системы и включает генератор отчетов с расширенной функциональностью.\nОпция Enterprise\nОбновив любой модуль до версии Enterprise (ранее известной как “with MetaWorks option”), вы получаете возможность работы с репозитарием, просмотра и совместной работы над моделями со всеми членами вашей группы. Версия Enterprise обеспечивает ведение центрального архива (репозитария) для моделей и других файлов, что значительно облегчает контроль доступа, совместное использование, сотрудничество, консолидацию, проверку версий и управление в рамках работы с моделями.\n\nСкриншоты\n\n\n\n\n\n\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:EE2C4461AEFD6C333E59AFAD546AB426A5C42739&tr=http%3A%2F%2Fbt2.t-ru.org%2Fann%3Fmagnet&dn=Sybase%20PowerDesigner%2015.0.0.2613%20%5B%D0%A1%D0%A3%D0%91%D0%94%5D","torrent_link":"dl.php?t=1402185","thanked_list":[{"id":"37598036","name":"ZoranG ","data":"(25-Апр-20)"},{"id":"25431683","name":"gpkuklin ","data":"(28-Ноя-18)"},{"id":"27529607","name":"Мирамани ","data":"(07-Июл-17)"},{"id":"41612117","name":"revenant09 ","data":"(22-Апр-17)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"10692638","name":"V79 ","data":"(27-Сен-15)"},{"id":"18175581","name":"elanalx ","data":"(13-Сен-15)"},{"id":"15377046","name":"lepuha52 ","data":"(18-Май-15)"},{"id":"36623643","name":"KaifasKain ","data":"(28-Фев-15)"},{"id":"0","name":"Гость","data":"(19-Янв-15)"},{"id":"17003795","name":"fours4 ","data":"(08-Ноя-14)"},{"id":"0","name":"Гость","data":"(23-Окт-14)"},{"id":"16769132","name":"flm_track ","data":"(07-Авг-14)"},{"id":"28634203","name":"gamjor ","data":"(09-Июн-14)"},{"id":"18229854","name":"Wladiss ","data":"(09-Июн-14)"},{"id":"23375495","name":"Rafflesia keithii ","data":"(13-Май-14)"},{"id":"14406828","name":"cvv001 ","data":"(09-Апр-14)"},{"id":"23942874","name":"Adrianna22 ","data":"(02-Мар-14)"},{"id":"20853535","name":"Mr_Baran ","data":"(06-Фев-14)"},{"id":"22615929","name":"FC Porto Fan - 2009 ","data":"(02-Фев-14)"},{"id":"0","name":"Гость","data":"(30-Дек-13)"},{"id":"9386212","name":"BrawnJP ","data":"(28-Дек-13)"},{"id":"24067056","name":"blood_crow ","data":"(27-Дек-13)"},{"id":"11707715","name":"daffulter ","data":"(20-Дек-13)"},{"id":"24498537","name":"electro sun ","data":"(13-Дек-13)"},{"id":"0","name":"Гость","data":"(29-Ноя-13)"},{"id":"28117951","name":"Ольга_1995 ","data":"(23-Ноя-13)"},{"id":"0","name":"Гость","data":"(10-Ноя-13)"},{"id":"0","name":"Гость","data":"(09-Ноя-13)"},{"id":"15341372","name":"Horo1993 ","data":"(23-Окт-13)"},{"id":"23194563","name":"Lunapark123456 ","data":"(12-Сен-13)"},{"id":"22629738","name":"sitehot ","data":"(02-Июн-13)"},{"id":"0","name":"Гость","data":"(14-Май-13)"},{"id":"13581427","name":"Оля181991 ","data":"(29-Апр-13)"},{"id":"0","name":"Гость","data":"(17-Апр-13)"},{"id":"25263561","name":"spidiq ","data":"(13-Мар-13)"},{"id":"14168981","name":"Ozza ","data":"(10-Мар-13)"},{"id":"1162841","name":"bv7 ","data":"(04-Мар-13)"},{"id":"0","name":"Гость","data":"(09-Дек-12)"},{"id":"17979505","name":"xetr ","data":"(03-Дек-12)"},{"id":"0","name":"Гость","data":"(28-Ноя-12)"},{"id":"13773902","name":"lucasss80 ","data":"(23-Ноя-12)"},{"id":"11951412","name":"bsvbb ","data":"(21-Ноя-12)"},{"id":"17578755","name":"Sabi34 ","data":"(03-Ноя-12)"},{"id":"16189141","name":"WillSom ","data":"(30-Окт-12)"},{"id":"15043097","name":"mashadar ","data":"(18-Окт-12)"},{"id":"20565215","name":"Alex_Forester ","data":"(17-Окт-12)"},{"id":"11974745","name":"alex_kart1986 ","data":"(07-Окт-12)"},{"id":"4849498","name":"lamvrokakis ","data":"(02-Окт-12)"},{"id":"18157359","name":"megaspring ","data":"(22-Авг-12)"},{"id":"0","name":"Гость","data":"(28-Фев-11)"}]}