{"link":"1482877","name":"Sybase PowerBuilder 11.5.1 Build 4566 Торрент перезалит 02.10.2009","date":"26-Янв-09 10:41","author":"Ivan195","description":"\nSybase PowerBuilder 11.5.1Версия: 11.5.1 Build 4566\nРазработчик: Sybase\nПлатформа: Win32\nСовместимость с Vista: неизвестно\nЯзык интерфейса: только английский\nТаблэтка: Присутствует\nОписание:\nВ состав входят также InfoMaker 11.5 и SQL Anywhere 11Новая версия популярной среды быстрой разработки приложений Sybase PowerBuilder обладает функциональными возможностями, характерными только для самых развитых средств, и гибкостью позволяющей вести разработку для наиболее подходящих для вас платформ. PowerBuilder включает новые и развивающиеся технологии, которые позволяют быстро и легко создавать традиционные 2-х звенные приложения, распределённые приложения, Web-приложения и Smart-клиенты. Используя данную версию, Вы можете легко разворачивать уже существующие приложения на платформе .Net.\nИспользование .NET Web Form - Традиционные приложения клиент/сервер могут быть быстро и просто развёрнуты в Web, и стать доступными для любого пользователя использующего Web броузер. Web Form приложения не требуют инсталляции на клиенте, просто обновляются, не требуют затрат на распространение.Использование .NET Windows Form с опцией smart client - Window Form приложения с опцией smart client сочетают в себе функциональную мощь приложений клиент/сервер с удобством Web-среды. Опция smart client упрощает распространение и обновление приложений.PowerBuilder Non-Visual Objects (NVOs) как .NET сборки - С помощью нового мастера .NET Assembly target wizard вы можете развёртывать свои PowerBuilder NVO объекты как классы в .NET сборки. Типы данных будут автоматически преобразованы из PowerScript в C#.Использование PowerBuilder NVO как .NET Web сервисов - Вы можете развертывать PowerBuilder NVO объекты как .NET Web-сервисы, обеспечивая возможность работы в гетерогенных, кросс-платформенных средах.Отладчик .Net - После развёртывания .NET приложения вы можете отлаживать его с помощью отладчика PowerBuilder.Условная компиляция - Вы можете использовать условную компиляцию при разработке приложений, которые планируется растространять на более чем одну платформу.Взаимодействие с .NET - Доступ к богатому множеству сервисов и классов .NET Framework через написание кода на PowerBuilder и создание .NET классов, вызова .NET методов и доступа к .NET свойствам.Импорт .Net сборок - Импортируйте .NET сборки в свои .NET приложения.Тип отображения TreeView для DataWindow - Вы можете прятать узлы дерева, перемещать строки, и использовать стандартные события Collapsing, Collapsed, Expanding, Expanded вместо пользовательских. TreeView DataWindow могут также использоваться как Web DataWindow в .NET Web Form приложениях.Web сервисы как источники данных для DataWindow - Создавая DataWindow вы можете использовать Web сервис как источник данных для всех типов отображения, кроме Rich Text и OLE.Запоминание аргументов выборки для DataWindow - Объект DataWindow может запоминать значения аргументов выборки при включении соответствующего свойства в окне задания значений аргументов. Это свойство доступно только во время разработки.Свойство столбца DataWindow UseEllipsis - При использовании этого свойства к строкам, имеющим слишком много символов для отображения, будет добавлено троеточие.Анимация окон - Специальные эффекты, такие как затухание и открытие из центра, скольжение или перекатывание теперь поддерживаются для окон PowerBuilder в разрабатываемых приложениях.Прозрачность окон - Приложения PowerBuilder теперь могут использовать окна с различной степенью прозрачности.Расширенная поддержка RDBMS - Предоставляется расширенная поддержка для MobiLink Synchronization, ASE 15, MSS SQL Server 2005 и HA событие оповещения для Oracle 10g.Поддержка PowerBuilder Application Server Plug-in - PowerBuilder NVO объекты теперь могут размещаться на J2EE серверах приложений сторонних производителей, таких как WebSphere 6.1, WebLogic 9.2, JBoss 4.0.4.Улучшенный Project painter - В project painter диалоговые окна Select Objects и Properties удалены, закладки со свойствами теперь отображаются в рабочем пространстве.Улучшенный System Tree - События и функции, содержащие код, теперь визуально выделены (имеют особые иконки). Двойное нажатие на иконке события или функции в System Tree открывает painter для этого скрипта. .NET сборки отображаются в соответствующем проекте в System Tree и могут быть раскрыты для отображения своих классов и методов.Улучшенное окно вывода сообщений - Сообщения, ранее отображавшиеся в одной панели, теперь отображаются на разных панелях окна (default, debug, errors, warnings, search, unsupported features) в зависимости от типа сообщения.Многие диалоговые окна можно изменять в размерах - Теперь многие диалоговые окна среды разработки теперь могут быть изменены в размерах для просмотра длинных имён файлов без прокрутки.Меню и панели инструментов - Новый вид меню и панелей инструментов, который был реализован в версии 10.5, теперь используется в среде разработки.\n\nСкриншоты\n\n\n\n\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:4495C27FD99B5AB5DC5E8054E236D15E3828C736&tr=http%3A%2F%2Fbt2.t-ru.org%2Fann%3Fmagnet&dn=Sybase%20PowerBuilder%2011.5.1%20Build%204566%20%D0%A2%D0%BE%D1%80%D1%80%D0%B5%D0%BD%D1%82%20%D0%BF%D0%B5%D1%80%D0%B5%D0%B7%D0%B0%D0%BB%D0%B8%D1%82%2002.10.2009","torrent_link":"dl.php?t=1482877","thanked_list":[{"id":"17256989","name":"wlalele ","data":"(10-Мар-23)"},{"id":"18062101","name":"valery.s.1975 ","data":"(23-Сен-21)"},{"id":"2685597","name":"rosenkrantz ","data":"(02-Авг-21)"},{"id":"15960786","name":"RazielAnOfDe ","data":"(07-Апр-21)"},{"id":"10309331","name":"dimks.s2 ","data":"(28-Окт-20)"},{"id":"25287407","name":"fo9312 ","data":"(28-Июл-19)"},{"id":"15043214","name":"McLN ","data":"(07-Май-19)"},{"id":"18355624","name":"Asheronliner ","data":"(07-Дек-17)"},{"id":"40477706","name":"fei2578 ","data":"(01-Авг-17)"},{"id":"36133327","name":"4-maks-44 ","data":"(14-Июл-17)"},{"id":"3040862","name":"llebedev ","data":"(18-Май-17)"},{"id":"12208617","name":"mac2008 ","data":"(05-Май-17)"},{"id":"5682740","name":"VRIGJTVQXC ","data":"(31-Мар-17)"},{"id":"21957098","name":"Unison{UA} ","data":"(13-Ноя-16)"},{"id":"41675703","name":"AG2016 ","data":"(13-Окт-16)"},{"id":"16408673","name":"SFAP ","data":"(04-Авг-16)"},{"id":"4220617","name":"AndreLokos ","data":"(30-Июл-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"35555101","name":"ALiAS_2014 ","data":"(24-Фев-16)"},{"id":"19652647","name":"Mike Nickittin ","data":"(24-Янв-16)"},{"id":"31742827","name":"Macduck2007 ","data":"(04-Дек-15)"},{"id":"33796101","name":"automatochka ","data":"(20-Авг-15)"},{"id":"1759778","name":"kharshakh ","data":"(14-Авг-15)"},{"id":"0","name":"Гость","data":"(27-Июл-15)"},{"id":"36623643","name":"KaifasKain ","data":"(16-Июл-15)"},{"id":"16367376","name":"Rfrfi ","data":"(29-Июн-15)"},{"id":"0","name":"Гость","data":"(30-Май-15)"},{"id":"222657","name":"sorin_v ","data":"(09-Май-15)"},{"id":"0","name":"Гость","data":"(01-Мар-15)"},{"id":"0","name":"Гость","data":"(19-Янв-15)"},{"id":"18733251","name":"ViRUS2k10 ","data":"(07-Янв-15)"},{"id":"0","name":"Гость","data":"(29-Дек-14)"},{"id":"32284302","name":"yiyux ","data":"(12-Дек-14)"},{"id":"22336308","name":"Юлия060873 ","data":"(25-Ноя-14)"},{"id":"3774289","name":"Koba_13 ","data":"(09-Ноя-14)"},{"id":"18231533","name":"Starets85 ","data":"(11-Июн-14)"},{"id":"28634203","name":"gamjor ","data":"(09-Июн-14)"},{"id":"15572872","name":"NigDan0) ","data":"(02-Июн-14)"},{"id":"9314660","name":"cehanovsk ","data":"(05-Мар-14)"},{"id":"9386212","name":"BrawnJP ","data":"(02-Мар-14)"},{"id":"6496828","name":"metall-00821 ","data":"(07-Янв-14)"},{"id":"33969190","name":"sanyrev1 ","data":"(13-Дек-13)"},{"id":"19790483","name":"Ангелус2009 ","data":"(10-Дек-13)"},{"id":"21425818","name":"sbkarn ","data":"(14-Июл-13)"},{"id":"26889335","name":"ig-petrov ","data":"(13-Июл-13)"},{"id":"25345956","name":"45viktor4545 ","data":"(30-Май-13)"},{"id":"0","name":"Гость","data":"(27-Мар-13)"},{"id":"6339575","name":"wookoos ","data":"(10-Мар-13)"},{"id":"28610155","name":"msela ","data":"(08-Мар-13)"},{"id":"0","name":"Гость","data":"(19-Фев-11)"},{"id":"0","name":"Гость","data":"(31-Янв-11)"},{"id":"0","name":"Гость","data":"(08-Дек-10)"},{"id":"0","name":"Гость","data":"(04-Дек-10)"},{"id":"0","name":"Гость","data":"(14-Ноя-10)"},{"id":"0","name":"Гость","data":"(19-Май-10)"}]}