{"link":"2031431","name":"Embarcadero ERStudio 8.0.3 [СУБД]","date":"21-Июл-09 00:34","author":"Impaler","description":"\nEmbarcadero ERStudio 8.0.3Год выпуска: 2009\nВерсия: 8.0.3\nРазработчик: Embarcadero Technologies, Inc.\nПлатформа: Windows\nСовместимость с Vista: полная\nСистемные требования:\n* 100 MB пространства на жестком диске\n* Память 512 MB (для больших диаграмм, содержащих свыше 1000 сущностей, рекомендуется 1 Гб )\n* Разрешение экрана 1024 x 768 - рекомендуется\n* Windows® 2000, Windows XP и Windows 2003 Server, а также Windows Vista (Ultimate и Business) – только 32-битная архитектура (SP1и SP2)\n* Нативные соединения: Oracle®, IBM® DB2® UDB (LUW, iSeries и z/OS), клиентские библиотеки SQL Server и Sybase®\n* Соединения ODBC: Для баз данных, поддерживаемых через ODBC, требуется соответствующий драйвер ODBC\nЯзык интерфейса: только английский\nТаблэтка: Присутствует\nОписание:\n\nскрытый текст\nER/Studio - комплексный инструментарий, предназначенный для работы с моделями данных и их анализа на логическом и физическом уровне. Он предназначен для проектирования, создания и сопровождения баз данных. ERStudio предоставляет мощные средства проектирования, которые обеспечивают интегрированный подход к удовлетворению потребностей специалистов, обслуживающих корпоративные базы данных, и упрощают их работу. Специалисты разных профилей могут использовать его уникальные возможности: * Архитекторы данных - мощные средства логического моделирования, включающие стандартизацию и повторное использование элементов данных;\n* Администраторы баз данных - эффективную поддержку всех этапов жизненного цикла данных для разнообразных СУБД, включая автоматизированную генерацию кода, обратное проектирование (\"reverse engineering\") и внесение изменений;\n* Разработчики прикладных систем - за счет возможностей анализа воздействий, построенного с использованием средств парсинга, получают инструмент разработки приложений, основанный на использовании UML;\n* Руководители ИТ и бизнеса - благодаря наличию мощных средств ER/Studio для представления документации через WEB, получают дополнительные возможности анализа использования данных в работе предприятия. Ключевые решения Embarcadero, такие, как DT/Studio, позволяют расширить сферу стандартизации и интеграции.ER/Studio обеспечивает прозрачность использования данных в масштабах всего предприятия. Простой и легкий в использовании, он помогает организациям принимать обоснованные решения относительно того, как эффективно устранять возникающие \"узкие места\", избавляться от избыточности, и, как результат, добиваться более качественного функционирования корпоративных приложений.Проектирование баз данных, основанное на работе с моделямиEmbarcadero ER/Studio Начинаете ли вы новую разработку или занимаетесь поддержкой существующей базы данных, ER/Studio предоставит вам набор необходимых функций, которые позволят выполнить работу эффективно и качественно. С помощью мощного и простого в использовании инструментария моделирования ER/Studio обеспечит высокую производительность и получение существенного эффекта практически сразу после инсталляции. * Многоуровневые средства проектирования позволяют осуществлять разработку на логическом уровне. При этом результаты разработки могут быть трансформированы в любое количество физических моделей, которые поддерживают единые или различные системные каталоги СУБД. Как результат, пользователь может строить нормализованную структуру на логическом уровне с денормализацией на физическом уровне для повышения производительности. ER/Studio поддерживает связи между разными уровнями проектирования, и позволяет связывать их, двигаясь в любом направлении.\n* Анализ использования позволяет отобразить логические сущности и атрибуты на их реализацию на физическом уровне. Соответствующий интерфейс даст возможность также отобразить распределение сущностей по субмоделям в рамках единой модели.\n* Embarcadero ER/Studio Автоматизированные преобразования существенно упрощают построение физического уровня моделей на базе логического представления. При этом ER/Studio проверяет выполнение условий нормализации и синтаксис в соответствии с правилами выбранной целевой СУБД. Для использования на уровне физической модели могут быть определены соглашения об именах и параметры, связанные с использованием памяти.\n* Денормализующие преобразования. Мастер денормализации имеет инструменты для оптимизации физической модели базы данных. Такая оптимизация осуществляется после построения физической модели данных на основе логической. Упомянутые инструменты поддерживают набор популярных стратегий денормализации, например, горизонтальные и вертикальные расщепления, расширяющие и сворачивающие преобразования таблиц, отображения колонок и другие. Что особенно важно, денормализующие преобразования в ER/Studio сохраняют связь с логической моделью, и конкретные логические объекты остаются привязанными к тем физическим денормализованным объектам, к которым они относятся.\n* Мощные графические средства и функции автоматического размещения объектов. Будучи средством визуального проектирования, ER/Studio имеет совершенные средства для ясного представления сложных моделей и осуществления легкой навигации. ER/Studio имеет набор эффективных утилит по размещению объектов, позволяющих в один клик преобразовывать диаграммы по определенному принципу, например, иерархическому, в соответствии с которым \"родители\" следуют за \"детьми\", а те - за \"внуками\", в соответствии с распространением ключей.\n* Стандартизация и повторное использование элементов на основе словарей данных. ER/Studio помогает организовать использование определенных унифицированных элементов данных и других объектов в масштабах всего проекта. Интерфейс для глобального связывания, а также технология \"drag and drop\" позволяют осуществлять простой доступ к объектам для их повторного использования, в том числе импорта в другие проекты.\n* Навигация с помощью Эксплорера упрощает работу даже с самыми большими ER-диаграммами. Такую навигацию используют по всем объектам модели данных для того, чтобы уровне всей модели убедиться в соответствии имен объектов стандартам, быстро найти нужные имена объектов и получить доступ к их свойствам без необходимости поиска по всему пространству большой диаграммы.\n* Многоуровневые подмодели. Позволяют сохранять управляемость модели при ее росте. ER/Studio позволяет легко создавать подмодели для выделения важных участков из больших и сложных моделей. При этом автоматически поддерживаются все связи и зависимости между подмоделями и всей диаграммой в целом.\n* IDEF1X, IE и Фильтруемая IE Нотация. ER/Studio поддерживает три нотации моделей данных: IDEF1X, Information Engineering (IE, или \"лучеобразное\" представление), а также Фильтруемую IE Нотацию, которая скрывает все внешние ключи. Вы можете использовать настройки по умолчанию для всех трех видов диаграмм или изменить их \"на лету\", и выбрать такую нотацию, которая лучше всего подойдет для представления информации вашей аудитории. Embarcadero ER/Studio\n* Многомерное моделирование. В состав ER/Studio входят специальные средства многомерного моделирования, с помощью которых можно осуществить моделирование баз данных систем принятия решений, в том числе построить модели хранилищ данных, витрин данных, OLAP-систем. Эти средства позволяют легко конструировать, публиковать и реализовывать базы данных, в которых используются сложные схемы типа \"звезда\" или \"снежинка\", а также поддерживают двусторонний обмен многомерными метаданными с многочисленными решениями класса Business Intelligence.Поддержка полного жизненного цикла баз данных средствами моделирования данных\nИспользование ER/Studio повышает эффективность инвестиций, осуществляемых организацией в прикладные системы, основанные на базах данных. Решение поддерживает итеративные процедуры конструирования, характерные для жизненного цикла прикладных систем. ER/Studio позволяет выполнять, документировать и внедрять изменения схем, которые осуществляются в соответствии с изменяющимися требованиями бизнеса. Click on Image to Enlarge: Compare and Update. Compare and synchronize differences between Logical and Physical model views and databases.\"Обратное проектирование\" (\"Reverse Engineering\"). При необходимости начать работу с существующей базой данных, ER/Studio может воссоздать ее полную схему для большого количества поддерживаемых платформ. Операция обратного проектирования воссоздает определения объектов и строит графическую модель данных.\nClick on Image to EnlargeПроектирование баз данных. Для спроектированной базы данных ER/Studio может сгенерировать исходные коды для всей базы или ее части. Решение выполняет генерацию разных типов объектов в правильной последовательности, что позволяет быть уверенными в корректности баз данных при каждой новой генерации.Внесение изменений в базы данных. ER/Studio позволяет непосредственно переносить в базу данных изменения, осуществляемые в модели. ER/Studio позволяет сравнивать базу данных с моделью и автоматически строит разумную стратегию внесения изменений, которая осуществляет изменения с сохранением существующих данных, прав доступа к объектам и зависимостей.Развитые функции сравнения и слияния моделейСпециальная утилита - \"Compare and Merge Utility\" - предназначена для выполнения развитых функций, связанных с двунаправленными операциями сравнения и слияния моделей и структур баз данных. Пользователи могут применять разнообразные подходы для визуального поиска расхождений между моделями и базами данных, выдачи информации о результатах и разрешения обнаруженной разницы между ними. Данные операции могут осуществляться в любом направлении по выбору пользователя. Эти функции включают: * Сравнение и слияние информации в направлении от логической модели, выраженной в диаграммах ER/Studio и ориентированной на определенную специфику бизнеса, к любой возможной ее реализации на уровне физической модели.\n* Сравнение и слияние информации между диаграммами: Сравнение в направлении от любой диаграммы ER/Studio (логической или физической) к любой другой модели, представленной в виде диаграммы ER/Studio (логической или физической для той же самой СУБД). Embarcadero ER/Studio\n* Сравнение и слияние диаграммы, помещенной в репозиторий, с архивной версией. Возможно выполнение и слияние информации диаграмм, управляемых посредством репозитория ER/Studio. Кроме этого, пользователи могут сравнивать и откатывать назад поэлементно архивные модели, управляемые ER/Studio, называемые \"именованные релизы\" (\"Named Releases\").\n* Сравнение и слияние баз данных: сравнение и слияние информации физических моделей, управляемых ER/Studio, и баз данных, структуру которых они отображают. ER/Studio осуществляет изменение SQL-кода, специфического для разных типов СУБД, с целью изменений структуры. При этом решение поддерживает одновременное обновление моделей с тем, чтобы они отражали изменения, происходящие на сервере.\n* Сравнение и слияние SQL-файлов. Реализует сравнение физических моделей ER/Studio с архивными SQL-файлами. Это важно для тех организаций, которые имеют высокие требования к безопасности, ограничивающие возможности персонала по осуществлению операций сравнения и изменения структур на живых базах данных.Средства масштаба предприятия для представления отчетностиЦенность моделей данных состоит в том, что они позволяют ясно представить сложные конструкции структур данных, и те бизнес-правила и ограничения, которые должны быть соблюдены. Круг людей, способных правильно воспринимать такую информацию, достаточно широк: это аналитики в области информационных технологий, бизнес-аналитики, разработчики.Для того, чтобы быстро доводить конструкции, разработанные средствами ER/Studio, до потребителей этой информации, и получать соответствующую обратную связь, решение имеет развитые функции, позволяющие организовывать и публиковать метаданные, связанные с моделями данных, таким образом, чтобы обеспечивать легкий доступ к ним: через интранет, web-сайт и пр. ER/Studio предоставляет богатый выбор возможностей - это может быть генерация HTML-отчета для публикации на web-сайте, RTF-отчет, предназначенный для использования в твердой копии, или оба формата вместе. * Автоматическая публикация на web. ER/Studio может автоматически документировать всю диаграмму целиком, генерируя интегрированный набор сложных HTML-отчетов, к которым многие пользователи могут иметь одновременный доступ через интранет.\n* Отчеты презентационного качества в формате RTF (Microsoft® Word). ER/Studio позволяет строить полностью настраиваемые отчеты в формате RTF, которые могут быть немедленно использованы для профессиональных презентаций или публикации.\n* Представление в виде XML-схемы или DTD. ER/Studio позволяет представлять схемы данных в формате www.w3c.org XSD (схема) и DTD. Подсистема экспорта является на 100% кастомизируемой, что позволяет настраивать выход в соответствии со специфическими требованиями пользователей и удовлетворения требований бизнеса или прикладных систем.\n* ER/Studio viewer. Этот модуль обеспечивает пользователей, не входящих в команду разработчиков, интерактивным инструментом для изучения моделей данных, созданных в среде ER/Studio. Это приложение, предназначенное для использования широкой аудиторией, предоставляет те же самые сложные и совершенные средства для визуализации, навигации и печати, которые используются самими разработчиками моделей в среде полной системы ER/Studio.Импорт и экспорт метаданных с помощью MetaWizard - специализированного мастераMetaWizard, входящий в состав ER/Studio, позволяет разработчику взаимодействовать с широким набором приложений, поддерживающих UML и моделирование данных, платформы для аналитических систем и индустриальные форматы для обмена, такие, как CA ERwin®, PowerDesigner®, OracleDesigner®, Business Objects®, Cognos®, DB2® Cube Views, XML schemas/DTDs, OMG's CWM/UML XMI, и др. Разработчик может иметь пред глазами совокупный набор инструментов (\"workbench\"), помогающий управлять корпоративными метаданными, получаемыми практически из любого источника или целевой платформы. Логические и физические модели данных могут быть построены на основе данных любой из поддерживаемых платформ, перечисленных в MetaWisard. Критические метаданные, такие, как определения данных, информация об источниках данных и зависимости данных могут быть визуализированы в ER/Studio с использованием стандартной нотации моделирования данных. Полученная таким образом модель ER/Studio впоследствии может быть передана разнообразным бизнес-модулям в любом из существующих форматов, что обеспечивает возможность обмена бизнес-правилами и определениями данных в масштабах всего предприятия.Командная организация работ по моделированию с помощью репозитория ER/StudioРепозиторий ER/Studio является основой масштабируемой системы управления моделями, базирующейся на серверной архитектуре. Эта система реализует параллельный доступ членов команды разработчиков к моделям данных; имеет встроенные средства безопасности, защищающие модели и компоненты от несанкционированного доступа; обеспечивает разделение и повторное использование компонент в масштабах проекта, а также предоставляет широкие возможности управления версиями и релизами. Репозиторий ER/Studio полностью интегрирован со всеми рабочими процессами, реализованными в ER/Studio. Репозиторий ER/Studio позволяет добиться высокой эффективности и качества работы немедленно после инсталляции, что достигается применением стандартов. Как результат, ER/Studio существенно повышает производительность и обеспечивает безопасность совместной работы команды разработчиков.Репозиторий ER/Studio обеспечивает следующие расширенные возможности: * Поддержка командной работы по моделированию\n* Управление версиями моделей и объектов\n* Управление безопасностью моделей\n* Открытая архитектура, основанная на использовании СУБД ведущих производителейГибкая и открытая архитектура, обеспечиваемая автоматизированным интерфейсом ER/StudioНовый автоматизированный интерфейс ER/Studio обеспечивает существенное расширение функциональности. Посредством Sax BASIC- команд (язык, аналогичный VBA), включаемых в новые макроскрипты UI, пользователи могут вводить информацию непосредственно в модели объектов с целью расширения существующей функциональности или создания совершенно новых функций. * Автоматизация типовых задач. Позволяет использовать усовершенствованный интерфейс для автоматизации однородных рутинных задач моделирования или настройки ER/Studio для повышения эффективности процессов моделирования в организации. Например, это может быть разработка макроса, который будет автоматически окрашивать в определенный цвет наследуемые таблицы, содержащие распространяемые внешние ключи. Это может быть также написание макроса, который автоматически вставляет определенное имя и первичный ключ в новые сущности по мере их создания.\n* Взаимодействие с другими приложениями. Доступ к метаданным в моделях ER/Studio может осуществляться из таких приложений, как Microsoft Excel, Access, Outlook и т.д. Использование усовершенствованного интерфейса ER/Studio позволяет осуществлять взаимодействие с любым внешним приложением, которое имеет объявленный API или свой собственный автоматизированный интерфейс.Качественный дизайн \"на кончиках пальцев\"Для любого пользователя, будь то опытный разработчик или начинающий специалист, ER/Studio позволяет существенно ускорить процесс создания эффективных моделей данных. Решение включает в себя встроенные интеллектуальные средства, повышающие качество дизайна баз данных, в том числе: * Автоматическая миграция внешних ключей. ER/Studio автоматически поддерживает работу с внешними ключами, обеспечивая ссылочную целостность моделей. Достаточно начертить связь для того, чтобы ER/Studio автоматически распространил внешний ключ на наследуемую сущность. При удалении связи или родительской сущности ER/Studio мгновенно удалит все связанные внешние ключи. Решение также объединяет двойные внешние ключи для устранения избыточных ссылок.\n* Мастера контроля (Validation Wizards). ER/Studio содержит набор мастеров, обеспечивающих контроль за моделями на логическом и физическом уровнях. Мастер контроля логического уровня обеспечивает выполнение нормализации логических диаграмм. Мастер контроля физического уровня обеспечивает удовлетворение физических диаграмм требованиям синтаксиса и правилам именования целевых платформ СУБД.\n* Автоматическое документирование. ER/Studio обеспечивает документирование моделей данных. Он позволяет добавлять определения и заметки непосредственно из визуальных редакторских программ, а также автоматически конструировать глагольные формы для ясного обозначения связей.\n* Поддержка стандартов. ER/Studio позволяет определять полный набор повторно используемых объектов, таких как домены (элементы данных/атрибуты), пользовательские типы данных, умолчания и правила, которые можно разделить между моделями данных для поддержки корпоративных стандартов. Эти повторно используемые объекты также поддерживают глобальные обновления. Изменение одного из таких объектов автоматически распространяется на обновления всех связанных атрибутов.Использование моделей данных ER/Studio в других решениях EmbarcaderoДокументированные модели баз данных, выполненные с помощью ER/Studio, могут быть использованы в других решениях Embarcadero. Так, например, DT/Studio может напрямую использовать модели ER/Studio. Это позволяет консолидировать и повторно использовать информацию и документацию, связанную с базами данных, в максимальной степени. Кроме этого, DT/Studio может использовать физические модели ER/Studio при определении связей баз данных - источников и целей - для того, чтобы выполнять ETL- функции (ETL, Extraction, Transformation and Loading) в масштабах предприятия.ER/Studio 8.0 предлагает новый инструмент для визуализации происхождения данных, позволяющий выполнять анализ воздействия со стороны источников данных. Он дает возможность пользователям визуально анализировать и документировать, как данные циркулируют внутри организации. ER/Studio 8.0 также включает в себя новые, сберегающие время возможности для построения подмоделей на уровне атрибутов, и опции сравнения.Возможности / ПреимуществаВысокопроизводительная среда проектирования на основе моделей * Эффективное разделение логической и физической моделей с полной интеграцией, автоматическими преобразованиями и отображением пользовательских типов данных.\n* Публикация моделей и отчетов в различных форматах, включая HTML, RTF, Microsoft® Office® Output, с возможностью использования интерактивного инструментария ER/Studio Viewer\n* Генерация схем XML из логических и физических моделейПоддержка полного жизненного цикла баз данных * Прямое и обратное преобразования\n* Автоматическая генерация кода базы данныхУправление моделями на уровне предприятия * Интеграция моделей и метаданных\n* Широкая поддержка совместной работы, включая управление подмоделями, репозиторий, функцию \"где используется\"Возможности взаимодействия на уровне предприятия * Web-публикации, RTF, схемы XML и DTD выводПоддержка интеграции и хранилищ данных * Документирование и визуализация происхождения данных\n* Многомерное моделирование в логических и физических моделяхКачественное проектирование баз данных * Проверка правильности проекта, обеспечение ссылочной целостности\n* Планирование загрузки и моделирование аспектов, связанных с безопасностью данных\n\nПоддержка СУБД:\n\nскрытый текст\n* IBM® DB2® 5.x, 6.x, 7.x, 8.x & 9.x для LUW, 5.x, 6.x, 7.x, 8.x &9x для z/OS® & iSeries V4R5 и V5R2\n* IBM Informix® OnLine и SE\n* Informix 9.x динамический сервер\n* InterBase® 4, 2007\n* Microsoft® Access 2.0, 95, 97 & 2000\n* Microsoft SQL Server 6.5, 7, 2000, 2005, 2008\n* Microsoft Visual FoxPro® 2, 3, 5\n* MySQL® 3.x, 4.x , 5.x\n* NCR® Teradata® V2R4, V2R5, V2R6\n* Oracle® 7.3, 8.x, 9i, 10g & 11g\n* PostgreSQL 8.x\n* Sybase® Adaptive Server® Enterprise (ASE) 11.9.2, 12.x, 12.5 & 15.0\n* Sybase Adaptive Server Anywhere (ASA) 5, 6, 7, 8, 9 & 10\n* Sybase IQ 12.x\n* Sybase Watcom SQLПоддерживаемые СУБД для ER/Studio репозитория: * Oracle 8-9i, 10g\n* IBM DB2 UDB LUW 7.x, 8.x & 9.x\n* Sybase Adaptive Server Enterprise 12.x & 15.x\n* Microsoft SQL Server 7, 2000, 2005, 2008\n\n\nСкриншоты\n\n\n\n\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:B4D1B03C5BA2B005402F96AED45A897522FCA0AF&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=Embarcadero%20ERStudio%208.0.3%20%5B%D0%A1%D0%A3%D0%91%D0%94%5D","torrent_link":"dl.php?t=2031431","thanked_list":[{"id":"20655101","name":"oleg_work ","data":"(05-Мар-20)"},{"id":"14300016","name":"avo70 ","data":"(26-Июл-19)"},{"id":"2896857","name":"bajanist ","data":"(02-Июл-19)"},{"id":"19652647","name":"Mike Nickittin ","data":"(17-Мар-19)"},{"id":"177585","name":"yrsh ","data":"(13-Фев-18)"},{"id":"17149222","name":"thermo4 ","data":"(21-Дек-17)"},{"id":"30758221","name":"omka.15 ","data":"(18-Окт-17)"},{"id":"41768744","name":"redfish2016 ","data":"(10-Окт-17)"},{"id":"35755594","name":"mert519 ","data":"(08-Сен-17)"},{"id":"17239994","name":"newmentos ","data":"(02-Апр-17)"},{"id":"41941410","name":"jdv6jnfg45 ","data":"(22-Янв-17)"},{"id":"7082639","name":"svmoshkin ","data":"(06-Дек-16)"},{"id":"950655","name":"lesnik-1 ","data":"(02-Дек-16)"},{"id":"38026712","name":"ADPR2364 ","data":"(01-Сен-16)"},{"id":"13403103","name":"xjr00t ","data":"(19-Июл-16)"},{"id":"24260486","name":"Genzo_4 ","data":"(06-Май-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"16287666","name":"ECrazy ","data":"(19-Апр-16)"},{"id":"0","name":"Гость","data":"(23-Мар-16)"},{"id":"0","name":"Гость","data":"(14-Мар-16)"},{"id":"17856863","name":"koudelka ^.^ ","data":"(13-Мар-16)"},{"id":"13398135","name":"ikosta ","data":"(13-Мар-16)"},{"id":"5326963","name":"zZz2009 ","data":"(08-Дек-15)"},{"id":"0","name":"Гость","data":"(02-Ноя-15)"},{"id":"22516058","name":"AndreyRimma ","data":"(01-Ноя-15)"},{"id":"2879919","name":"yulits ","data":"(29-Авг-15)"},{"id":"11142350","name":"SergeyGSI ","data":"(28-Авг-15)"},{"id":"9448960","name":"cccv ","data":"(04-Июл-15)"},{"id":"29938138","name":"rfnbkf ","data":"(22-Июн-15)"},{"id":"15313854","name":"Dadjbog777 ","data":"(17-Июн-15)"},{"id":"17390295","name":"GS1963 ","data":"(04-Июн-15)"},{"id":"26511449","name":"Nosferatysh ","data":"(04-Июн-15)"},{"id":"29907789","name":"Shafff ","data":"(12-Май-15)"},{"id":"0","name":"Гость","data":"(06-Май-15)"},{"id":"5851565","name":"GAlex80 ","data":"(03-Май-15)"},{"id":"22928281","name":"Ranif A. ","data":"(23-Мар-15)"},{"id":"27466161","name":"hjuma ","data":"(14-Мар-15)"},{"id":"36963334","name":"Lezvie_Sna ","data":"(11-Мар-15)"},{"id":"0","name":"Гость","data":"(20-Фев-15)"},{"id":"18334083","name":"BOLT-27rus ","data":"(13-Фев-15)"},{"id":"15042512","name":"sel8 ","data":"(11-Фев-15)"},{"id":"14714515","name":"vdpo ","data":"(24-Янв-15)"},{"id":"19595043","name":"j_eagle ","data":"(22-Янв-15)"},{"id":"7336489","name":"tristak ","data":"(14-Янв-15)"},{"id":"20416601","name":"tripho ","data":"(11-Янв-15)"},{"id":"20401220","name":"Dok leo ","data":"(07-Янв-15)"},{"id":"20359696","name":"Bekkiinen ","data":"(21-Дек-14)"},{"id":"0","name":"Гость","data":"(25-Ноя-14)"},{"id":"14289570","name":"vit-ag16 ","data":"(18-Ноя-14)"},{"id":"12405773","name":"kelt_spb ","data":"(16-Ноя-14)"},{"id":"19662114","name":"ermakov2010 ","data":"(08-Ноя-14)"}]}