{"link":"2031325","name":"Embarcadero DBArtisan 8.6.2 [СУБД]","date":"20-Июл-09 23:49","author":"Impaler","description":"\nEmbarcadero DBArtisan 8.6.2Год выпуска: 2009\nВерсия: 8.6.2\nРазработчик: Embarcadero Technologies, Inc.\nПлатформа: Windows\nСовместимость с Vista: полная\nСистемные требования:\nWindows® 2000, Windows 2003 (все редакции), Windows 2003 R2 (все редакции), Windows XP (SP1 и SP2) и Windows Vista (Ultimate и Business) – только 32-битная архитектура\nПамять: 512 MB\nДисковое пространство: 512 MB\nRDBMS Client connectivity utilities\nДля Performance Analyst требуется Internet Explorer 5.5 или старше\nПривилегии пользователя: Power User или Administrative\nЯзык интерфейса: только английский\nТаблэтка: Присутствует Поддерживаемые СУБД:\n\nскрытый текст\nDBMS SUPPORTDBArtisan supports the following DBMS versions running on UNIX®, Linux®, and Windows NT® -based servers: * IBM DB2 for LUW 8.x and 9.x\n* IBM DB2 for OS/390 and z/OS® 8.x and 9.x\n* Microsoft SQL Server 2000, 2005, and 2008\n* MySQL 4.x\n* Oracle 8i, 9i, 10g, 11g\n* Sybase ASE 12.5 - 15.xEmbarcadero Performance, Space, and Capacity Analysts (included in DBArtisan Workbench) support: * IBM DB2 for LUW 8.x and 9.x\n* Microsoft SQL Server 2000, 2005, and 2008\n* Oracle 8i, 9i, 10g, and 11g\n* Sybase ASE 12.5 - 15.xEmbarcadero Backup Analyst supports: * Microsoft SQL Server 2000, 2005\n\nОписание:\n\nскрытый текст\nУправление схемами баз данныхDBArtisan® предоставляет не имеющие себе равных возможности управления объектами баз данных. Его графические редакторы объектов и мастера, учитывающие особенности платформ баз данных и их версий, позволяют создавать, удалять или изменять широкий спектр объектов, включая таблицы, ограничивающие условия, индексы, виды, представления, пользователей, процедуры, функции, триггеры, группы, роли, профили и пакеты.DBArtisan включает стандартизованные многорежимные графические редакторы для каждого типа объектов баз данных, что позволит Вам без усилий перейти от управления схемами SQL Server или Sybase к управлению схемами Oracle и наоборот. Продукт содержит знания по системным каталогам основных СУБД, синтаксису и правилам изменений. При создании документации на схемы баз данных Вы можете воспользоваться специальными средствами построения отчетов, основанными на интерфейсе мастеров, которые помогут Вам создать веб-сайты с фреймовой структурой, содержащие описания как одного объекта, так и всей базы данных.Управление безопасностьюDBArtisan поможет эффективно реализовать и поддерживать безопасность баз данных. Независимо от того, администрируете Вы уже существующую базу данных или создаете новую, Вы получите мощные средства, которые позволят:Управлять пользователями, ролями, учетными записями, профилями, группами и ссылками.\nПеремещать учетные записи внутри одной или между несколькими базами данных\nУправлять безопасностью на уровне паролей\nПрисваивать и изменять роли пользователям, а также другим ролям, как на объектном уровне, так и на системном.\nДавать привилегии многим пользователям всего за одну операцию\nОсуществлять удаленное администрирование Microsoft SQL Server и SybaseУправление пространствомУправление пространством является жизненно важным для обеспечения доступности и производительности Ваших баз данных. DBArtisan содержит много встроенных функций по управлению пространством, что позволяет Вам квалифицированно управлять и эффективно использовать запоминающие устройства, на которых размещены базы данных.Для более тонкого анализа пространства может быть использован дополнительный компонент (покупается и лицензируется отдельно) - DBArtisan Space Analyst, содержащий специальные средства диагностики, которые помогут Вам точно определить все проблемы, связанные с пространством, относящиеся к Вашей базе данных, а мастер интеллектуальной реорганизации поможет перестроить Вашу базу данных или ее отдельные части.Управление SQLDBArtisan предоставляет мощные графические инструменты для создания и анализа сложных SQL-запросов и размещенных на сервере программных объектов, таких как хранимые процедуры, триггеры, и др. Используя Embarcadero Query Builder, Вы можете конструировать даже самые сложные SQL-запросы просто с помощью мыши. Как только Вы выбираете объекты и методы, которые нужно использовать для SQL-запроса, DBArtisan автоматически генерирует код.Встроенная проверка синтаксиса дает уверенность в том, что все SQL-запросы будут построены и выполнены правильно с первого раза. Обладающая большим количеством настроек утилита DBArtisan ISQL позволяет Вам с легкостью создавать, сохранять и выполнять любой SQL код, относящийся к любой Вашей базе данных. Встроенные горячие клавиши и возможность завершения кода помогут Вам программировать SQL с очень высокой скоростью. Для анализа и отладки кода DBArtisan предоставляет анализатор производительности выполнения кода со встроенными пояснениями, а для выявления ошибок в хранимых на сервере программных объектах Вы можете использовать кросс-платформенные отладчики кода (покупаются и лицензируются отдельно).Для автоматического захвата и анализа выполнения SQL Вы можете использовать опциональный компонент SQL Profiler (покупается и лицензируется отдельно). Наконец, для настройки неэффективного SQL кода DBArtisan может быть интегрирован с Embarcadero® SQL Tuner, который позволит Вам автоматически переписать малопроизводительный код в полностью оптимизированный SQL.Управление заданиямиТакие задачи, как масштабная реорганизация или выполнение скриптов, осуществляющих критические изменения в базе данных, часто должны выполняться в нерабочие часы. DBArtisan предлагает два разных способа управления заданиями:DBArtisan легко интегрируется с Microsoft® Windows® Task Scheduler, который позволяет Вам запланировать запуск практически любого задания тогда, когда Вам угодно и с любой частотой.Управление даннымиDBArtisan предоставляет всеобъем-лющие средства, которые помогут Вам управлять данными во всех Ваших базах данных. Визуальный редактор данных поможет Вам добавлять, изменять и удалять данные из Ваших таблиц с контролем за ссылочной целостностью. Вы можете создавать операторы вставки для таблиц, использующие текущие данные, а также для определенных баз данных извлекать данные как XML документы.DBArtisan также предлагает утилиты, основанные на интерфейсе мастеров, для миграции объектов, являющихся схемами, и ассоциированных с ними таблиц, с одного сервера баз данных на другой. Вы можете копировать отдельный объект базы данных, все объекты, принадлежащие пользователю определенной схемы, или всю базу данных целиком. В качестве альтернативы Вы можете определить специально созданное задание миграции, которое выполнит миграцию любой группы объектов базы данных. DBArtisan также может производить комбинации кросс-платформенной миграции между различными СУБД для общих объектов баз данных, таких как таблицы, данные, пользователи, индексы и представления.Управление производительностьюЯвляясь занятым администратором баз данных, Вы не можете неэффективно тратить время на попытки обнаружить критичные для производительности узкие места в Вашей базе данных. Но в таком случае Вам нужны инструменты, которые исключат любую работу, основанную на догадках, из управления производительностью. DBArtisan предоставляет несколько таких инструментов, реализованных в виде различных опций, которые помогут Вам в управлении производительностью Ваших ключевых баз данных.DBArtisan поставляется вместе со встроенным диспетчером процессов, который поможет понять, кто подключен к Вашей базе данных в процессе текущей активности, осуществляемой в каждой сессии. Кроме этого, осуществляется фиксация деталей и всевозможных данных, касающихся сессий.\nТе, кто хочет получать расширенную информацию о производительности, могут использовать опционный компонент DBArtisan Performance Analyst (покупается и лицензируется отдельно). Это мощный, устанавливающийся на стороне клиента монитор баз данных, вся функциональность которого содержится в консоли DBArtisan. Embarcadero® Performance Analyst предоставляет интеллектуальную диагностическую информацию с возможностью последующей детализации полученных данных (\"drill down\"), чтобы помочь Вам проникнуть в суть любого случая потери производительности. Embarcadero Performance Analyst полностью интегрируется с DBArtisan, так что Вы можете исправлять любые проблемы с производительностью всего несколькими щелчками мыши.\nЕсли Вам требуется автоматизированное обслуживание Ваших баз данных в режиме 24x7, то Вам следует обратить внимание на Embarcadero® Performance Center. Это отдельное решение масштаба предприятия, которое может круглосуточно оповещать Вас о любых проблемах с производительностью, требующих Вашего внимания. Performance Center полностью интегрирован с DBArtisan, что поможет Вам легко устранять обнаруженные узкие места.Управление резервамиПланирование будущего Ваших критических баз данных обычно является трудной задачей. Однако специальный инструмент - Capacity Analyst, который является опционным компонентом DBArtisan (покупается и лицензируется отдельно), облегчает понимание текущего состояния Вашей базы данных и того, что ее ожидает в будущем. Embarcadero® Capacity Analyst позволяет Вам отслеживать изменения во времени любых метаданных и параметров производительности основных баз данных и, как результат, осуществлять анализ тенденций в ключевых областях, таких как рост базы данных, фрагментация объектов, операции ввода-вывода и загрузка сессий. В Embarcadero Capacity Analyst встроен интеллектуальный механизм прогнозирования, позволяющий вам предсказывать, когда Ваша база данных исчерпает свободное пространство или когда появится необходимость в реорганизации объектов.Отсутствие вмешательстваВ отличие от других инструментов администрирования баз данных, DBArtisan не инсталлирует никаких объектов в рабочий сервер базы данных, так что не возникает проблемы отслеживания занимаемого такими объектами пространства или других побочных эффектов. Опционный компонент Performance Analyst системы DBArtisan инсталлирует только два пакета в каждую базу данных, за которой он следит. Опционный компонент Capacity Analyst требует инсталляции нескольких таблиц, представляющих собой репозиторий, для сбора, сохранения и анализа исторической информации базы данных.\n\n\nСкриншоты\n\n\n\n\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:927D22A66431B2EE7F5715ADA28B834865514B17&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=Embarcadero%20DBArtisan%208.6.2%20%5B%D0%A1%D0%A3%D0%91%D0%94%5D","torrent_link":"dl.php?t=2031325","thanked_list":[{"id":"45883696","name":"BT_Rover ","data":"(29-Сен-21)"},{"id":"18062101","name":"valery.s.1975 ","data":"(16-Сен-21)"},{"id":"1409560","name":"Neсkit ","data":"(01-Июн-21)"},{"id":"20655101","name":"oleg_work ","data":"(05-Мар-20)"},{"id":"2135061","name":"amz ","data":"(10-Мар-19)"},{"id":"28497480","name":"s19k65 ","data":"(07-Июн-18)"},{"id":"7456517","name":"saruman1999 ","data":"(17-Янв-18)"},{"id":"14313854","name":"MVI1962 ","data":"(06-Ноя-17)"},{"id":"27529607","name":"Мирамани ","data":"(24-Июн-17)"},{"id":"31215286","name":"Okirsanov ","data":"(23-Июн-17)"},{"id":"285241","name":"v2a44 ","data":"(12-Янв-17)"},{"id":"16675632","name":"akrnew ","data":"(31-Окт-16)"},{"id":"17978281","name":"Stasik10 ","data":"(29-Окт-16)"},{"id":"12570930","name":"master-sheff14 ","data":"(22-Окт-16)"},{"id":"19317230","name":"alexs0932 ","data":"(05-Июл-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"6102685","name":"genry15 ","data":"(28-Фев-16)"},{"id":"9971836","name":"prohibided ","data":"(12-Фев-16)"},{"id":"10726803","name":"igavdeev ","data":"(09-Янв-16)"},{"id":"22516058","name":"AndreyRimma ","data":"(07-Янв-16)"},{"id":"6083808","name":"hcl14 ","data":"(11-Июн-15)"},{"id":"18766499","name":"nekto763 ","data":"(23-Мар-15)"},{"id":"688438","name":"ardillaroja ","data":"(18-Фев-15)"},{"id":"17947295","name":"kobzdik ","data":"(14-Фев-15)"},{"id":"19943073","name":"mikevazo ","data":"(26-Дек-14)"},{"id":"15798011","name":"forus33 ","data":"(24-Дек-14)"},{"id":"32284302","name":"yiyux ","data":"(13-Дек-14)"},{"id":"14908227","name":"eg_i ","data":"(09-Ноя-14)"},{"id":"28320034","name":"Марин M ","data":"(15-Окт-14)"},{"id":"17912897","name":"niteo ","data":"(05-Окт-14)"},{"id":"15326748","name":"corteufa ","data":"(05-Сен-14)"},{"id":"22149941","name":"klisovsky ","data":"(31-Авг-14)"},{"id":"26760062","name":"ynesmeyanov ","data":"(16-Июл-14)"},{"id":"28296257","name":"rayman28 ","data":"(23-Июн-14)"},{"id":"15698470","name":"gorelli ","data":"(20-Июн-14)"},{"id":"28634203","name":"gamjor ","data":"(09-Июн-14)"},{"id":"17165035","name":"Alexandr2011 ","data":"(04-Апр-14)"},{"id":"18417938","name":"climbg ","data":"(20-Мар-14)"},{"id":"20812876","name":"Jomart2 ","data":"(15-Мар-14)"},{"id":"3958580","name":"lebedand ","data":"(13-Мар-14)"},{"id":"19209427","name":"NickWolf ","data":"(26-Фев-14)"},{"id":"20086867","name":"demonik19061984 ","data":"(29-Янв-14)"},{"id":"19332281","name":"lexkres ","data":"(21-Дек-13)"},{"id":"31292151","name":"nabat911 ","data":"(15-Ноя-13)"},{"id":"32666539","name":"Digo1979 ","data":"(18-Окт-13)"},{"id":"25431683","name":"gpkuklin ","data":"(20-Сен-13)"},{"id":"16254082","name":"44shop ","data":"(13-Сен-13)"},{"id":"2296796","name":"mailbox001 ","data":"(09-Сен-13)"},{"id":"17559101","name":"Boost30 ","data":"(12-Май-13)"},{"id":"27743440","name":"moonwalker698 ","data":"(11-Май-13)"},{"id":"26143269","name":"Fish_2012 ","data":"(02-Май-13)"},{"id":"0","name":"Гость","data":"(11-Июн-12)"}]}