{"link":"248664","name":"SQL Server 2005 Workgroup Edition. (английский) [СУБД]","date":"22-Май-07 08:47","author":"PRiMspb","description":"\nSQL Server 2005 Workgroup Edition. (английский)«Вниманию студентов и аспирантов! Вы можете бесплатно скачать ЛИЦЕНЗИОННУЮ версию данного продукта на сайте проекта DreamSpark от компании Microsoft - www.dreamspark.ru»Год выпуска: 2005\nВерсия: 2005 Workgroup Edition\nРазработчик: Microsoft\nСовместимость с Vista: неизвестно\nЯзык интерфейса: только английский\nТаблэтка: Не требуется\nОписание: Пакет SQL Server 2005 Workgroup представляет собой полноценный реляционный механизм работы с базами данных, но при этом он имеет ограниченную, по сравнению с системами уровня предприятия, масштабируемость, а также лишен тех широких возможностей в области BI, которые реализованы в более дорогостоящих версиях Standard и Enterprise. Продукт SQL Server 2005 Workgroup позиционируется как средство для работы с базами данных начального уровня, но если в дальнейшем потребуются более продвинутые возможности и мощность, он может быть легко обновлен до версии Standard или Enterprise. Те пользователи, которые приобретают SQL Server с правом перехода на последующие версии (лицензионное соглашение Software Assurance, SA), имеют возможность получить новую версию продукта, уплатив только разницу в стоимости. SQL Server 2005 Workgroup, так же как версии Standard и Enterprise, лицензируется по количеству заполненных слотов процессоров, но не по количеству ядер на процессоре. Из этого следует, что современные многоядерные процессоры, содержащие два процессора в одном корпусе, лицензируются как один процессор. Процессоры, поддерживающие многопоточность (hyperthreading), при лицензировании также рассматриваются как один процессор. Точно так же обстоят дела и в SQL Server 2000.Если приложение интенсивно использует процессор или оперативную память, если предполагается наличие большого количества одновременных обращений к базе или если объем сохраняемых данных может превышать 4 Гбайт, тогда вместо SQL Server 2005 Express нужно использовать SQL Server 2005 Workgroup. В данном продукте имеются те возможности управления, которых лишен пакет SQL Server 2005 Express, а именно SQL Server Agent и Database Tuning Advisor (DTA). Доступ к этим функциям можно осуществлять через программное средство SQL Server Management Studio, которое входит в комплект поставки всех версий SQL Server 2005, за исключением SQL Server Express. Наличие компонента SQL Server Agent позволяет организовывать выполнение по расписанию процедур обслуживания баз данных и резервного копирования, используя для этого в качестве инструмента удобный интерфейс SQL Server Management Studio.Благодаря SQL Server 2005 Workgroup организация системы с высокой степенью отказоустойчивости данных может обойтись сравнительно недорого. Имеющаяся в данном продукте функция переноса журналов транзакций позволяет делать копию рабочей базы данных в пассивную резервную базу без необходимости приобретения еще одной лицензии на базу данных. В случае отказа основного сервера резервный сервер анализирует журнал транзакций и выясняет, в какой именно момент произошел сбой на основном севере. В SQL Server 2005 Workgroup отсутствует поддержка зеркалирования баз и построения отказоустойчивых кластеров, которая имеется в более дорогостоящих версиях продукта. Зато здесь есть поддержка репликации, причем как в качестве подписчика, так и в качестве издателя. Однако новая функция репликации из Oracle в SQL Server 2005 включена только в состав пакета SQL Server 2005 Enterprise.SQL Server Integration Services (SSIS) пришли на смену службе DTS, существенно расширив ее возможности. В SQL Server 2005 Workgroup отсутствует инструментарий для построения пакетов SSIS, но здесь имеется исполнительная среда SSIS, поэтому пакеты SSIS, созданные на системах с SQL Server 2005 Standard или Enterprise, могут затем запускаться в среде SQL Server 2005 Workgroup.  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:1BD2C4FD7AA4A2DBDBA4060134163593B765DD51&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=SQL%20Server%202005%20Workgroup%20Edition.%20(%D0%B0%D0%BD%D0%B3%D0%BB%D0%B8%D0%B9%D1%81%D0%BA%D0%B8%D0%B9)%20%5B%D0%A1%D0%A3%D0%91%D0%94%5D","torrent_link":"dl.php?t=248664","thanked_list":[{"id":"14137611","name":"crashbandicot ","data":"(27-Ноя-22)"},{"id":"16335486","name":"demon_sl ","data":"(06-Окт-18)"},{"id":"39506767","name":"pooh06 ","data":"(06-Дек-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"15903453","name":"Gereford ","data":"(08-Окт-15)"},{"id":"15689514","name":"Elase ","data":"(25-Июл-15)"},{"id":"6112222","name":"Olorinum ","data":"(17-Дек-14)"},{"id":"25176309","name":"iamvan ","data":"(13-Дек-14)"},{"id":"14125461","name":"sevandzin ","data":"(03-Окт-14)"},{"id":"27052041","name":"merdan01123 ","data":"(23-Фев-14)"},{"id":"0","name":"Гость","data":"(02-Июн-13)"},{"id":"5868579","name":"Vadim-007 ","data":"(24-Май-13)"},{"id":"22077468","name":"AliMR ","data":"(19-Мар-13)"},{"id":"22538393","name":"SniF3 ","data":"(14-Дек-12)"},{"id":"19143908","name":"MagistrSar ","data":"(16-Ноя-12)"},{"id":"22050444","name":"gvozdoder78 ","data":"(23-Окт-12)"},{"id":"158990","name":"tosha30 ","data":"(07-Сен-12)"},{"id":"18315040","name":"zeenard ","data":"(30-Июл-12)"},{"id":"4371648","name":"c-nn ","data":"(31-Мар-12)"},{"id":"7818348","name":"Mish.Len ","data":"(21-Сен-11)"},{"id":"16741306","name":"kram75 ","data":"(14-Сен-11)"},{"id":"13303176","name":"kbooby ","data":"(26-Июл-11)"},{"id":"16834347","name":"ifbeastifbeast ","data":"(27-Мар-11)"},{"id":"8190152","name":"Com_Rat ","data":"(12-Фев-11)"},{"id":"17248079","name":"jevgenijb ","data":"(15-Янв-11)"},{"id":"0","name":"Гость","data":"(20-Ноя-10)"},{"id":"14628474","name":"k28 ","data":"(22-Сен-10)"},{"id":"9523450","name":"PicoWave ","data":"(03-Сен-10)"},{"id":"12827288","name":"GenTab ","data":"(13-Июл-10)"},{"id":"0","name":"Гость","data":"(29-Мар-10)"},{"id":"9248672","name":"name_off ","data":"(20-Янв-10)"},{"id":"708405","name":"pho3nix ","data":"(19-Янв-10)"},{"id":"12108022","name":"varius78 ","data":"(01-Дек-09)"},{"id":"7789736","name":"J-K-B ","data":"(29-Ноя-09)"},{"id":"7170939","name":"SEЯG ","data":"(16-Ноя-09)"},{"id":"11470218","name":"NowhereLand ","data":"(13-Ноя-09)"},{"id":"0","name":"Гость","data":"(29-Окт-09)"},{"id":"12626814","name":"Glukaman ","data":"(18-Окт-09)"},{"id":"5629392","name":"soopr.shtorm ","data":"(08-Окт-09)"},{"id":"10363544","name":"3olotce ","data":"(07-Окт-09)"},{"id":"8805389","name":"melnik-aleksei ","data":"(28-Авг-09)"},{"id":"5957838","name":"IrHead747 ","data":"(17-Авг-09)"},{"id":"2963462","name":"bumka777 ","data":"(07-Авг-09)"},{"id":"7443101","name":"aa_alex ","data":"(27-Июл-09)"},{"id":"0","name":"Гость","data":"(13-Май-09)"},{"id":"8040913","name":"kvasyaT ","data":"(05-Апр-09)"},{"id":"886770","name":"]ZZZ[ ","data":"(12-Мар-09)"},{"id":"1711545","name":"Ozeki ","data":"(12-Фев-09)"}]}