{"link":"2542270","name":"PL/SQL Developer 9.0.6.1665","date":"19-Дек-09 15:02","author":"Exmr","description":"\nPL/SQL Developer 9.0.6.1665 + официальный русский перевод (ставиться отдельно, в раздаче присутствует)Год выпуска: 2012\nВерсия: 9.0.6.1665\nРазработчик: Allround Automations\nПлатформа: Win\nСовместимость с Vista/Win7: да\nЯзык интерфейса: английский, русский\nТаблэтка: Присутствует\nОписание: PL/SQL Developer – это Integrated Development Environment, направленное на разработку программных единиц для Баз данных Oracle. Мы видим, как все больше и больше бизнес логики и логики приложений строятся на Oracle серверах, поэтому PL/SQL программирование стало важной частью процесса разработки. PL/SQL Developer фокусируется на простоте использования, качестве кодирования и продуктивности, необходимых преимуществах при разработке приложений Oracle.\nСистемные требования: PL/SQL Developer запускается на Windows 95, 98, ME, NT4, 2000, XP, Vista, Seven. Поддерживает Oracle Server версии 7 - 11 на любой платформе. Для подключения к базе данных Oracle, PL/SQL Developer необходима 32-bit SQL*Net или Net 8 или Net 9 версия.15.06.2012 обновил russian language pack до последнего.\n\nRussian Language Pack\nРусский пак переводит саму программу и руководство пользователя (файл manual.rtf в папке с PL/SQL developer)Чтобы установить русский язык, надо запустить russian.exe. Меняется обратно на английский тут: Инструменты - Предпочтения - Внешний вид.\n\n\nИстория измений с 9.0.0.1601\n9.0.6.1665:\n\nFixed a resource leak introduced in 9.0.6.1661\nConnection List logon dialog could be slow\n\n9.0.6.1660:\n\nNew command-line parameter: InstantClient=<path>\nConnection List now has the same look and feel as other lists\nCommand Window spooling from a script file now saves the spool file in the script directory by default\nCommand Window spool command did not always work correctly for specific spool file names\nSQL Window Grid did not check string size when entered in the Large Data Editor\nDouble-clicking on a file in the Windows Explorer could lead to \"List Index out of Bounds\"\nThe \"Add source to editor\" function from the Object Browser could cause an Access Violation\nSQL Window did not allow data editing for table names starting with 'SELECT'\nPerformance improvement when \"Use DBA Views if available\" preference is disabled\nPerformance improvement when Code Assistant \"Describe Context\" is disabled\nTest Window \"Start Debugger\" button now remains enabled in case of privilege issues\nA variable name that starts with a semi-colon in the debugger watch list would cause an ORA-03113 exception\nExport User Objects tool now adds a \"set define off\" command to the script\nExport User Objects tool now adds the \"force\" option when creating views\nTest Window tab pages disabled while running (could cause a hang-up)\nCode Assistant now supports record type constants\nEditor AutoReplace function did not work within comment blocks\n\n9.0.5.1648:\n\nCode Assistant performance improvement for table/view column lists\nRegistry tab page if the Support Info screen did not display DWORD values correctly\nA duplicated user did not show role privileges in SQL statements when no new user name was provided\nObject Browser double-click action and drag & drop action could not be defined for database link type\nSubprogram declaration popup could be truncated if it included comments\nDates < 1901 were not copied correctly to Excel 2007 and 2010\nSelecting a previously logged off connection would not always log that connection on again\nSQL Window and Test Window did not display SYS.XMLTYPE attributes of an object field\nTyping a target schema name in the Compare Table Data tool could cause an \"Invalid Typecast\" error\nCompare User Objects and Compare User Data did not show the source owner in the generated script comments\nCompile Invalid Objects tool could raise \"Null password given\" error in single connection mode\nAuto Refresh for SQL Window in single record view could steal the focus from the top window\nCommand Window would not allow cursor left beyond the prompt size\n\n9.0.4.1644:\n\nModifications for German, French, Spanish and Chinese language packs\nCompile Invalid Objects would show no invalid objects when session was killed\nReport Window could not break on field names with international characters\nPasting a record in the SQL Window result grid could lead to a \"Column index -1 out of range\" error\nCompare User Objects did not prefix table with target schema when dropping constraints\nTable DDL could be incorrect for object columns when not connected as owner\nDate fields were not always exported correctly to xlsx when am/pm date format was used\nEditor and Grid did not allow Alt-0128 to insert Euro sign\nInitial connection dialog did not always show last username and database\nDefine Connections menu added in Tools menu\nStandard Query popup menu did not work for project items\n\n9.0.3.1641:\n\nNLS_LANG and TNS_ADMIN command-line parameters added\nPDF export from Report did not give correct result for screen DPI other than 100%\nDirectory preferences now support environment variables\nWhen using a language pack the default templates were not always found\nExport to Excel as xlsx would not handle AM/PM correctly\nImproved Excel xlsx export for UTF8 characters\nCursor position in status bar would not always show correct character position with selections\nPasting data in a grid with a selected column could start on an incorrect row number\nDiagram Window, Items > \"Order as created\" did not work correctly for added fields\nCharacter Set Mismatch warning will now only be displayed once for a connection\nCommand Window did not interpret alternative quote delimiters\nCode Assistant on lower split editor in Program Window did not always display at the optimal location\nText Importer and ODBC Importer now convert invalid field names to valid table column names\nImport Table in PL/SQL Developer format could lead to \"ORA-01722: invalid number\"\nEditor: AutoReplace function key now also works if AutoReplace preference is disabled\nEditing when disconnected could implicitly connect\nDBMS_Output longer than 4000 characters per line would lead to ORA-06502\nTest Window function \"Start Debugger\" could remain disabled in Single Connection mode\nOpening a Constraint folder could show a message with the query text\nSQL Window performance improved for inline view queries\nAdded warning for \"expand all\" browser items\nSession > Log On could lead to \"Null password\" error when session is subsequently used\nA renamed Program Window would get its original name restored after saving\n\n9.0.2.1621:\n\nSQL Window Linked Queries did not work for constraint names with Unicode characters\nSession > Log off did not always succeed for the main connection\nSession > Log off could be incorrectly disabled for the main connection\nCommand Window \"HOST\" command did not work on Windows 7 x64\nSetting the main connection in single connection mode is now disabled if one or more windows are running\nLogon did not always work in Single Connection mode\nLogging off with an open Command Window could lead to \"ORA-01005\" error\nFixed \"ORA-1005 null password\" error\nPerformance improvement fetching Code Assistant names\nPrevent \"List index out of bounds\" when clicking on Window List\nCode Assistant now sorts user objects by name instead of type, name\nCode Assistant did not always work for user object lists and object method parameter lists\nApplying a filter to an Object Selection List with no matches would lead to an unusable list\nSmart Indent did not always work correctly when Smart Fill option is enabled\nCompare User Objects with NLS_LENGTH_SEMANTICS=CHAR could cause incorrect differences\nChanging the Table Definition Editor connection in \"Single Session\" and \"Dual Session\" mode did not work properly\nObject Selection List filter would accept space as delimiter\nAdding a Test Script to the Test Manager would incorrectly copy the variable value/type\nAdding a User Defined Tool before a main menu item would add multiple menu items\nSearching in Projects could lead to a \"file not found\" error\nLog Off in Single Connection Mode with DBMS_JOB editor open could ask for password\nQuerying BFILE columns could cause ORA-22290\nWhen restoring windows in single connection mode, different connections could be used\nToolbar button configuration displayed two incorrect buttons\nAutomatic Statistics did not always work after changing a connection\nUser Defined Object Browser Folders with object list could show incomplete contents\nFix conversion error message for Excel export when date format is incorrect\nObject Browser Constraints root folder did not apply user selector filter\nObject Browser Constraints root folder would show constraints from recycle bin\nReports would not always show sums on breaks\nAfterConnect.sql script was not always executed when changing a window connection\nSQL Window record number column was not scroll locked\nUsing Ctrl-C in the Object Browser would not always copy the full object name\n\n9.0.1.1613:\n\nFixed incorrect post button status after posting & committing a CLOB value in Single Record view\nFixed \"Session Undefined\" error\nQueue table DDL could specify 'ENQUEUE_TIME' instead of 'ENQ_TIME' in the sort list\nStandard Command Window variables _O_VERSION, _O_RELEASE, _USER and _CONNECT_IDENTIFIER were not always defined\nExecute button would not be enabled after logging on in Single Connection Mode\nPopup menu item \"Change Window To\" would always use main connection for the resulting window\nSQL Window refresh record could fail for tables with an XMLTYPE column\nFixed \"ORA-01460: unimplemented or unreasonable conversion requested\" on 9.2 and earlier UTF8 databases.\nExplain Plan for update and delete statements with table alias did not convert PL/SQL variables correctly\nCommand Window prompt would not be updated when selecting a connection from the list\nDebugger did not display collection items indexed with a variable\nTyping in the Debugger watch list could sometimes swap the first and second character\nFind function did not work from Support Info dialog\nSQL Window would not show information about posted changes when \"Show Dictionary Info in result grid\" was enabled\nSQL Window would not always interpret alternative quote delimiters correctly\nCompare User Objects could not apply changes for Views with comments\nExcel xlsx export now uses the current date/time format\nFixed Project Groups visibility issue\nSystem privilege \"administer resource manager\" was not granted/revoked correctly\nDuplicate names were not displayed correctly by the Code Assistant\nChange Window to another type could fail when focus changed to another window\nLog on did not always clear the Connection button in windows\nReconnecting all windows to another connection now implicitly logs on\nSome synonyms for V$ views were not translated correctly (e.g. v$object_usage)\nChanging a connection of a window would commit the current transaction, regardless of preference\nExport to Excel XLS could give incorrect column formats for second page\nNew SQL Window preference: \"Refresh posted records\"\nQuerying a table with a column of an inaccessible type could lead to an Access Violation\nInvoking the Large Data Editor could lead to \"The configuration registry could not be read\" error\nSQL Window query performance improved\nSQL Window AutoSelect SQL performance improved\nCode Assistant could display duplicate items from CANames.sql\nPerformance improvement when loading files from a network drive\nCompare User Objects could not create queue tables by pressing the Apply button\nSQL Window status line would show only the first line of a column comment\nMain connection indicator colors could be set when logged off\nEditor Copy now always uses white background color\nSelecting \"Other\" from the connection list in a window status bar now directly shows the Logon dialog\nSQL Window performance improvement when executing large scripts\nExplain Plan Window would wait for other queries to finish in Dual Session Mode\nAppData directory is now properly determined (preferences and files are copied from old location)\nText color improvement for the connection indicator\nKey Configuration could sometimes be cleared\nExplain Plan function would incorrectly remove into clause for field lists with subselects\n\n9.0.0.1601:\nНовые возможности:\n\nОдновременные подключения к разным БД\nНовый лист соединений\nПоддержка формата XLSX(Excel 2007/2010) (можно забыть про ограничение в 65535 строчек)\nУлучшение окна диаграмм (сортировка, зум, ...)\nУлучшение command window (zip, show connection, ...)\nПри создании/редактировании таблицы можно создать виртуальную колонку\nУлучшение SQL window (фиксация колонок (аля excel), при редактировании таблицы моментально видно действие триггеров, можно создавать подвкладки)\nУлучшение test manager\nУлучшение редактора (Корректная подсветка синтакса с альтернативными кавычками, теперь подсказывает линки, ...)\nУлучшение обозревателя объектов\nУлучшение обозревателя файлов\nУлучшение data generator\nУлучшение сравнения объектов (теперь можно игнорировать регистр, пробелы, комментарии)\nУлучшение PL/SQL Beautifier\n\nБолее подробно тут.\n\n\nОсобенности:\nМногофункциональный PL/SQL Редактор Имея в наличии Подсветку синтаксиса, SQL и PL/SQL справку, Описания объектов, Code Assistant, Подсказки компилятора, PL/SQL Beautifier, Содержание Кода, Кнопки Поиска, Навигация по гиперссылкам, Макро библиотека и много других функций, редактор удовлетворит даже самого требовательного пользователя. Необходимая информация автоматически предоставляется вам, или вы можете получить ее по первому нажатию мыши.Встроенный отладчик (требует Oracle 7.3.4 или выше) Во встроенном отладчике есть все функции, о которых вы могли только мечтать: Вход , Проход , Выход , Исполнение до исключения , Точки прерывания, Просмотр и установка переменных., просмотр стэковых зон и так далее. Вы можете отладить любой программный элемент, не модифицируя его, включая триггеры и объекты Oracle8.Построитель ЗапросовГрафический Построитель Запросов упрощает создание новых установок выбора или изменения существующих. Просто drag and drop таблицы и представления, выбирайте колонки для списка полей, где есть условия и запросы по ним, объединяйте таблицы на основании уточняющих сторонних определений и все готово.PL/SQL BeautifierPL/SQL Beautifier позволяет вам форматировать SQL и PL/SQL код при помощи определяемого пользователем набора правил. Ваш код может быть автоматически улучшен, когда вы компилируете, сохраняете или открываете файл. Эта функция улучшит вашу производительность и улучшит читаемость вашего PL/SQL кода, если вы работаете в большой команде.SQL ОкноSQL Окно позволяет вам открывать любое положение SQL и просматривать и редактировать результаты в таблицах, которые поддерживают модуль Запрос по шаблону для поиска специфических записей в полученном результате. Вы можете легко загрузить ранее запущенные положения SQL из буфера. SQL редактор имеет такое же большое количество функций, как и PL/SQL Редактор.Командное окноДля разработки и запуска SQL скриптов вы можете использовать Командное Окно PL/SQL Developer. У этого окна такой же интерфейс, как у SQL*Plus, но в нем дополнительно встроен редактор скриптов с соответствующей подсветкой синтаксиса. Теперь вы можете создавать скрипты, пропуская цикл \"edit script / save it / switch to SQL*Plus / run script\", и не покидая удобный PL/SQL Developer IDE. ОтчетыДля получения отчетов о работе приложений или словаря Oracle, вы можете использовать встроенную в PL/SQL Developer функцию отчетов. Здесь вы найдете несколько стандартных отчетов и сможете создавать свои. Эти созданные вами отчеты вы сможете сохранять в файл отчетов, а затем включать его в меню отчетов. Поэтому так легко запускать часто необходимые именно вам отчеты. Вы можете использовать Query Reporter, свободно-распространяемый инструмент для запуска ваших отчетов без PL/SQL Developer, при помощи командной строки.ПроектыДля организации вашей работы вы можете использовать встроенные в PL/SQL Developer проекты.. Проект состоит из набора исходных файлов, объектов баз данных, примечаний и опций. Это позволяет вам работать внутри ограниченного набора элементов, вместо полной базы данных или схемы. Так легче находить необходимые вам элементы проекта, или перемещать проект из одного места или базы данных в другое.Браузер объектовЗдесь вы найдете всю необходимую информацию по разработке PL/SQL. Используйте его для получения описаний объектов, просмотра определений объектов, создания тестовых скриптов для отладчика, включения и выключения триггеров и ограничений, перекомпиляции неверных объектов, запросов и изменений таблиц и представлений, поиска текста в исходных объектах, удаления и вставки названий объектов в редакторе и так далее. Браузер объектов также отображает зависимости между объектами и позволяет вам распространять эти объекты (например, просмотр пакетных ссылок, просмотр таблицы ссылок и т.д.)Оптимизация работыДля оптимизации работы вашего SQL и PL/SQL кода, вы можете использовать PL/SQL Profiler для просмотра времени запуска каждой исполняемой строки PL/SQL кода (Oracle8i и позже). Более того, вы можете получать статистику о запускаемых положениях SQL и PL/SQL программах. Эту статистику можно включать в CPU загрузку, блокировку I/O, запись I/O, сканирование таблиц, сортировку и так далее.HTML Руководство пользователяOracle на данный момент предоставляет руководства пользователя on-line в HTML формате. Вы можете интегрировать их в окружение PL/SQL, чтобы обеспечить контекстно-зависимую справку во время редактирования, ошибок компиляции и ошибок в рабочем цикле.Не-PL/SQL ОбъектыВы можете просматривать, создавать и редактировать таблицы, последовательности, синонимы, библиотеки, каталоги, пользователей и роли, без использования SQL. Просто введите нужную информацию в легкую в использовании форму, и PL/SQL Developer Сам выберет необходимый SQL для создания или изменения объекта.Список шаблоновСписок шаблонов PL/SQL Developerможет сэкономить вам время и помочь со стандартизацией. Когда вам необходимо вставить в редактор стандартный SQL или PL/SQL код, или создать новый программный файл, просто нажмите на соответствующий шаблон.Сравнение пользовательских объектовПосле внесения изменений в определения таблиц, представления, программные элементы и т.д., вам может пригодиться перенесение этих изменений другому пользователю базы данных, или найти различия. Это может быть другая среда разработки, тестовая среда, или производственная среда. Функция сравнения пользовательских объектов поможет вам сравнить несколько объектов, наглядно представить различия и запустить или сохранить SQL скрипт, который применит изменения.Экспорт пользовательских объектовДля экспорта положений DDL (Data Definition Language) или выбранных пользовательских объектов, вы можете использовать инструмент для экспорта пользовательских объектов. Он поможет легко воссоздать объекты для другого пользователя ил сохранить файл(ы) как backup.ИнструментыPL/SQL Developer включает несколько инструментов для облегчения каждодневной работы разработчика. Вы можете перекомпилировать все неправильные объекты, искать текст в резурсах баз данных, импортировать и экспортировать таблицы, наблюдать за событиями dbms_alert и dbms_pipe, просматривать информацию о сессии, и так далее.Дополнительные модулиФункциональность PL/SQL Developer можно расширить при помощи доп. модулей. Мы предоставляем дополнительные модули (Plug-Ins) на странице Add-ons, где вы можете загрузить их совершенно бесплатно. Дополнительные модули могут быть предоставлены Allround Automations (как Version Control Plug-In или PL/Formatter Plug-In) или другими пользователями. Если вы можете использовать язык программирования, на котором можно создавать DLL, вы даже можете писать собственные дополнительные модули.Многопоточный IDEPL/SQL Developer - многопоточный IDE. Это значит, что вы можете продолжать работу, когда запущены SQL запросы, PL/SQL программы, сессии отладки, и т.д. Это так же означает, что IDE не \"зависнет\", если вы сделаете ошибку в программировании: вы сможете прервать исполнение или сохранить работу в любой момент.Легко устанавливатьНе нужно никакого связующего ПО, кроме SQL*Net. Никакой установки объекта базы данных. Простейшая процедура установки, и вы готовы к работе.\n\n\nСкриншоты\n\n\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:0E7B5E68D16D1788502D792614ED28F2A9A3F786&tr=http%3A%2F%2Fbt4.t-ru.org%2Fann%3Fmagnet&dn=PL%2FSQL%20Developer%209.0.6.1665","torrent_link":"dl.php?t=2542270","thanked_list":[{"id":"42143458","name":"akbar191986 ","data":"(27-Апр-23)"},{"id":"26416034","name":"Yashida ","data":"(25-Апр-23)"},{"id":"17480777","name":"xwanik ","data":"(10-Мар-23)"},{"id":"13856303","name":"Jurik12 ","data":"(19-Янв-23)"},{"id":"33046840","name":"123abusha ","data":"(17-Янв-23)"},{"id":"19111553","name":"rea3d ","data":"(24-Июл-22)"},{"id":"736071","name":"serge_kar ","data":"(14-Июн-22)"},{"id":"22157538","name":"Vsev99 ","data":"(15-Май-22)"},{"id":"20178397","name":"wova.vi ","data":"(26-Апр-22)"},{"id":"1660950","name":"MeX000 ","data":"(11-Апр-22)"},{"id":"2223310","name":"Erroman ","data":"(31-Мар-22)"},{"id":"17233995","name":"mr_brooks ","data":"(13-Фев-22)"},{"id":"13473890","name":"Тыгдым ","data":"(20-Янв-22)"},{"id":"13784711","name":"yazoo_ ","data":"(04-Дек-21)"},{"id":"15804164","name":"siroj1971 ","data":"(27-Ноя-21)"},{"id":"18384373","name":"3d_friz ","data":"(26-Ноя-21)"},{"id":"12823526","name":"ua_gs ","data":"(22-Ноя-21)"},{"id":"10859568","name":"ghexx ","data":"(13-Ноя-21)"},{"id":"24370552","name":"EpiH ","data":"(23-Окт-21)"},{"id":"33442727","name":"Extravector2010 ","data":"(08-Окт-21)"},{"id":"37965634","name":"DormidontLoewe ","data":"(20-Сен-21)"},{"id":"847517","name":"dark_monstr ","data":"(30-Авг-21)"},{"id":"45756473","name":"KnAWorker ","data":"(07-Июл-21)"},{"id":"44051636","name":"helkar159753 ","data":"(09-Апр-21)"},{"id":"20385461","name":"predrag021 ","data":"(30-Янв-21)"},{"id":"27624085","name":"savinov_v ","data":"(01-Дек-20)"},{"id":"4835496","name":"nuckid ","data":"(17-Ноя-20)"},{"id":"35809008","name":"DenisSher95 ","data":"(26-Окт-20)"},{"id":"24153837","name":"Rustam2091 ","data":"(10-Дек-19)"},{"id":"15874411","name":"John_GreenCAT ","data":"(21-Окт-19)"},{"id":"14729403","name":"can79 ","data":"(30-Июн-19)"},{"id":"12443946","name":"freemind8 ","data":"(06-Фев-19)"},{"id":"22143088","name":"utatv ","data":"(12-Ноя-18)"},{"id":"26375023","name":"BlackIceZ ","data":"(24-Авг-18)"},{"id":"5984878","name":"nonamip ","data":"(18-Авг-18)"},{"id":"6847141","name":"Irakly-1977 ","data":"(13-Авг-18)"},{"id":"34953542","name":"pepsichanhvn ","data":"(01-Авг-18)"},{"id":"23188930","name":"vrahimovv ","data":"(30-Июл-18)"},{"id":"25241054","name":"Александр Бенуа ","data":"(16-Фев-18)"},{"id":"23666717","name":"MikolaParavoz ","data":"(24-Окт-17)"},{"id":"23407433","name":"elshad685 ","data":"(09-Окт-17)"},{"id":"14671190","name":"smplmnd ","data":"(08-Авг-17)"},{"id":"25712205","name":"vanikin9 ","data":"(05-Июл-17)"},{"id":"15698470","name":"gorelli ","data":"(03-Май-17)"},{"id":"3512816","name":"bers15 ","data":"(14-Апр-17)"},{"id":"39822511","name":".NETFighter ","data":"(09-Мар-17)"},{"id":"39757103","name":"avls ","data":"(21-Фев-17)"},{"id":"37224701","name":"Alexeyf2001 ","data":"(18-Янв-17)"},{"id":"13814396","name":"starscream79 ","data":"(19-Дек-16)"},{"id":"12203630","name":"Arith ","data":"(26-Сен-16)"}]}