{"link":"2560177","name":"EMS SQL Manager 2008 for SQL Server 3.4.0.5","date":"24-Дек-09 18:02","author":"tilur","description":"\nEMS SQL Manager 2008 for SQL Server 3.4.0.5Год выпуска: 2009\nВерсия: 3.4.0.5\nРазработчик: EMS\nПлатформа: Windows\nСовместимость с Vista: полная\nЯзык интерфейса: английский + русский\nТаблэтка: Присутствует\nОписание: EMS SQL Manager for SQL Server - это высокопроизводительная программа для разработки и администрирования сервера Microsoft SQL. SQL Manager работает со всеми версиями SQL Server, начиная с седьмой, и поддерживает все новейшие возможности SQL Server, включая новые типы данных (datetimeoffset, hierarchyid, geometry, geography и другие), табличные типы и параметры табличных значений, триггеры входа, резервные копии с сжатием и многое другое. Программа включает в себя множество инструментов, таких как Визуальный конструктор баз данных, который позволяет быстро создавать базы данных SQL Server, Визуальный конструктор запросов для построения сложных запросов к SQL Server и множество других полезных инструментов для эффективного администрирования SQL Server. Современный, графический интерфейс и оптимальная система мастеров настроек будут понятны даже новичку.\nДоп. информация:\n[*] Поддержка SQL Server 2008\n[*] Поддержка данных в кодировке Unicode\n[*] Быстрая навигация и управление базами данных\n[*] Элементарное управление всеми объектами SQL Server\n[*] Эффективные инструменты управления данными\n[*] Эффективное управление параметрами безопасности\n[*] Великолепные графические и текстовые инструменты для построения запросов\n[*] Впечатляющие возможности импорта и экспорта данных\n[*] Мощный визуальный конструктор баз данных\n[*] Простые и удобные мастера для выполнения административных задач SQL Server\n[*] Другие необходимые инструменты для простой и удобной работы SQL Server\n[*] Конструктор отчетов с понятным мастером создания отчетов\n[*] Современный графический интерфейс пользователя\n\nЧто нового в версии 3.4.0.5\nДобавлена поддержка следующей функции SQL Server 2008:\n[*]Регулятор ресурсов (Resource Governor).\n[*]Поддержка условия \"FOR XML\" в запросах для вывода результатов в формате XML вместо стандартного набора строк (rowset).\n[*]В редакторе SQL запросов и в редакторе SQL-скриптов теперь поддерживаются макросы.\n[*]Просмотр данных | Просмотр в виде BLOB: добавлена вкладка \"XML\", позволяющая просматривать данные XML в виде дерева.\n[*]Внедрена поддержка UNICODE в текстах процедур/функций, представлений, триггеров, ограничений, описаний объектов, значений полей по умолчанию и ряде других свойств объектов.Управление правами:\n[*]Добавлена поддержка разрешений на БД при работе с SQL Server 2005 и выше.\n[*]Разделены роли и пользователи в списке привилегий.\n[*]Разрешения столбцов показывались не всегда верно: не учитывались разрешения объекта верхнего уровня. Исправлено.\n[*]Регистрационная информация базы данных:\n[*]Большинство опций из секции \"Сетка | Настройки данных\" диалогового окна \"Настройки окружения\" теперь могут быть заданы отдельно для каждой [*]зарегистрированной БД в диалоговом окне \"Регистрация Баз Данных\". Значения опций, заданные на странице \"Сетка | Настройки данных\" будут применяться по умолчанию для новых регистрируемых баз данных.\n[*]Добавлена возможность выбора поставщика данных: OLE DB Provider for SQL Server или SQL Native Client.\n[*]Журналы изменения метаданных и запросов редактора SQL теперь могут быть сохранены в UNICODE или ANSI.Редактор SQL:\n[*]После выполнения Transact-SQL оператора USE в статусной строке редактора отображается имя текущей базы данных.\n[*]Исправлено несколько ошибок, связанных с подсветкой синтаксиса.\n[*]Исправлено несколько ошибок, связанных с неверным синтаксическим разбором псевдонимов таблиц в запросах.\n[*]Не работало сочетание клавиш Ctrl+Alt+C для отображения списка полей таблицы, имя которой скопировано в буфер обмена. Исправлено.\n[*]Не всегда правильно отображалось количество изменённых записей. Исправлено.Проводник БД:\n[*]Улучшено диалоговое окно \"Найти объект\".\n[*]Добавлена возможность запуска процедур и функций, определяемых пользователем, непосредственно из Проводника БД (с помощью контекстного меню).\n[*]Теперь программа сохраняет информацию о последней открытой базе данных перед выходом. При следующем запуске программы эта база данных автоматически выбирается в дереве Проводника БД.\n[*]В панель инструментов добавлена кнопка переключения режима поиска.\n[*]Двойной щелчок по группе объектов раскрывает и скрывает ветвь дерева.\n[*]При добавлении серверного объекта в дереве показывался только этот новый объект, в случае если ветвь дерева еще не была обновлена. Исправлено.Извлечение базы данных:\n[*]Теперь скрипт генерируется непосредственно в выбранной кодировке, что сокращает время генерации скрипта.\n[*]При включенной опции \"Генерировать операторы DROP\" генерировались лишние операторы удаления объектов таблицы. Исправлено.\n[*]Экспорт в виде SQL-скрипта: теперь скрипт генерируется непосредственно в выбранной кодировке, что сокращает время генерации скрипта.Визуальный конструктор баз данных:\n[*]Теперь таблицы в режиме обратного инжиниринга (reverse engineering) расположены более компактно.\n[*]Если диаграмма была загружена из файла, то функции выравнивания не работали. Исправлено.\n[*]Опции: возможность применения настроек по умолчанию (для всех или только для отдельной категории опций) доступна во всех диалоговых окнах с опциями.\n[*][*]Список окон: добавлена команда \"Закрыть все окна базы данных\".\n[*][*]Сетка данных: изменен метод работы в асинхронном режиме - отдельное соединение для каждой Сетки данных позволяет одновременно проводить выборку без потери возможности использовать другие функции программы.\n[*][*]Сетка данных: подсветка выбранной записи изменяется при переключении фокуса с сетки данных.\n[*][*]Редактор шагов задания: Добавлена поддержка опции \"Записывать журнал в таблицу\", а также новых подсистем SQL Server 2008.\n[*]В журнал изменений метаданных теперь также записываются изменения, которые производятся при пересоздании таблицы: изменение названия поля, переупорядочивание полей.\n[*]Мастер сохранения настроек: теперь при сохранении настроек в существующем файле программа предлагает заменить файл или создать новый уникальный файл с добавлением текущих даты и времени к имени файла.\n[*]Настройки окружения | Инструменты | Справка по SQL Server: добавлена опция для SQL Server 2008 Books Online.Редактор полнотекстовых каталогов:\n[*]Значение типа данных поля полнотекстового индекса не применялось при сохранении объекта. Исправлено.\n[*]При сохранении изменений нажатие \"Отмена\" в окне изменения метаданных приводило к потере изменений в редакторе. Исправлено.\n[*]В DDL функций, определяемых пользователем, отсутствовали комментарии полей возвращаемой таблицы. Исправлено.\n[*]Связанные серверы. Не отображалось содержимое связанного сервера, если провайдер не поддерживает информацию в каталоге. Исправлено.\n[*]Редактор функций секционирования. Не отображались миллисекунды в граничных значениях типа datetime. Исправлено.\n[*]Экспорт данных. При экспорте данных типа decimal с точностью менее 15-ти знаков числа округлялись до 4 десятичных разрядов. Исправлено.\n[*]Конструктор запросов. Неправильно подбиралась ширина диалога \"Свойства ссылки\" при работе в Windows Vista. Исправлено.\n[*]Нельзя было изменить описание объекта, если объект имел описание в виде пустой строки. Исправлено.\n[*]Редактор ролей. На вкладке \"Член роли\" не работала команда \"Обновить\". Исправлено.\n[*]Редактор полей. Не отключалась опция \"Разреженный\" (Sparse) для NOT NULL полей (при работе с SQL Server 2008). Исправлено.\n[*]Предупреждение об уровне совместимости (compatibility level) базы данных при соединении нельзя было отключить - значение опции \"Больше не спрашивать об этом\" не сохранялось после закрытия программы.\n[*]Другие небольшие изменения и исправления ошибок.\n\n\nСкриншоты\n\n\n\n\nВажно !\nПроверьте пожалуйста таблетку. Через некоторое время после начала работы приложения может появляться ошибка типа: файл был изменен, приложение будет закрыто (на англ.).В остальном программа работоспособна. Если проявится у всех, то обязательно отпишитесь. Заранее прошу прощения.  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:DF17B3C206FD8729463EF3FCDF6416C08D19D89D&tr=http%3A%2F%2Fbt4.t-ru.org%2Fann%3Fmagnet&dn=EMS%20SQL%20Manager%202008%20for%20SQL%20Server%203.4.0.5","torrent_link":"dl.php?t=2560177","thanked_list":[{"id":"41532803","name":"OlScol ","data":"(17-Дек-21)"},{"id":"5404377","name":"BatalinVA ","data":"(16-Дек-21)"},{"id":"20624761","name":"Dencha1980 ","data":"(10-Янв-21)"},{"id":"14097027","name":"expilgrim ","data":"(28-Ноя-18)"},{"id":"158990","name":"tosha30 ","data":"(14-Июн-17)"},{"id":"21822172","name":"gilbert01 ","data":"(27-Ноя-16)"},{"id":"17210280","name":"nikolais65 ","data":"(10-Окт-16)"},{"id":"14361300","name":"habramit ","data":"(28-Сен-16)"},{"id":"15874288","name":"aWlad ","data":"(19-Авг-16)"},{"id":"1671501","name":"Лилия_Михайловна ","data":"(01-Авг-16)"},{"id":"11671358","name":"AMelnik ","data":"(11-Июл-16)"},{"id":"10170807","name":"iamsuper ","data":"(30-Июн-16)"},{"id":"41137464","name":"jimbokit ","data":"(21-Июн-16)"},{"id":"25678634","name":"romangreen_rt ","data":"(24-Май-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"9490466","name":"KOSTKOR ","data":"(22-Янв-16)"},{"id":"15570156","name":"zurfishe ","data":"(13-Янв-16)"},{"id":"18804110","name":"Jilio ","data":"(19-Июн-15)"},{"id":"23314622","name":"mpizan ","data":"(30-Июн-14)"},{"id":"0","name":"Гость","data":"(25-Фев-14)"},{"id":"14166695","name":"mv1955 ","data":"(18-Фев-14)"},{"id":"29060445","name":"Somimax ","data":"(17-Дек-13)"},{"id":"11019878","name":"zafter ","data":"(13-Дек-13)"},{"id":"9703563","name":"valnech ","data":"(22-Сен-13)"},{"id":"0","name":"Гость","data":"(13-Сен-13)"},{"id":"25430715","name":"alexalet ","data":"(30-Авг-13)"},{"id":"19050404","name":"pippopalla ","data":"(06-Май-13)"},{"id":"21022776","name":"vsonyko ","data":"(07-Мар-13)"},{"id":"15139396","name":"nave_vlad ","data":"(11-Фев-13)"},{"id":"14493053","name":"AnVaRus ","data":"(05-Фев-13)"},{"id":"21583698","name":"Andre$65 ","data":"(10-Дек-12)"},{"id":"14253388","name":"Zhigiroff ","data":"(08-Дек-12)"},{"id":"20673515","name":"Slepen76 ","data":"(26-Окт-12)"},{"id":"2135061","name":"amz ","data":"(25-Окт-12)"},{"id":"16786270","name":"Тарасенко Виталий ","data":"(01-Окт-12)"},{"id":"25356122","name":"sergey_el ","data":"(27-Июл-12)"},{"id":"14300200","name":"pavel-aparin ","data":"(30-Май-12)"},{"id":"17574280","name":"teodorism ","data":"(28-Май-12)"},{"id":"10834575","name":"Zero1131 ","data":"(20-Апр-12)"},{"id":"0","name":"Гость","data":"(25-Янв-12)"},{"id":"8048764","name":"fyrg ","data":"(11-Янв-12)"},{"id":"15700353","name":"narwhall ","data":"(05-Ноя-11)"},{"id":"15211992","name":"roram5 ","data":"(01-Ноя-11)"},{"id":"6071706","name":"Metal71 ","data":"(28-Окт-11)"},{"id":"7082639","name":"svmoshkin ","data":"(01-Авг-11)"},{"id":"4126974","name":"dimbler1 ","data":"(11-Июл-11)"},{"id":"19476388","name":"pincodream ","data":"(17-Май-11)"},{"id":"0","name":"Гость","data":"(25-Фев-10)"},{"id":"0","name":"Гость","data":"(26-Дек-09)"}]}