{"link":"2627511","name":"Embarcadero Interbase SMP 2009 9.0.3.437 [СУБД, Interbase]","date":"11-Янв-10 21:26","author":"kain_pl","description":"\nEmbarcadero Interbase SMP 2009 9.0.3.437Год выпуска: Август 2009\nВерсия:9.0.3.437\nРазработчик: Embarcadero\nПлатформа: Windows\nСистемные требования:\n\n32 Мб ОЗУ\n20/35 Мб на жестком диске для компактной/полной установки\nIntel x86\nWindows Vista/Server 2003 и 2008/2000 (SP4)/XP (SP2)\n\n\nЯзык интерфейса: Английский\nТаблэтка: Присутствует\nОписание:InterBase SMP 2009 - мощная база данных для корпоративных приложений.InterBase SMP 2009 объединяет в себе преимущества производительности, которые предлагает мультигенерационная архитектура (multi-generational architecture), с возможностями журналирования и восстановления после сбоев. Новые функции безопасности и шифрования обеспечивают улучшенную защиту данных. Удобная установка, компактность, автоматическое восстановление после сбоев, Unicode, встроенная поддержка симметричной многопроцессорной обработки, соответствие стандарту SQL 92 и минимальные требования к обслуживанию делают InterBase SMP 2009 идеальной базой данных (БД) для встроенных и ответственных серверных приложений для малых и средних организаций.ВОЗМОЖНОСТИ И ПРЕИМУЩЕСТВА\nКогда производительность имеет значение. InterBase SMP - одна из самых быстрых собственных БД. Она использует свои встроенные средства симметричной многопроцессорной обработки (symmetric multiprocessing, SMP) и масштабируется до нескольких процессоров, включая многоядерные процессоры. В такие области, как пакетные обновления, оптимизация запросов и улучшение оперативной обработки транзакций (OLTP) с помощью журналирования, были добавлены улучшения производительности и оптимизация. InterBase реализует мультигенерационную архитектуру, или архитектуру множественности поколений записей. Она предоставляет уникальные возможности управления версиями, которые приводят к высокой доступности данных как для пользователей с большим объемом обработки транзакций, так и для специалистов по принятию решений, причем одновременно. Поддержка одновременно нескольких экземпляров InterBase на одном компьютере обеспечивает изоляцию приложений и балансировку нагрузки.Встраивайте - развертывайте - расслабьтесь. В InterBase SMP 2009 простота установки и автоматическое восстановление после сбоев объединены с самонастраивающимся ядром. Это делает данную СУБД хорошо приспособленной для встраивания. Эта система идеально подходит для независимых производителей ПО, OEM-производителей и реселлеров, которым нужна БД для поддержки широкофункциональных ответственных приложений, одновременно компактная с точки зрения требуемой памяти и дискового пространства и предлагающая весь спектр возможностей. Также, в отличие от многих других корпоративных БД, которые требуют для поддержки и обслуживания дорогих экосистем, InterBase SMP практически не требует сопровождения.Эта портативная, международная, кросс-платформенная БД обеспечивает рост и гибкость. Версия InterBase SMP 2009 Server Edition сертифицирована для работы без изменений на платформах Windows, Linux, Solaris, Mac OS X. Это позволяет развертывать БД на различных платформах без переписывания кода. БД полностью переносима между различными платформами, а также между версиями InterBase SMP Desktop Edition и InterBase SMP Server Edition. Это обеспечивает гибкое развертывание. Кроме того, InterBase SMP 2009 поддерживает развертывание в международных средах с несколькими многоязычными наборами символов, включая новейшие стандарты Unicode, UTF-8 и UCS2. Новая версия InterBase To-Go Edition - это небольшой портативный вариант версии Desktop Edition. Версия To-Go Edition отлично подходит для небольших устройств, общедоступных киосков, а также для приложений реселлеров и OEM-производителей. Версия InterBase SMP To-Go характеризуется компактностью (менее 2 Мб). Это дает разработчикам для платформы Windows необходимую гибкость, чтобы включить в свои приложения встроенную и очень надежную транзакционную БД с поддержкой стандарта SQL.Создано для разработчиков. Разработчики, которые используют CodeGear RAD Studio, включая Delphi и C++Builder, а также JBuilder, 3rdRail и другие инструменты, могут эффективно использовать широкий диапазон стандартных вариантов подключения к БД: ODBC, JDBC, ADO.NET и IBX. Возможности мониторинга транзакций предоставляют разработчикам гранулярные средства контроля для просмотра, запуска, остановки и отката транзакций, процессов и запросов. InterBase удовлетворяет стандартам SQL92. Эта СУБД предлагает разработчикам все, что можно ожидать от БД с поддержкой SQL: триггеры, хранимые процедуры и представления, а также улучшенные концепции, например, домены и оповещения о событиях.\n\nКлючевые возможности(Enu)\n\n\nHighly secure database and column level encryption supporting either weak (DES) or strong (AES) encryption\nOver the Wire (OTW) Encryption that encrypts data between servers and clients using SSL\nVariety of editions to support every type of user across multiple platforms– from small enterprise server applications and embeddable database applications, to small portable devices and kiosks from VAR/OEM applications\nHigh-performance and scalability, with built-in support for Symmetric Multi-Processing (SMP) for multi-core CPUs\nAutomatic Crash recovery and easy Disaster Recovery setup with journaling\nOnline dumps and Incremental backup allow multiple mirrored copies of primary database for faster backup and read-only access\nSimple installation with self-tuning engine to maximize database performance and availability for server, desktop, and embedded applications\nNear zero maintenance and low deployment costs\nHighly integrated with Embarcadero’s application development and database management software\nSQL 92 compliant\n\n\n\n\nРедакции продукта (Enu)\nServer Edition\nInterBase SMP 2009 Server Edition is a highly-scalable, portable, cross-platform database, ideal for mission-critical enterprise, small-to-medium business, and embedded applications. InterBase SMP 2009 Server Edition delivers high performance for applications with complex business logic and high concurrent user levels through its built-in symmetric multiple processing (SMP) support and multi-threaded architecture. Built-in SMP support allows enterprises greater scalability with support for Dual/Quad-core and additional CPUs (up to 8) with no additional per-core licensing required.\nFast, easy installation, a small footprint, automatic crash recovery, self-tuning, and near zero maintenance make InterBase SMP the ideal solution for embedded, turn-key applications. SQL 92 compliance, advanced data reliability and recovery, Unicode, numerous connectivity options, and support for Windows®, Linux, SolarisTM, and Mac OS® X make InterBase SMP perfect for high-powered, cost-effective business-critical server applications in small-to-medium enterprises.Desktop Edition\nInterBase SMP 2009 Desktop Edition for Windows is a powerful, cost-effective deployment solution for standalone applications. Through its integration with Delphi®, C++Builder®, Delphi PrismTM, CodeGearTM RAD Studio, JBuilder®, and 3rdRail® development tools, InterBase Desktop Edition enables the rapid development of sophisticated desktop-based applications. With a small operational footprint, automatic crash recovery, and incremental backup, InterBase SMP Desktop Edition is an ideal embedded database for broad, desktop deployments that lack IT support and administration resources.To-Go Edition\nInterBase SMP To-Go Edition is a completely embeddable, full-featured, zero administration database that enables ISVs, OEMs, and VARs to bring their applications and solutions to market faster. The To-Go Edition allows deployment of applications that utilize the InterBase engine DLLs. With no separate database server process running, the database engine executes in the application process space, saving valuable memory. InterBase To-Go provides the benefits of InterBase in an extremely small footprint and works with flash file systems and other read-only media such as DVDs and CDs.Developer Edition\nInterBase SMP 2009 Developer Edition provides developers with the best cross-platform database to build and test database applications for embedded and SME applications. Developers are free to choose the standard connectivity they want, and make use of a mature SQL92 compliant database for their applications. Database performance monitoring allows the developer to streamline applications for optimal deployment.\n\n\n\nСкриншоты\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:353D765F3C505784580FEBBD769E6DE8D1441C13&tr=http%3A%2F%2Fbt4.t-ru.org%2Fann%3Fmagnet&dn=Embarcadero%20Interbase%20SMP%202009%209.0.3.437%20%5B%D0%A1%D0%A3%D0%91%D0%94%2C%20Interbase%5D","torrent_link":"dl.php?t=2627511","thanked_list":[{"id":"12183131","name":"Johnkmv ","data":"(20-Июн-23)"},{"id":"19139148","name":"esenheim ","data":"(05-Июн-23)"},{"id":"22621086","name":"grayrav ","data":"(30-Апр-23)"},{"id":"29997111","name":"MoonGoose ","data":"(22-Янв-23)"},{"id":"2665747","name":"krylof ","data":"(16-Янв-23)"},{"id":"35882239","name":"Rim Po ","data":"(14-Окт-22)"},{"id":"44809300","name":"ineonick ","data":"(06-Окт-22)"},{"id":"179873","name":"ctis ","data":"(20-Июн-22)"},{"id":"15163460","name":"Silent_Hope ","data":"(10-Май-22)"},{"id":"25040806","name":"JohnDalton ","data":"(24-Ноя-21)"},{"id":"4050990","name":"borislav10 ","data":"(24-Сен-21)"},{"id":"26091923","name":"Шуру ","data":"(21-Июн-21)"},{"id":"24488137","name":"gus1954 ","data":"(19-Май-21)"},{"id":"20331505","name":"TarrokBel ","data":"(10-Мар-21)"},{"id":"13595881","name":"topotun05 ","data":"(20-Дек-20)"},{"id":"3756973","name":"sanyko ","data":"(02-Ноя-20)"},{"id":"17430497","name":"Astronos ","data":"(10-Окт-20)"},{"id":"43912237","name":"TaSHcherKa ","data":"(07-Окт-20)"},{"id":"11571291","name":"Кузьма Бородулин ","data":"(31-Июл-20)"},{"id":"14634294","name":"klok79a ","data":"(27-Апр-20)"},{"id":"20655101","name":"oleg_work ","data":"(05-Мар-20)"},{"id":"16780489","name":"VolodyaU80 ","data":"(09-Фев-20)"},{"id":"22069258","name":"Nik_Pro ","data":"(16-Ноя-19)"},{"id":"11005109","name":"roman_ssh ","data":"(26-Сен-19)"},{"id":"35542953","name":"ran-adyl ","data":"(28-Авг-19)"},{"id":"43927826","name":"dimongro ","data":"(21-Апр-19)"},{"id":"2135061","name":"amz ","data":"(09-Апр-19)"},{"id":"33520380","name":"sollex68 ","data":"(25-Фев-19)"},{"id":"9484936","name":"isergy1 ","data":"(25-Окт-18)"},{"id":"28496131","name":"dm1551 ","data":"(30-Апр-18)"},{"id":"36282396","name":"kgro ","data":"(19-Фев-18)"},{"id":"17945845","name":"ivanhorvat ","data":"(08-Янв-18)"},{"id":"32160295","name":"Максим Дмитрич ","data":"(27-Май-17)"},{"id":"42288865","name":"kapa_757 ","data":"(29-Апр-17)"},{"id":"22337644","name":"eyesys ","data":"(19-Апр-17)"},{"id":"1855083","name":"ef70 ","data":"(06-Фев-17)"},{"id":"18203667","name":"XXXelA ","data":"(24-Янв-17)"},{"id":"25913798","name":"MATRIX.1.3 ","data":"(26-Дек-16)"},{"id":"25794291","name":"compilerman ","data":"(19-Окт-16)"},{"id":"17020748","name":"FelipeVervena ","data":"(04-Сен-16)"},{"id":"11569612","name":"kfd69 ","data":"(22-Июл-16)"},{"id":"19137509","name":"Nick_st1 ","data":"(29-Июн-16)"},{"id":"18557599","name":"Денис Иванча ","data":"(25-Июн-16)"},{"id":"34310753","name":"nestormsu ","data":"(22-Июн-16)"},{"id":"14383142","name":"bpeed ","data":"(21-Июн-16)"},{"id":"30725415","name":"vensko1 ","data":"(19-Июн-16)"},{"id":"22976642","name":"mrice2004 ","data":"(27-Май-16)"},{"id":"25431683","name":"gpkuklin ","data":"(16-Май-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"2791373","name":"julia2386 ","data":"(08-Апр-16)"},{"id":"21814452","name":"juma02 ","data":"(29-Мар-16)"},{"id":"36213495","name":"leming666 ","data":"(23-Мар-16)"},{"id":"709301","name":"das282 ","data":"(27-Янв-16)"}]}