{"link":"2848547","name":"FileMaker PRO Advanced v11.0.1.96 and FileMaker SERVER Advanced v11.0.1.95","date":"25-Мар-10 03:33","author":"ivanushka","description":"\nFileMaker PRO Advanced v11.0.1.96 and FileMaker SERVER Advanced v11.0.1.95Год выпуска: 2010\nВерсия: pro v11.0.1.96 и serv v11.0.1.95\nРазработчик: FileMaker\nПлатформа: windows\nСовместимость с Vista: полная\nСистемные требования:\nдля FileMaker PRO Advanced v11.0.1.96\nWindows 7 Ultimate, Professional, Home Premium\nCPU: 1 GHz or faster\nRAM: 1 GB\nDirectX 9 graphics device with WDDM 1.0 or higher driver, DVD driveWindows Vista Ultimate, Business, Home Premium\n(SP 2)\nCPU: 1 GHz or faster\nRAM: 1 GB\n1024x768 or higher resolution video adapter and display, DVD driveWindows XP Professional, Home Edition (SP 3)\nCPU: Pentium III 700 MHz or faster\nRAM: 256 MB of RAM\n1024x768 or higher resolution video adapter and display, DVD drive\nподробнее см. http://www.filemaker.com/products/filemaker-pro/pro-11-specifications.htmlдля FileMaker SERVER Advanced v11.0.1.95\nWindows Server 2008 R2\nWindows 7 Professional Edition\nWindows Server 2008 Standard Edition SP2\nCPU: Core Duo\nRAM: 2 GB\nHard drive: 80+ GBWindows Server 2003 Standard Edition SP2\nCPU: Pentium 3.4 GHz\nRAM: 2 GB\nHard drive: 80+ GB\nподробнее см. http://www.filemaker.com/products/filemaker-server/server-11-specifications.htmlЯзык интерфейса: английский + (без русского)\nТаблэтка: Присутствует\nОписание:\nFileMaker Pro Advanced v11.0.1.96FileMaker — система управления базами данных, помогающая организовать хранение большого количества деловой информации. С помощью данного решения удобно упорядочивать данные и эффективно управлять ими, что гарантирует быстрый доступ к необходимой информации. Программа обладает удобными средствами настройки и исключительной простотой в использовании, что позволяет достигать высоких результатов в течение нескольких минут, независимо от того, чем управляет пользователь — простым списком рассылки или комплексной системой отслеживания производственных ресурсов. Готовые к использованию встроенные шаблоны помогут быстро создавать собственное решение и вводить его в эксплуатацию. Практически, неограниченные размеры базы данных, позволят хранить любое количество информации. Данные могут быть связаны между собой, что гарантирует их более упорядоченное хранение и упрощает поиск нужной записи.FileMaker Pro Advanced включает все возможности продукта FileMaker Pro и дополнительно содержит комплект усовершенствованных инструментов для разработки и индивидуализации, которые помогут в проектировании и разработке мощных и индивидуализированных приложений для работы с базами данных!Возможности программы:\n» Добавление текста и вычислений в поля или другие объекты, которые отображаются при наведении мыши\n» Визуальное форматирование полей и объектов на основе ваших условий\n» Отображение информации с веб-сайтов, основанных на данных в вашей базе данных\n» Группирование похожих скриптов для быстрого доступа\n» Автоматическое создание e-mail с гиперссылкой, при клике которой откроется ваша база данных\n» Заполнение полей содержимым автоматически на основе предыдущих записей\n» Создание PDF документов напрямую из базы данных FileMaker\n» Объединение нескольких отчетов в один PDF файл для удобного распространения\n» Создание таблиц Excel из ваших данных FileMaker за один клик\n» Создание шаблона с несколькими вкладками (табами) за один шаг\n» Автоматическое подчеркивание слов, написанных с ошибкой (проверка орфографии)FileMaker Server Advanced v11.0.1.95FileMaker Server является быстрым, надежным и легко управляемым серверным ПО для групп пользователей FileMaker Pro, которое позволяет защищенным способом совместно использовать базы данных по сети или с помощью веб.Просто установите FileMaker Server на выделенный для этого компьютер и загрузите на него ваши решения FileMaker Pro. Установка и настройка занимает менее 20 минут. Вы сможете безопасно управлять базами данных с любого места, планировать резервное копирование в реальном времени, а также доступность сервера 24 часа в сутки, 7 дней в неделю.Если вам требуются функции Instant Web Publishing или необходимо совместно использовать данные FileMaker с другими приложениями посредством ODBC/JDBC, или же требуется подключение к большим группам пользователей FileMaker Pro, рассмотрите использование ПО FileMaker Server 11 Advanced.FileMaker Advanced включает в себя все возможности продукта FileMaker Server 11 и дополнительно предоставляет возможности мгновенной публикации в сети, подключение посредством ODBC/JDBC и большее число возможных подключений к FileMaker Pro. Независимо от того, используются данные в сети или на веб-сайте, FileMaker Server 11 Advanced обеспечивает максимальные возможности использования и подключения базы данных простым и безопасным способом.В сравнении с FileMaker Server, только FileMaker Server Advanced предоставляет следующие дополнительные возможности коллективного использования:-Большее количество одновременно подключенных пользователей\n-Если требуется подключение больших групп пользователей FileMaker Pro, только FileMaker Server 11 Advanced поддерживает до 999 пользователей FileMaker Pro одновременно — в 4 раза больше, чем FileMaker Server 11.Общий доступ для большего числа пользователей с помощью Instant Web Publishing\nВоспользуйтесь средством Instant Web Publishing для легкой публикации баз данных и предоставления доступа к данным через веб-сайт большим группам пользователей. Можно безопасным способом предоставлять доступ к любой информации с помощью лишь нескольких щелчков мыши. Можно публиковать сайты регистрации, формы обратной связи с клиентами, запросы на обслуживание, исследования и многое другое. Средство Instant Web Publishing не требует для работы особого аппаратного или программного обеспечения и поддерживает широко распространенные веб-браузеры.Поддержка совместного использования данных FileMaker Pro через ODBC/JDBC\nODBC (Open Database Connectivity) и JDBC (Java Database Connectivity) делает возможным чтение и запись в базах данных FileMaker Pro, размещенных на FileMaker Server 11 Advanced, со множеством внешних программ и средств разработки. Получите до 50 одновременных удаленных подключений ODBC/JDBC. Подключения могут быть установлены программами, выполняющимися как на локальном сервере, так и на удаленных клиентах.Доступ к данным, управляемым FileMaker, легко осуществляется с помощью приложения, совместимого с ODBC/JDBC.\nДанные из FileMaker могут быть переданы в веб-приложение, построенное с помощью стандартных средств веб-разработки, например Ruby on Rails, javascript или Microsoft .NET Framework.\nДанные из FileMaker интегрируются с пользовательскими приложениями, построенными на основе ведущих платформ, таких как Oracle, SAP или Microsoft SQL.Возможности программы:\n» Добавление текста и вычислений в поля или другие объекты, которые отображаются при наведении мыши\n» Визуальное форматирование полей и объектов на основе ваших условий\n» Отображение информации с веб-сайтов, основанных на данных в вашей базе данных\n» Группирование похожих скриптов для быстрого доступа\n» Автоматическое создание e-mail с гиперссылкой, при клике которой откроется ваша база данных\n» Заполнение полей содержимым автоматически на основе предыдущих записей\n» Создание PDF документов напрямую из базы данных FileMaker\n» Объединение нескольких отчетов в один PDF файл для удобного распространения\n» Создание таблиц Excel из ваших данных FileMaker за один клик\n» Создание шаблона с несколькими вкладками (табами) за один шаг\n» Автоматическое подчеркивание слов, написанных с ошибкой (проверка орфографии)\nДоп. информация: FileMaker SERVER Advanced на моем РС не устанавливал - отсутствует CPU: Dual CPU/Core Duo\n\nСкриншоты\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:18898742BD80F441598BA9B764C823A3F0173620&tr=http%3A%2F%2Fbt4.t-ru.org%2Fann%3Fmagnet&dn=FileMaker%20PRO%20Advanced%20v11.0.1.96%20and%20FileMaker%20SERVER%20Advanced%20v11.0.1.95","torrent_link":"dl.php?t=2848547","thanked_list":[{"id":"45814554","name":"Shrek102 ","data":"(18-Апр-21)"},{"id":"45517662","name":"BigShaki ","data":"(19-Июн-20)"},{"id":"18660578","name":"andreev137 ","data":"(17-Янв-20)"},{"id":"17823043","name":"Haralampije ","data":"(07-Янв-20)"},{"id":"22736049","name":"grenden ","data":"(04-Ноя-19)"},{"id":"19272360","name":"Abacate ","data":"(03-Ноя-19)"},{"id":"4812828","name":"turyx ","data":"(09-Окт-19)"},{"id":"7134382","name":"fleckz ","data":"(18-Сен-19)"},{"id":"21160402","name":"elmaset ","data":"(12-Дек-18)"},{"id":"25990650","name":"TiARNAiT ","data":"(05-Авг-18)"},{"id":"42790894","name":"apfelkraft ","data":"(01-Мар-18)"},{"id":"15591751","name":"sahaQaa ","data":"(02-Фев-18)"},{"id":"42052811","name":"kolev.stephan ","data":"(13-Янв-18)"},{"id":"3309959","name":"samprint ","data":"(03-Мар-17)"},{"id":"13249066","name":"yukkon ","data":"(11-Авг-16)"},{"id":"25431683","name":"gpkuklin ","data":"(26-Май-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"31722468","name":"maestroromolo ","data":"(15-Мар-16)"},{"id":"3319898","name":"bynkov ","data":"(25-Авг-15)"},{"id":"31383159","name":"vzaytsev300 ","data":"(04-Июл-15)"},{"id":"697454","name":"Beniko ","data":"(01-Июл-15)"},{"id":"20271668","name":"inspectors ","data":"(18-Май-15)"},{"id":"17421364","name":"TamaziP ","data":"(11-Май-15)"},{"id":"3547572","name":"alekerdman ","data":"(06-Май-15)"},{"id":"36601570","name":"Q2Baklan ","data":"(30-Апр-15)"},{"id":"21114355","name":"aladdin09 ","data":"(24-Апр-15)"},{"id":"17341267","name":"j8d8ds8 ","data":"(22-Апр-15)"},{"id":"10090641","name":"deda123 ","data":"(27-Янв-15)"},{"id":"27618062","name":"Warm_AT ","data":"(21-Янв-15)"},{"id":"19529088","name":"Dyokstar ","data":"(11-Янв-15)"},{"id":"27466161","name":"hjuma ","data":"(08-Янв-15)"},{"id":"24000108","name":"Damasсena ","data":"(29-Дек-14)"},{"id":"21719764","name":"kudvy ","data":"(29-Дек-14)"},{"id":"4935009","name":"eihwazz ","data":"(29-Ноя-14)"},{"id":"0","name":"Гость","data":"(05-Ноя-14)"},{"id":"22246525","name":"vav112 ","data":"(14-Сен-14)"},{"id":"328666","name":"bobaqpe ","data":"(17-Авг-14)"},{"id":"0","name":"Гость","data":"(10-Авг-14)"},{"id":"16229856","name":"panthera---leo ","data":"(23-Июл-14)"},{"id":"17863318","name":"mafondue ","data":"(14-Июл-14)"},{"id":"9585071","name":"trojannn ","data":"(04-Июл-14)"},{"id":"35983452","name":"Rambaldy ","data":"(17-Июн-14)"},{"id":"18539983","name":"amk_nn ","data":"(29-Май-14)"},{"id":"6149171","name":"idalgoo ","data":"(28-Май-14)"},{"id":"33116010","name":"alvahob ","data":"(11-Апр-14)"},{"id":"9655608","name":"macmicus ","data":"(27-Мар-14)"},{"id":"6258075","name":"avfrus ","data":"(14-Мар-14)"},{"id":"0","name":"Гость","data":"(21-Янв-14)"}]}