{"link":"2904997","name":"EMS SQL Manager 2010 for SQL Server 3.5.0.4","date":"17-Апр-10 18:45","author":"keeberos2","description":"\nEMS SQL Manager 2010 for SQL Server 3.5.0.4Год выпуска: 11.2009\nРазработчик: EMS\nПлатформа: Windows\nСовместимость с Vista: полная\nЯзык интерфейса: английский + русский\nТаблэтка: Присутствует\nОписание: EMS SQL Manager for SQL Server - это высокопроизводительная программа для разработки и администрирования сервера Microsoft SQL. SQL Manager работает со всеми версиями SQL Server, начиная с седьмой, и поддерживает все новейшие возможности SQL Server, включая новые типы данных (datetimeoffset, hierarchyid, geometry, geography и другие), табличные типы и параметры табличных значений, триггеры входа, резервные копии с сжатием и многое другое. Программа включает в себя множество инструментов, таких как Визуальный конструктор баз данных, который позволяет быстро создавать базы данных SQL Server, Визуальный конструктор запросов для построения сложных запросов к SQL Server и множество других полезных инструментов для эффективного администрирования SQL Server. Современный, графический интерфейс и оптимальная система мастеров настроек будут понятны даже новичку.Доп. информация: Поддержка SQL Server 2008\nПоддержка данных в кодировке Unicode\nБыстрая навигация и управление базами данных\nЭлементарное управление всеми объектами SQL Server\nЭффективные инструменты управления данными\nЭффективное управление параметрами безопасности\nВеликолепные графические и текстовые инструменты для построения запросов\nВпечатляющие возможности импорта и экспорта данных\nМощный визуальный конструктор баз данных\nПростые и удобные мастера для выполнения административных задач SQL Server\nДругие необходимые инструменты для простой и удобной работы SQL Server\nКонструктор отчетов с понятным мастером создания отчетов\nСовременный графический интерфейс пользователяЧто нового (ENG)\n\nскрытый текст\nWhat's new in SQL Manager 2010 for SQL Server?Database Properties: the 'Transparent data encryption' option is now available when working with SQL Server 2008\nThe Jobs form now opens faster\nSQL editors:\nAdded the possibility to load the file contents into SQL Editor by dragging the file from the Windows Explorer onto the editor area The file encoding selected in the Open/Save file dialog is saved and then used when opening/saving files next time When using comments like /** ... **/, the text after the block was highlighted like comments. Fixed nowSQL Editor:\nIf a file name and path were too long for the window caption, the application used to cut the filename. Now it cuts the path XML field values were not displayed when connecting through the Native Client. Fixed now If the last line of the executed query contained comments, the query did not return a record set. Fixed now The Ctrl+D shortcut is added for the “Show Results on Edit Tab” command With a certain option combination set, all queries resulted in “0 records fetched”. Fixed nowSQL Script: if a file name and path were too long for the window caption, the application used to cut the filename. Now it cuts the path\nNow it is possible to connect to a database if the user does not have the necessary rights to obtain the collation list\nDuplicate Object Wizard: now it is possible to change the form size\nKey mapping: the confirmation dialog is now displayed on deleting a scheme and key combinations\nExtract Database:\nAdded the possibility to extract system objects The certificate dependency on users by the Authorization property is taken into account when a script is generatedCertificate Editor: the Start Date and End Date parameters now include the drop-down calendar to choose the date\nActivity Monitor: sometimes the “Overflow while converting variant of type (Int64) into type (Integer)” error occurred when opening a form for SQL Server 2008. Fixed now\nData View: due to an error in Windows Vista, the grid size did not change when enlarging the form size. Fixed now\nQuery Builder: an error occurred during the reverse engineering of a query where object names were quoted. Fixed now\nProcedure Editor: after executing a procedure which returned a record set, the Ctrl+Ins and Shift+Ins shortcuts stopped working on the procedure text editor’s tab. Fixed now\nUDF Editor: when launching a UDF, its name was not quoted – an error occurred if the name included invalid characters. Fixed now\nExport Data, Export as SQL Script: when working with queries returning several record sets, it is now possible to export the second and the following record sets\nLogin Editor:\nAn error occurred when revoking permissions for a database. Fixed now Now it is possible to create a login with a blank passwordIt was not possible to open the editor for an object if its name looked like ‘text (text)’. Fixed now\nTable Editor: if non-English localization was used in the program, the “Floating point division by zero” error occurred when switching to the Dependencies tab\nField Editor: if the default object was bound to the field, an error occurred on saving – a wrong script was generated. Fixed now\nIndex Editor: the Partitioning column list was not filled after choosing the partition scheme as an index data space. Fixed now\nExport as SQL Script: the values of numeric fields with a large precision were displayed as nvarchar values. Fixed now\nIt was not possible to open Job Editor if connection to a database with a case sensitive collation was established. Fixed now\nOther minor improvements and bug-fixes\n\n\nСкриншот\n\nскрытый текст\n\n\n\nКомпоненты SQL Management Studio 2010 for SQL Server\n\nскрытый текст\nSQL Manager for SQL Server - Упростите и автоматизируйте процесс разработки баз данных SQL Server, создавайте и поддерживайте существующие базы данных SQL Server, составляйте сложные запросы к SQL Server, управляйте правами пользователей SQL Server, обрабатывайте данные наиболее эффективно.\nData Export for SQL Server - Экспортируйте данные из таблиц SQL Server в любой из 19-ти наиболее популярных форматов, включая MS Access, MS Excel, MS Word, PDF, HTML, ODF и другие.\nData Import for SQL Server - Импортируйте данные в таблицы SQL Server из MS Access, MS Excel, CSV, XML и других популярных форматов с помощью дружественного интерфейса.\nData Pump for SQL Server - Переносите схему БД и импортируйте данные из распространенных баз данных (MySQL, PostgreSQL, Oracle, DB2, InterBase/Firebird и других) в SQL Server. Миграция в SQL Server из любого ADO-совместимого источника.\nData Generator for SQL Server - Генерируйте тестовые данные в базы данных SQL Server для проверки ее работоспособности. Большое разнообразие параметров генерации данных, дружественный мастер и полезное консольное приложение для автоматизации процесса генерации тестовых данных SQL Server.\nDB Comparer for SQL Server - Сравнивайте и синхронизируйте структуру баз данных SQL Server. С легкостью переносите изменения из рабочей базы данных в основную.\nDB Extract for SQL Server - Создавайте резервные копии баз данных SQL Server в виде сценария SQL, сохраняйте структуру баз данных SQL Server и табличные данные полностью или частично.\nSQL Query for SQL Server - Извлекайте и анализируйте информацию, создавайте запросы SQL Server в визуальном редакторе, работайте с планами запросов SQL Server, стройте диаграммы на основании полученных данных и многое другое.\nData Comparer for SQL Server - Сравнивайте и синхронизируйте данные таблиц баз данных SQL Server. Автоматический перенос данных из рабочей базы данных в основную. Осуществляйте автоматический перенос данных из рабочей базы данных в основную. Настраивайте процесс сравнения и синхронизации данных MS SQL Server в соответствии со своими задачами.\n\nЕсли не сложно нажмите кпочку \"Спасибо\"...Торент файл был перезалит 20.04.2010  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:3A02D36D1337BDAAB69C2CF3C9F0751CC8B04C42&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=EMS%20SQL%20Manager%202010%20for%20SQL%20Server%203.5.0.4","torrent_link":"dl.php?t=2904997","thanked_list":[{"id":"40140404","name":"Kuznets1975 ","data":"(20-Апр-23)"},{"id":"18995797","name":"getpack1 ","data":"(22-Мар-23)"},{"id":"15122044","name":"jamk ","data":"(07-Мар-23)"},{"id":"16992947","name":"alexlinuchev ","data":"(27-Дек-22)"},{"id":"45283588","name":"danfreet9 ","data":"(15-Ноя-22)"},{"id":"17772606","name":"Doctor_VeryZLO ","data":"(09-Ноя-22)"},{"id":"14097027","name":"expilgrim ","data":"(14-Сен-22)"},{"id":"40010561","name":"berring ","data":"(18-Авг-22)"},{"id":"1974705","name":"denits ","data":"(16-Авг-22)"},{"id":"129992","name":"Kasper3000 ","data":"(31-Май-22)"},{"id":"14258303","name":"VStrick ","data":"(28-Май-22)"},{"id":"22760372","name":"fatall_error81 ","data":"(17-Мар-22)"},{"id":"29632550","name":"Kelvin_a ","data":"(19-Дек-21)"},{"id":"5404377","name":"BatalinVA ","data":"(16-Дек-21)"},{"id":"9133329","name":"psyshine ","data":"(06-Окт-21)"},{"id":"18296594","name":"intro228 ","data":"(13-Сен-21)"},{"id":"1583466","name":"kidko ","data":"(29-Июл-21)"},{"id":"44958891","name":"serge_aa ","data":"(11-Май-21)"},{"id":"28898377","name":"kordgun ","data":"(29-Мар-21)"},{"id":"16085833","name":"loki-314 ","data":"(03-Мар-21)"},{"id":"40242126","name":"shatinsergeymih ","data":"(28-Янв-21)"},{"id":"24250790","name":"sabber888 ","data":"(20-Янв-21)"},{"id":"24248681","name":"alexchu081 ","data":"(07-Дек-20)"},{"id":"15511867","name":"xneo ","data":"(04-Дек-20)"},{"id":"17103900","name":"CrazyKiller2010 ","data":"(01-Дек-20)"},{"id":"43973413","name":"Flex101 ","data":"(15-Ноя-20)"},{"id":"18938864","name":"belan005 ","data":"(05-Окт-20)"},{"id":"34727461","name":"Anikoton ","data":"(16-Сен-20)"},{"id":"23891922","name":"EugenyDev ","data":"(27-Июн-20)"},{"id":"18280464","name":"Graf33russ ","data":"(27-Май-20)"},{"id":"178091","name":"justman ","data":"(10-Май-20)"},{"id":"21913875","name":"AppZapper ","data":"(15-Апр-20)"},{"id":"15343490","name":"typouser ","data":"(07-Апр-20)"},{"id":"32275243","name":"rimci ","data":"(28-Дек-19)"},{"id":"15522530","name":"lexaw ","data":"(23-Дек-19)"},{"id":"18813235","name":"Taschunya ","data":"(26-Ноя-19)"},{"id":"24707450","name":"kazadm2011 ","data":"(02-Окт-19)"},{"id":"11304686","name":"WildCat_by ","data":"(02-Сен-19)"},{"id":"19050404","name":"pippopalla ","data":"(01-Авг-19)"},{"id":"10577117","name":"cccp_vs ","data":"(02-Июл-19)"},{"id":"35613314","name":"dithy ","data":"(09-Апр-19)"},{"id":"19357501","name":"_B1aD3_ ","data":"(08-Апр-19)"},{"id":"18432282","name":"murwiz ","data":"(21-Фев-19)"},{"id":"30500607","name":"salenika ","data":"(29-Янв-19)"},{"id":"13401837","name":"deneb25 ","data":"(18-Янв-19)"},{"id":"35882239","name":"Rim Po ","data":"(03-Ноя-18)"},{"id":"42445531","name":"Kolesnikoff92 ","data":"(01-Ноя-18)"},{"id":"27216167","name":"insomnesia ","data":"(07-Окт-18)"},{"id":"27666892","name":"Rinat_2009 ","data":"(05-Сен-18)"},{"id":"40132972","name":"ПраПрапорщик ","data":"(03-Июн-18)"},{"id":"28957022","name":"шерстоклаус ","data":"(01-Июн-18)"},{"id":"8014165","name":"er540 ","data":"(31-Май-18)"}]}