{"link":"3875066","name":"Updated: Oracle Cloud Control 13c Release 3 (Linux x64, Solaris x64/Sparc, AIX, Windows x86-64,HP-UX-IA64)","date":"25-Дек-11 17:53","author":"lucif1234","description":"\nOracle Cloud Control 13c Release 3 (Linux x86/x64, Solaris x64/Sparc, AIX, Windows x86_64, HP-UX IA64)Update 13:\nРаздача обновлена до Oracle Cloud Control 13c Release 3Год выпуска: 2018\nВерсия: 13.3.0.0\nРазработчик: Oracle Corporation\nПлатформа: Linux /x64, Solaris x64/Sparc, AIX, Windows x86_64, HP-UX IA64\nСовместимость с Vista: неизвестно\nСистемные требования: RAM: 16GB минимум (рекомендуется 32Gb)\nHDD: 50Gb минимум (при полной установке потребуется 200Gb!)Для работы Oracle Cloud Control необходима предварительно установленная СУБД Oracle Database 12.2 (в эту раздачу она не входит!)Язык интерфейса: только английский\nТаблэтка: Не требуетсяГотовая виртуальная машина VBox с установленным ПО: Oracle Enterprise Manager Cloud Control 13c R1 (13.1.0.0) - Образ VBoxОписание: Oracle Enterprise Manager 12c - первое в отрасли решение, которое сочетает в себе управление полным технологическим комплексом Oracle с управлением полным жизненным циклом облака предприятия.С помощью Oracle Enterprise Manager Cloud Control, новой централизованной управляющей консоли, Oracle Enterprise Manager 12c объединяет уникальные возможности для управления всем жизненным циклом облака. Среди ключевых новых возможностей: консолидация и планирование использования ресурсов, самообслуживание, тестирование, мониторинг, а также учет и биллинг. Эта версия Oracle Enterprise Manager предоставляет интегрированные возможности управления полным технологическим стеком - \"от приложений до дисковых массивов\" (application-to-disk) - для приложений Oracle Fusion Applications и оптимизированных программно-аппаратных комплексов Oracle, а также новые возможности на Oracle VM 3.0 для управления виртуализованными и облачными ресурсами, расширенные ресурсы партнеров, доступные через сеть Oracle PartnerNetwork и инструменты управления для ИТ-компонентов других поставщиков.Oracle Enterprise Manager 12c является первым продуктом портфолио Oracle с номером версии \"12c\", где буквенный индекс \"c\" отражает значительные инвестиции Oracle в разработку и поставку продуктов, готовых к применению в средах облачных вычислений.Полное, унифицированное управление ресурсами облачных вычислений через единую консольOracle Enterprise Manager Cloud Control является единственной консолью Oracle для управления облаками, которая позволяет всем заинтересованным сторонам создавать функционально-насыщенные бизнес-сервисы, состоящие из любой комбинации облачных моделей: IaaS (Infrastructure as a Service; инфраструктура как сервис), PaaS (Platform as a Service; платформа как сервис) - включая DBaaS (Database as a Service; база данных как сервис) и MWaaS (Middleware as a Service; связующее ПО как сервис) - и SaaS (Software as a Service; программное обеспечение как сервис).\"Благодаря Oracle Enterprise Manager мы можем централизованно управлять 55 приложениями, поддерживающими нашу корпоративную программу \"End-to-End Connected Cloud Services\", которая, в итоге, позволяет улучшить потребительский опыт наших клиентов. Нас вдохновляет новая версия Oracle Enterprise Manager 12c, и мы с нетерпением ожидаем возможности использовать новые преимущества, которые она предоставляет, на практике\", - сообщил Клиффорд Мусанте (Clifford Musante), главный архитектор бизнес-инфраструктуры в компании Intuit Inc.Oracle Enterprise Manager Cloud Control предоставляет управляемые программами-мастерами (wizards) и основанные на ролях функциональные возможности для всех сторон, участвующих в планировании, развертывании, управлении и использовании корпоративных ресурсов облачных вычислений.Oracle Enterprise Manager 12c поддерживает корпоративных пользователей самых разных категорий: системных архитекторов, администраторов облака, разработчиков и администраторов приложений, администраторов баз данных и бизнес-пользователей (включая финансовых руководителей и высший менеджмент). Среди ключевых возможностей: Инструменты планирования ресурсов облачных вычислений - позволяют архитекторам и администраторам облака моделировать среды облачных вычислений с целью оптимизировать утилизацию ресурсов. Важнейшей функцией является планировщик консолидации и использования ресурсов, который упрощает перевод сервисов в облако с помощью рекомендаций и автоматизированных рабочих процессов.\nАвтоматическая установка пулов и системных ресурсов совместного пользования - позволяет администраторам облака объединять ИТ-ресурсы и устанавливать правила, привилегии и политики, которые регламентируют использование ресурсов; помогает гарантировать простоту управления и требуемое качество обслуживания.\nВстроенные функции самообслуживания - обеспечивают прозрачный доступ к ресурсам облачных вычислений для бизнес-пользователей и разработчиков приложений. Потребители ресурсов могут использовать портал самообслуживания для заказа сервисов из центрального каталога, для управления и мониторинга заказанных сервисов, а также для получения информации о платежах за пользование сервисами.\nПолный набор функций для учета и биллинга - позволяет сотрудникам финансовых отделов, руководителям ИТ-служб и поставщикам услуг вести учет использования сервисов и выставлять счета за их использование. Предлагается несколько различных механизмов биллинга. Преднастроенная интеграция с Oracle Communications Billing and Revenue Management обеспечивает исчерпывающие возможности биллинга телекоммуникационных услуг.Возможности облачных вычислений предоставляют уникальные в отрасли преимущества благодаря интеграции с двумя ключевыми продуктами Oracle: Oracle VM 3.0 - позволяет администраторам планировать и разворачивать среды облачных вычислений, содержащие виртуальные машины, пулы и зоны ресурсов.\nOracle Virtual Assembly Builder - помогает разработчикам приложений моделировать и упаковывать сложные многоуровневые приложения для самостоятельного развертывания.Oracle Enterprise Manager 12c позволяет управлять ресурсами облачных вычислений в физических и виртуальных средах как для архитектур x86, так и для архитектур SPARC.Разработано для технологий OracleOracle Enterprise Manager 12c продолжает обеспечивать непревзойденные возможности автоматизации для технологий Oracle. Среди ключевых особенностей: Полный набор средств управления приложениями Oracle Fusion Applications - спроектированная параллельно с приложениями Oracle Fusion Applications, новая версия Oracle Enterprise Manager предоставляет непревзойденные возможности, которые помогают обеспечивать работоспособное состояние и высокий уровень готовности этих приложений.\nМгновенная доступность для поддержки в рамках программы Oracle Applications Unlimited - сертифицированы системы управления Oracle JD Edwards EnterpriseOne и Oracle Siebel CRM. Дополнительная сертификация приложений запланирована на календарный 2012 год.\nРасширенное управление связующими технологиями Oracle Fusion Middleware - добавлены новые возможности самоуправления, такие как анализ первопричин сбоев (root-cause analysis) и упреждающие рекомендации. Эти нововведения упрощают управление и помогают ИТ-администраторам управлять большим числом приложений.\nУлучшенные функции самоуправления для баз данных - предоставляют администраторам баз данных такие возможности, как автоматический диагностический мониторинг баз данных в режиме реального времени и сравнение данных мониторинга за определенные временные периоды, а также аналитические возможности для Active Session History (ASH).\nУсовершенствованные решения для управления качеством - новая функциональность Application Replay позволяет осуществлять тестирование приложений на реальных рабочих нагрузках, обеспечивая более реалистичное тестирование. Новые возможности выявления данных, моделирования и \"разбиения\" данных на блоки оптимизируют управление тестовыми данными. Сочетание этих характеристик помогает повысить качество приложений с минимальными усилиями.\nТесная интеграция с оптимизированными программно-аппаратными комплексами Oracle - обеспечивает интегрированное представление об аппаратных средствах и программном обеспечении для Oracle Exadata Database Machine и Oracle Exalogic Elastic Cloud в целях упрощения управления и достижения более высоких уровней производительности и доступности.Дополнительные ресурсы Oracle Enterprise Manager 12c\nДокументация: Oracle Enterprise Manager Cloud Control Documentation 12c Release 5\n\nСкриншоты\n\n\n\n\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:5B63B9DF42BB3D7921233D240A7F1AB4C840682D&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=Updated%3A%20Oracle%20Cloud%20Control%2013c%20Release%203%20(Linux%20x64%2C%20Solaris%20x64%2FSparc%2C%20AIX%2C%20Windows%20x86-64%2CHP-UX-IA64)","torrent_link":"dl.php?t=3875066","thanked_list":[{"id":"13325960","name":"lazoriks ","data":"(14-Мар-22)"},{"id":"24489333","name":"LantsovSV ","data":"(25-Окт-21)"},{"id":"14648647","name":"akura13 ","data":"(13-Ноя-20)"},{"id":"21568816","name":"Andrey_Green ","data":"(30-Окт-19)"},{"id":"25850060","name":"bodan229 ","data":"(12-Авг-19)"},{"id":"42479895","name":"OnceUponADime ","data":"(16-Фев-19)"},{"id":"17627524","name":"12345shatoon ","data":"(02-Фев-19)"},{"id":"30358819","name":"arrybaka22 ","data":"(22-Апр-18)"},{"id":"19302215","name":"AskDenisko ","data":"(11-Апр-18)"},{"id":"42918466","name":"japa_tu80 ","data":"(09-Янв-18)"},{"id":"21185432","name":"sergey_solaris ","data":"(13-Авг-17)"},{"id":"7917623","name":"Joker_CH ","data":"(27-Фев-17)"},{"id":"6165390","name":"Александр_321 ","data":"(08-Окт-16)"},{"id":"35709081","name":"олуп рока ","data":"(07-Окт-16)"},{"id":"14072816","name":"IgorKiev ","data":"(12-Июн-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"16951316","name":"veselovaluba ","data":"(23-Апр-16)"},{"id":"6384051","name":"sapadm1 ","data":"(27-Мар-16)"},{"id":"41183241","name":"SpatialBand ","data":"(18-Мар-16)"},{"id":"31330070","name":"exec_vn ","data":"(17-Фев-16)"},{"id":"34563838","name":"Bogdan724 ","data":"(27-Янв-16)"},{"id":"22247706","name":"panther13 ","data":"(24-Ноя-15)"},{"id":"34597837","name":"saadna123 ","data":"(24-Окт-15)"},{"id":"15139396","name":"nave_vlad ","data":"(17-Сен-15)"},{"id":"31524913","name":"WaD1m999 ","data":"(24-Авг-15)"},{"id":"8953075","name":"lzz ","data":"(06-Июн-15)"},{"id":"13110511","name":"DimonCrimea ","data":"(09-Май-15)"},{"id":"0","name":"Гость","data":"(22-Янв-15)"},{"id":"22232980","name":"jcayab ","data":"(05-Авг-14)"},{"id":"17541107","name":"devildg ","data":"(02-Июл-14)"},{"id":"13625","name":"Tiger_ ","data":"(06-Июн-14)"},{"id":"21138918","name":"uncleroot ","data":"(04-Июн-14)"},{"id":"19499386","name":"istigatore ","data":"(03-Июн-14)"},{"id":"24333226","name":"StoryBanter ","data":"(19-Май-14)"},{"id":"35685542","name":"oksch ","data":"(15-Май-14)"},{"id":"20241738","name":"Shizicc ","data":"(25-Апр-14)"},{"id":"10568441","name":"avk5 ","data":"(25-Апр-14)"},{"id":"16445396","name":"alix1961 ","data":"(13-Мар-14)"},{"id":"18703346","name":"julkaz ","data":"(14-Янв-14)"},{"id":"33851277","name":"alexey_laputin ","data":"(06-Дек-13)"},{"id":"10480195","name":"Vo1983 ","data":"(24-Окт-13)"},{"id":"18684049","name":"Ivan75591 ","data":"(13-Окт-13)"},{"id":"1202378","name":"narasq ","data":"(26-Сен-13)"},{"id":"6400021","name":"be34you ","data":"(22-Сен-13)"},{"id":"16862962","name":"rewalex ","data":"(07-Сен-13)"},{"id":"5440776","name":"XpeH-B-Hopke ","data":"(27-Авг-13)"},{"id":"0","name":"Гость","data":"(05-Авг-13)"},{"id":"22516058","name":"AndreyRimma ","data":"(08-Июл-13)"},{"id":"11058289","name":"sobra29 ","data":"(15-Июн-13)"},{"id":"17985727","name":"hgrmgrgr ","data":"(01-Июн-13)"},{"id":"0","name":"Гость","data":"(25-Дек-11)"}]}