{"link":"4386591","name":"SQLite Expert Professional 3.4.53 2281 x86 x64 [2013, ENG]","date":"21-Мар-13 23:29","author":"TNTalex","description":"\nSQLite Expert ProfessionalГод/Дата Выпуска: 2013.03.20\nВерсия: 3.4.53 Build 2281\nРазработчик: Bogdan Ureche\nСайт разработчика: www.sqliteexpert.comРазрядность: 32bit, 64bit\nЯзык интерфейса: Английский\nТаблэтка: Присутствует\nСистемные требования: Windows 2000, XP, Vista, 7\nОписание: SQLite Expert — встраиваемый движок баз данных. В 2005 году проект был награждён наградой Google-O’Reilly Open Source Awards. Слово «встраиваемый» означает, что SQLite не использует парадигму клиент-сервер, то есть движок SQLite не является отдельно работающим процессом, с которым взаимодействует программа, а предоставляет библиотеку, с которой программа компонуется и движок становится составной частью программы. Таким образом, в качестве протокола обмена используются вызовы функций (API) библиотеки SQLite.\nНесколько процессов или потоков могут одновременно без каких-либо проблем читать данные из одной базы. Запись в базу можно осуществить только в том случае, если никаких других запросов в данный момент не обслуживается, в противном случае попытка записи оканчивается неудачей, и в программу возвращается код ошибки (другим вариантом развития событий является автоматическое повторение попыток записи в течение заданного интервала времени).\n\nДоп. информация\nMarch 20, 2013: Version 3.4.53. build 2281 SQLite library version 3.7.16 is now included.\nFixed bug in refreshing database properties.March 17, 2013: Version 3.4.52. build 2280 Fixed word wraping bug causing the program to hang at startup.February 24, 2013: Version 3.4.51. build 2279 Fixed incorrect word wrapping in SQL editor when max line width exceeds 255 characters.February 10, 2013: Version 3.4.50. build 2278 Fixed a bug handling default values.January 30, 2013: Version 3.4.49. build 2277 Fixed a bug in parsing primary key.January 16, 2013: Version 3.4.48. build 2275 Fixed bug in applying SQL editor font color when using themes.\nUpdated SQLite library to 3.7.15.2.December 7, 2012: Version 3.4.47. build 2269 Minor user interface improvements.December 4, 2012: Version 3.4.46. build 2268 SQLite library is now compiled with SQLITE_ENABLE_FTS4_UNICODE61.November 30, 2012: Version 3.4.45. build 2267 Pragma 'default_cache_size' is no longer used.November 30, 2012: Version 3.4.44. build 2266 Fixed 'database is locked' error when refreshing database properties while using exclusive locking.November 28, 2012: Version 3.4.43. build 2265 Updated pragma list on database tab.November 26, 2012: Version 3.4.42. build 2264 Fixed error parsing primary key conflict clause.November 25, 2012: Version 3.4.41. build 2263 Fixed encoding issue when importing data from text files.November 23, 2012: Version 3.4.40. build 2262 Fixed another bug in handling null values when importing data from CSV files.\nFixed scrolling issue on schema compare form.November 19, 2012: Version 3.4.39. build 2261 Fixed bug in handling null values when importing data from CSV files.November 19, 2012: Version 3.4.38. build 2260 Fixed bug in handling null datetime values when pasting data from clipboard.November 13, 2012: Version 3.4.37. build 2259 Query Builder layout is no longer cleared when an error occurs during SQL generation.November 5, 2012: Version 3.4.36. build 2258 Fixed encoding issue when copying data to clipboard.October 30, 2012: Version 3.4.35. build 2257 Fixed bug in character encoding detection when pasting data from Excel.October 15, 2012: Version 3.4.34. build 2256 Fixed startup error on Windows 2000.October 7, 2012: Version 3.4.33. build 2255 SQLite library 3.7.14.1 included.September 26, 2012: Version 3.4.32. build 2254 Fixed encoding issue when copying data to clipboard.September 19, 2012: Version 3.4.31. build 2253 Fixed bug in importing text files when the destination table name needs quoting.September 18, 2012: Version 3.4.30. build 2252 Fixed bug in character encoding detection when loading text files.September 17, 2012: Version 3.4.29. build 2251 Fixed an error in internal SQL parser.September 16, 2012: Version 3.4.28. build 2250 Improved character encoding detection when loading text files with missing BOM.September 12, 2012: Version 3.4.27. build 2249 A warning is now displayed if the maximum cell length has been exceeded when exporting to Excel.September 8, 2012: Version 3.4.26. build 2248 Data transfer operations now handle circular foreign key references correctly.\nSQLite library 3.7.14 included.August 26, 2012: Version 3.4.25. build 2247 Fixed bug in ordering objects by dependencies when exporting to SQL script.August 19, 2012: Version 3.4.24. build 2246 Improved the timing of queries having unbound parameters.August 14, 2012: Version 3.4.23. build 2245 Fixed a bug in foreign key parsing.August 9, 2012: Version 3.4.22. build 2244 Minor DATE/DATETIME fixes.July 26, 2012: Version 3.4.21. build 2243 Fixed bug in filtering DATE/DATETIME fields.July 14, 2012: Version 3.4.20. build 2242 Fixed bug preventing the editing of long lines in SQL editor.June 30, 2012: Version 3.4.19. build 2241 Fixed skin support on the main toolbar.June 29, 2012: Version 3.4.18. build 2240 Added Ctrl+Enter shortcut for record editor.June 15, 2012: Version 3.4.17. build 2229 Added 'Show characters' option to encryption key dialog.\nConfirmation is no longer required when entering default encryption key.June 15, 2012: Version 3.4.16. build 2228 SQLite library 3.7.13 included.\nFixed a bug filtering on a field matching a SQL keyword.June 3, 2012: Version 3.4.15. build 2225 Fixed a bug in processing error messages.May 28, 2012: Version 3.4.14. build 2224 Fixed an error in time display introduced in 3.4.13.May 26, 2012: Version 3.4.13. build 2223 SQLite library 3.7.12.1 included.\nEnhanced data grids to handle ISO-8601 date and time formats.May 14, 2012: Version 3.4.12. build 2221 SQLite library 3.7.12 included.May 8, 2012: Version 3.4.11. build 2220 Fixed bug in generating SQL statements to clipboard.May 5, 2012: Version 3.4.10. build 2219 Fixed bug in Query Builder causing the generation of invalid queries when using attached databases.April 11, 2012: Version 3.4.9. build 2218 Improved performance when opening tables with large text values when 'Cell auto height' option is selected.April 5, 2012: Version 3.4.8. build 2217 Fixed data conversion error when importing from ADO data source.April 3, 2012: Version 3.4.7. build 2216 Fixed integer overflow when importing from ADO data source.March 30, 2012: Version 3.4.6. build 2215 Improved error messages returned by SQLite Expert.March 29, 2012: Version 3.4.5. build 2214 For performance reasons, blobs are no longer loaded in memory if the 'Show images' option is not selected.March 20, 2012: Version 3.4.4. build 2213 Updated SQLite library to 3.7.11.March 10, 2012: Version 3.4.3. build 2212 Fixed a startup error when running on Linux with the Wine compatibility layer.February 29, 2012: Version 3.4.2. build 2211 Fixed a bug in updating the tab visibility.February 23, 2012: Version 3.4.1. build 2210 Fixed a bug in refreshing Query Builder.February 17, 2012: Version 3.4.0. build 2208 Updated some third party components.January 14, 2012: Version 3.3.55. build 2206 Fixed an issue in restructuring tables having default values.January 4, 2012: Version 3.3.54. build 2205 Fixed issue with F3 shortcut key in search/replace dialog.January 3, 2012: Version 3.3.53. build 2204 Fixed case sensitivity issue in search/replace dialog.November 3, 2011: Version 3.3.52. build 2203 Modified error reporting options to include only basic debug information.November 2, 2011: Version 3.3.51. build 2202 Fixed bug causing the locking of the database file after an unsuccessful attempt to open an encrypted database.November 1, 2011: Version 3.3.50. build 2201 Fixed text clipping issues in data transfer wizard when using large fonts.\nFixed bug in grid filter on GUID fields.\nSQLite library 3.7.9 included.October 26, 2011: Version 3.3.49. build 2200 Minor user experience improvements.\nLicense upgrade tool no longer included.October 25, 2011: Version 3.3.48. build 2199 Fixed a bug in retrieving the SQLite error message.October 19, 2011: Version 3.3.47. build 2198 Fixed bug in exporting GUID values to CSV.October 15, 2011: Version 3.3.46. build 2196 Checking for updates now allows downloading and installing new version from within the program.October 14, 2011: Version 3.3.45. build 2195 Fixed incorrect ordering on Database tab.October 9, 2011: Version 3.3.44. build 2194 Fixed bug on extensions tab - functions and collations displayed for the wrong extension.September 24, 2011: Version 3.3.43. build 2193 SQLite library 3.7.8 included.September 22, 2011: Version 3.3.42. build 2192 DOCID is now preserved when restructuring virtual table.September 21, 2011: Version 3.3.41. build 2190 Fixed flickering issue when hovering the mouse over buttons.September 11, 2011: Version 3.3.40. build 2189 Fixed a bug in parsing CREATE TRIGGER statements.September 8, 2011: Version 3.3.39. build 2188 Further optimizations when copying data to clipboard.September 7, 2011: Version 3.3.38. build 2186 Fixed performance issues when copying and pasting data via the clipboard.\nWhen exporting to SQL script, triggers are now created after all the tables and views have been created.\nFixed resizing issues on some forms.September 5, 2011: Version 3.3.37. build 2185 File associations are now saved in the current user settings so they no longer require admin privileges.August 26, 2011: Version 3.3.36. build 2179 Fixed error in getting SQLite driver capabilities in the Options dialog.August 22, 2011: Version 3.3.35. build 2178 Minor UI fixes.August 14, 2011: Version 3.3.34. build 2175 Fixed bug in field type auto-detection when importing from CSV files.August 7, 2011: Version 3.3.33. build 2174 Minor internal fixes.August 2, 2011: Version 3.3.32. build 2173 Minor bug fixes.July 28, 2011: Version 3.3.31. build 2169 Fixed a performance issue when refreshing schema.July 13, 2011: Version 3.3.30. build 2166 Updated help file.June 28, 2011: Version 3.3.29. build 2159 SQLite library 3.7.7.1 included.\nSQLite library is now compiled with SQLITE_SOUNDEX enabled.\nLast open file is now remembered in open/save dialogs.June 5, 2011: Version 3.3.28. build 2158 Minor bug fixes.May 20, 2011: Version 3.3.27. build 2157 SQLite library 3.7.6.3 is now included.May 10, 2011: Version 3.3.26. build 2156 Fixed bug causing incorrect order of fields in an index.May 10, 2011: Version 3.3.25. build 2155 Fixed startup error message when using external library.\nFixed \"table not found\" error when creating an index on a new table.May 8, 2011: Version 3.3.24. build 2154 The 'move up' and 'move down' buttons now work with multiple selected records on the field designer.May 7, 2011: Version 3.3.23. build 2153 Fixed bug in index editor.April 29, 2011: Version 3.3.22. build 2152 Improved JPEG image format detection.April 24, 2011: Version 3.3.21. build 2151 The record counts are now calculated using separate connections to the database.April 21, 2011: Version 3.3.20. build 2150 The record count feature is now optional.April 21, 2011: Version 3.3.19. build 2149 The record count feature is now disabled to prevent performance issues on large databases. It will be made optional in the next version.April 18, 2011: Version 3.3.18. build 2148 Removed redundant record count calculations to improve performance.\nAdded error message when attempting to perform a database backup if the selected SQLite library does not support the online backup API.April 18, 2011: Version 3.3.18. build 2148 Fixed incorrect dependency order when exporting database to script.\nFixed error in parsing triggers containing CASE statements.April 17, 2011: Version 3.3.17. build 2147 SQLite library 3.7.6.2 is now included.April 17, 2011: Version 3.3.16. build 2146 Fixed field not found error when primary key field contains blank characters.April 16, 2011: Version 3.3.15. build 2145 Record count is now always displayed for all tables and views.\nSQLite library 3.7.6.1 is now included.April 15, 2011: Version 3.3.14. build 2144 Fixed AV after opening and canceling the Options window.April 13, 2011: Version 3.3.13. build 2143 Fixed error in refreshing schema after deleting an object.April 13, 2011: Version 3.3.12. build 2142 Fixed error in sorting objects by dependencies when exporting data.\nFixed error in generating SQL for tables having foreign keys.April 12, 2011: Version 3.3.11. build 2141 SQLite library 3.7.6 is now included.April 11, 2011: Version 3.3.10. build 2140 Fixed program startup error when using auto-extensions.April 10, 2011: Version 3.3.9. build 2139 Added support for the ICU extension.April 7, 2011: Version 3.3.8. build 2138 Fixed bug in refreshing data when being displayed in text mode.April 5, 2011: Version 3.3.7. build 2137 Fixed bug in importing null values from CSV files.April 4, 2011: Version 3.3.6. build 2136 Added database online backup option.April 1, 2011: Version 3.3.5. build 2135 Minor bug fixes.March 30, 2011: Version 3.3.4. build 2134 Minor bug fixes.March 27, 2011: Version 3.3.3. build 2133 Added database DDL compare tool.March 20, 2011: Version 3.3.2. build 2132 Added options \"Auto cell height\" and \"Show cell hints\" to main menu.March 18, 2011: Version 3.3.1. build 2131 Added support for RTREE virtual tables.March 17, 2011: Version 3.3.0. build 2130 Added support for virtual tables including FTS3 and FTS4.\nAdded progress bar, cancel button and improved performance when generating random data.March 10, 2011: Version 3.2.22. build 2122 Added option \"Execute SQL (current statement)\".March 5, 2011: Version 3.2.21. build 2121 Fixed a bug in refreshing schema.February 25, 2011: Version 3.2.20. build 2120 Fixed a bug in the internal parser.February 19, 2011: Version 3.2.19. build 2119 Improved tabbed navigation on the record editor.February 15, 2011: Version 3.2.18. build 2118 Modified internal handling of blob fields for accurate display in the Hex editor regardless of the storage class.February 14, 2011: Version 3.2.17. build 2117 Fixed bug introduced in previous version preventing the usage of external SQLite libraries.February 13, 2011: Version 3.2.16. build 2116 Added support for changing the field sort order in the index editor.February 6, 2011: Version 3.2.15. build 2115 Fixed datetime display error occurring for date values above year 2100.February 5, 2011: Version 3.2.14. build 2114 SQLite library version 3.7.5 included.\nFixed a few UI annoyances.February 1, 2011: Version 3.2.13. build 2113 Fixed a registry error when reading file associations.January 20, 2011: Version 3.2.12. build 2112 Fixed error in copy/paste records on systems with decimal separator different than \".\".January 18, 2011: Version 3.2.11. build 2111 Fixed incorrect application title in Professional Edition.January 7, 2011: Version 3.2.10. build 2110 Upgraded external SQLite library to 3.7.4.January 7, 2011: Version 3.2.9. build 2109 Minor UI fixes.January 4, 2011: Version 3.2.8. build 2108 Added associated extensions to the list of file extensions in the open database dialogs.December 16, 2010: Version 3.2.7. build 2107 Performance improvements for datasets with a large number of columns.December 16, 2010: Version 3.2.6. build 2106 SQLite library version 3.7.4 is now included.\nAdded option to set a default encryption key.\nMinor internal fixes.November 15, 2010: Version 3.2.5. build 2105 Improved image format detection for images displayed in the grid.November 14, 2010: Version 3.2.4. build 2104 Grid selection is now cleared after sorting by a column.November 13, 2010: Version 3.2.3. build 2103 Fixed cell auto height not using the current setting on a new SQL tab.November 11, 2010: Version 3.2.2. build 2102 Minor corrections to the Pascal script engine.November 5, 2010: Version 3.2.1. build 2101 Added \"Close other SQL tabs\" menu item.\nUpdated sample scripts to work with version 3.\nFixed an error in Lua script output.\nFixed a database locking error.October 28, 2010: Version 3.2.0. build 2100 Added database repair function.\nAdded pragmas automatic_index and wal_autocheckpoint.\nFixed error updating data after modifying in Hex editor.October 18, 2010: Version 3.1.23. build 2099 Fixed error in local time calculation when using the internal SQLite library.October 10, 2010: Version 3.1.22. build 2098 Added rowid to the parent key drop-down list in the foreign key editor.October 8, 2010: Version 3.1.21. build 2097 SQLite library version 3.7.3 included.October 7, 2010: Version 3.1.20. build 2096 Fixed bug in import from a text file with encoding set to \"Default ANSI code page\" on multi byte character sets.October 6, 2010: Version 3.1.19. build 2095 Fixed error in refreshing non-integer primary key for tables having unique constraints\".October 5, 2010: Version 3.1.18. build 2094 Fixed bug in import from a text file with encoding set to \"Default ANSI code page\".October 1, 2010: Version 3.1.17. build 2093 Fixed error in local time calculation when using the internal SQLite library.September 30, 2010: Version 3.1.16. build 2092 Fixed SQLite library not restored at application startup.September 28, 2010: Version 3.1.15. build 2091 Fixed bug in restoring SQL history at application startup.September 25, 2010: Version 3.1.14. build 2090 Implemented some schema refresh optimizations.September 24, 2010: Version 3.1.13. build 2089 Fixed error in local time calculation when using the internal SQLite library.September 17, 2010: Version 3.1.12. build 2088 Added tab width option.\nAdded keyboard shortcut (CTRL+/) for commenting/uncommenting selected text in SQL and script editors.September 11, 2010: Version 3.1.11. build 2087 Replaced System.Data.SQLite with a custom built SQLite library with compatible encryption that does not require .NET.\nStatically linked SQLite library now supports encryption.September 9, 2010: Version 3.1.10. build 2086 Fixed incorrect restoring of SQL queries containing double quotes at program startup.September 1, 2010: Version 3.1.9. build 2085 Added word-wrap option for SQL editors.September 1, 2010: Version 3.1.8. build 2084 Fixed child fields not being renamed when renaming field in tables with multiple foreign keys.August 31, 2010: Version 3.1.7. build 2083 Fixed tab character not expanded in the grid and in the tooltip windows.August 28, 2010: Version 3.1.6. build 2082 Fixed current record number not being displayed except the first SQL tab.\nFixed conversion error when applying a filter on a field containing null records.August 23, 2010: Version 3.1.5. build 2081 SQLite library 3.7.2 included.August 23, 2010: Version 3.1.4. build 2080 Fixed navigator buttons not working on the SQL tabs.August 23, 2010: Version 3.1.3. build 2079 Fixed record number not showing on the SQL grids.August 22, 2010: Version 3.1.2. build 2078 SQLite library 3.7.1 included.August 22, 2010: Version 3.1.1. build 2077 SQL Builder now generates queries in a new SQL tab to preserve existing queries.\n\n\nСкриншоты\n\n\n\n\nСкриншоты окна About\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:6EECC563EC5C106B9922ED652FE1247ACB2A8EEF&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=SQLite%20Expert%20Professional%203.4.53%202281%20x86%20x64%20%5B2013%2C%20ENG%5D","torrent_link":"dl.php?t=4386591","thanked_list":[{"id":"21098326","name":"kexogen2 ","data":"(07-Окт-21)"},{"id":"45883696","name":"BT_Rover ","data":"(29-Сен-21)"},{"id":"34958883","name":"iv162382 ","data":"(26-Окт-19)"},{"id":"27466161","name":"hjuma ","data":"(06-Янв-19)"},{"id":"1478588","name":"N_A ","data":"(02-Янв-19)"},{"id":"14343524","name":"demographus ","data":"(26-Сен-18)"},{"id":"38871723","name":"JestemJestem ","data":"(12-Июн-18)"},{"id":"17681307","name":"corvin-nik ","data":"(09-Ноя-17)"},{"id":"17211741","name":"pi05aip ","data":"(26-Июн-17)"},{"id":"15698470","name":"gorelli ","data":"(03-Май-17)"},{"id":"26085935","name":"andy_777 ","data":"(15-Фев-17)"},{"id":"24500635","name":"vovik-1991 ","data":"(27-Ноя-16)"},{"id":"12896510","name":"yakhin-s ","data":"(14-Ноя-16)"},{"id":"19306450","name":"matlash ","data":"(28-Сен-16)"},{"id":"38484237","name":"Sydney26 ","data":"(26-Авг-16)"},{"id":"25431683","name":"gpkuklin ","data":"(05-Июл-16)"},{"id":"7976852","name":"cloudsnake ","data":"(28-Май-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"35882239","name":"Rim Po ","data":"(24-Апр-16)"},{"id":"24653968","name":"ivankra ","data":"(16-Ноя-15)"},{"id":"24286334","name":"asbul-yroslav ","data":"(30-Окт-15)"},{"id":"10378066","name":"Sfairatx ","data":"(15-Окт-15)"},{"id":"6370678","name":"Ddeny ","data":"(20-Сен-15)"},{"id":"7472989","name":"sewa_abaper ","data":"(03-Сен-15)"},{"id":"30030385","name":"Хедгамахог ","data":"(28-Авг-15)"},{"id":"20709178","name":"exDifin ","data":"(16-Июл-15)"},{"id":"3369502","name":"00kpekep00 ","data":"(05-Июл-15)"},{"id":"13964257","name":"GALA026 ","data":"(24-Июн-15)"},{"id":"17130233","name":"drakelord ","data":"(17-Май-15)"},{"id":"0","name":"Гость","data":"(12-Май-15)"},{"id":"579750","name":"nkvd2 ","data":"(05-Май-15)"},{"id":"18660","name":"grandiosa ","data":"(28-Апр-15)"},{"id":"18390678","name":"nina8891 ","data":"(27-Апр-15)"},{"id":"7104464","name":"Vo4er ","data":"(24-Апр-15)"},{"id":"24312163","name":"nazar-2012 ","data":"(12-Апр-15)"},{"id":"22693443","name":"dzikar ","data":"(10-Апр-15)"},{"id":"15334372","name":"byWanted ","data":"(03-Апр-15)"},{"id":"14237248","name":"PerunBT14 ","data":"(01-Апр-15)"},{"id":"15737066","name":"Embiqo ","data":"(30-Мар-15)"},{"id":"21407962","name":"kero1 ","data":"(20-Мар-15)"},{"id":"10836439","name":"melange.mipt ","data":"(16-Мар-15)"},{"id":"13906093","name":"geotronic ","data":"(13-Мар-15)"},{"id":"20352342","name":"Rogers1981 ","data":"(12-Мар-15)"},{"id":"14033355","name":"Axi77 ","data":"(10-Мар-15)"},{"id":"23409534","name":"meetgin ","data":"(10-Мар-15)"},{"id":"30304462","name":"Sbaffo ","data":"(09-Мар-15)"},{"id":"10375111","name":"ElBandy ","data":"(06-Мар-15)"},{"id":"16370282","name":"Marvin2003 ","data":"(23-Фев-15)"},{"id":"16153732","name":"W.ReD ","data":"(07-Фев-15)"},{"id":"23950210","name":"pereproga ","data":"(06-Фев-15)"},{"id":"16057773","name":"Enforcer1976 ","data":"(05-Фев-15)"},{"id":"24260486","name":"Genzo_4 ","data":"(04-Фев-15)"},{"id":"4387710","name":"sachalin ","data":"(01-Фев-15)"},{"id":"11719165","name":"eko1og ","data":"(27-Янв-15)"}]}