{"link":"4522090","name":"Brilliant Database v10.31 Professional / Ultimate [2013,Ml\\Rus]","date":"29-Авг-13 16:27","author":"VlsVl","description":"\nBrilliant Database v10.31 Professional / Ultimate________________________________________________Год/Дата Выпуска: 2013\nВерсия: v10.31\nРазработчик: Copyright (C) 2001-2013 Binary Brilliant Inc. All Rights Reserved.Платформа:\nРазрядность: 32bit,64bit\nЯзык интерфейса: Мультиязычный (русский присутствует)\nТаблэтка: ПрисутствуетСистемные требования:\nGeneral Information\nTo work with Brilliant database you won\"t need to install additional database software or any special computers:\nOperational System: Windows 2000/NT/XP/Vista/7\nProcessor: 600Mhz\nRAM: 64 Mb\nHard Disk Space: 20 Mb\nNetworking\nBrilliant Database for simultaneous work of several users with one database uses the widespread TCP/IP protocol which allows:\nWorking in the local network;\nWorking in the Internet from anywhere in the world;\nUsing wireless technologies.\nIn Brilliant Database there is no difference between the server and the client version. Any edition of Brilliant Database can act as both the client and the server.All you need is several computers under Microsoft Windows connected to a network.Brilliant Database - Программное обеспечение для баз данных, которое позволяет создавать базы данных, не имея специальных знаний и навыков. Brilliant Database имеет дружественный интерфейс. Приложения используют интерфейс подобный Outlook Express, поэтому легко работать с формами, таблицами или листами. Программа полностью настраиваема. Все элементы интерфейса программного обеспечения баз данных могут быть изменены, включая горячие клавиши и иконки.____________________________Возможности:- Формы. 22 различных поля для работы с текстом, датами, формулами и изображениями\n- Отчетность. Создание отчетов с графикой, диаграммами, вычислениями и таблицами\n- Запросы. С визуальным редактором запросов нет необходимости изучать языки запросов\n- Математические формулы. Все математические вычисления в полях баз данных и отчетах полностью автоматизированы\n- Скрипты. С визуальным редактором сценариев вы можете автоматизировать работу с базами данных, без необходимости изучать языки программирования.\n\nДополнительно:\nBrilliant is a full-featured database software solution Brilliant Database is an out-of-the-box solution comprising all you need to create a database and work with it: an up-to-date engine, supporting databases up to 1.5 TByte and work via the network/internet, easy-to-use editors to create forms, reports, scripts, queries and so on, as well as a possibility to use a database of any structure.When working with the program, you will not need additional components - Brilliant Database has all you may require.Classic, but customizable Outlook Interface Neither you nor your users will experience any problems with the interface - we used a classic interface of Outlook. The tree of folders with your records on the left, a list of records in the selected folder at the top and the window for viewing the current record at the bottom.However, nothing can prevent you from changing a database if necessary - you can add a new field on the form, report, or automate some routine with a script - all editors are available at any time from the Designers menu.Work with Images, Formulas, Attachments Brilliant Database allows you to easily work with any data. If you store dates, you can enter them using a calendar; to work with pictures, you can use a possibility to get them directly from a scanner or a web camera and automatically scale them. For any record you can store an unlimited number of file attachments and links to other records.There are more than 20 fields available in the program; you can change the behaviour of any of them by means of scripts.Easy Networking Brilliant Database allows several users to work with the same database simultaneously. At that, users may work with a remote database in the same manner as with a usual one - all options of the program will be available to them, including adding and deleting files in the database and executing scripts.All users are divided into groups, for each of which it is possible to easily define access rights and neccessary tools.Automate workflow using scripts Automate routine operations using simple scripts that may be created by means of an easy-to-use visual editor - that is, there is no necessity to learn any computer language. Just select from the list of more than 40 actions the ones that you need.For example, when a form is changed, select to send an e-mail notification; when a button is pressed - select to create a new record; or make a backup copy every 20 minutes.Reports, E-mails, Ms Word Documents, Excel, Access, Web Using Visual Query Editor and Report Style Editor, create queries to a database and print any documents - reports, invoices, catalogues, business cards.Thanks to Custom Import and Custom Export tools, you can send e-mails, generate MS Word and Excel documents, web-pages, import data from Outlook and directly from web sites. For example, you can add to the program a possibility to automatically import currency rates or generate reports in the Excel format.\n\n\nЧто нового:\nNew v10.31 has been released. Full Windows 8 support. All known bugs are fixed.\n28 Aug 2013\n\n\nСравнение:\nhttp://www.brilliantdatabase.com/editions_wizard.html\n\n\nСкриншоты\n\n \n \n \n\n\n\nСкриншоты окна About\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:2A1037ADB214B7930AF65DFEB3A87B5513E0424E&tr=http%3A%2F%2Fbt2.t-ru.org%2Fann%3Fmagnet&dn=Brilliant%20Database%20v10.31%20Professional%20%2F%20Ultimate%20%5B2013%2CMl%5CRus%5D","torrent_link":"dl.php?t=4522090","thanked_list":[{"id":"44301685","name":"Docent763 ","data":"(18-Мар-22)"},{"id":"46962947","name":"Kurt Jansson ","data":"(15-Дек-21)"},{"id":"8072173","name":"xoneyu ","data":"(19-Авг-21)"},{"id":"17527340","name":"dilak ","data":"(12-Июн-19)"},{"id":"23503472","name":"RM2011 ","data":"(30-Апр-19)"},{"id":"6915367","name":"annihillator ","data":"(07-Дек-18)"},{"id":"17009540","name":"imobilka ","data":"(14-Мар-18)"},{"id":"18489655","name":"p0lym0rph ","data":"(26-Янв-18)"},{"id":"7177170","name":"zoyzich ","data":"(21-Дек-17)"},{"id":"8474395","name":"Zevakka ","data":"(15-Ноя-17)"},{"id":"15799007","name":"Val Spasov ","data":"(29-Май-17)"},{"id":"22940663","name":"LEGIONKZ666 ","data":"(12-Май-17)"},{"id":"5592807","name":"Yurka_VM ","data":"(06-Май-17)"},{"id":"215741","name":"Balrog ","data":"(15-Мар-17)"},{"id":"29338125","name":"АнгеликаДрозд ","data":"(29-Янв-17)"},{"id":"27953032","name":"Vitaly_PSh ","data":"(19-Янв-17)"},{"id":"14282423","name":"zhidra ","data":"(27-Ноя-16)"},{"id":"15839392","name":"t1mm ","data":"(17-Окт-16)"},{"id":"33234341","name":"softnfast ","data":"(01-Окт-16)"},{"id":"15252203","name":"eu_gene ","data":"(26-Сен-16)"},{"id":"1052069","name":"olegdv ","data":"(18-Авг-16)"},{"id":"23310090","name":"ironics ","data":"(04-Авг-16)"},{"id":"30813294","name":"aseev41 ","data":"(13-Май-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"18829461","name":"djuma_eduard ","data":"(20-Апр-16)"},{"id":"13312927","name":"baguvixmaks ","data":"(14-Мар-16)"},{"id":"25955509","name":"igor1972tlu ","data":"(15-Фев-16)"},{"id":"9723448","name":"Wurther ","data":"(08-Фев-16)"},{"id":"13599886","name":"skyworld06 ","data":"(17-Янв-16)"},{"id":"12556391","name":"dj_poppy ","data":"(11-Янв-16)"},{"id":"11659963","name":"Nebulaw ","data":"(10-Янв-16)"},{"id":"37735915","name":"Aidar898 ","data":"(12-Дек-15)"},{"id":"13221851","name":"Zerobarmen ","data":"(12-Ноя-15)"},{"id":"20401220","name":"Dok leo ","data":"(31-Окт-15)"},{"id":"18761534","name":"witiges ","data":"(31-Окт-15)"},{"id":"32128151","name":"oldoc83 ","data":"(29-Окт-15)"},{"id":"13302084","name":"alfa68 ","data":"(25-Окт-15)"},{"id":"13672933","name":"Arcadyv ","data":"(20-Окт-15)"},{"id":"24367743","name":"Nicolas-82 ","data":"(21-Авг-15)"},{"id":"32485860","name":"Oleg T. ","data":"(08-Авг-15)"},{"id":"29187489","name":"atomflashpoint ","data":"(08-Май-15)"},{"id":"12013041","name":"Mila100 ","data":"(20-Апр-15)"},{"id":"0","name":"Гость","data":"(12-Апр-15)"},{"id":"32711953","name":"60mishka ","data":"(06-Апр-15)"},{"id":"31222848","name":"Warri0r ","data":"(03-Апр-15)"},{"id":"25297332","name":"SLRamil ","data":"(30-Мар-15)"},{"id":"16925966","name":"xReal ","data":"(24-Мар-15)"},{"id":"10961519","name":"makabre4 ","data":"(17-Мар-15)"},{"id":"27466161","name":"hjuma ","data":"(14-Мар-15)"},{"id":"1437426","name":"nf_nick ","data":"(02-Мар-15)"},{"id":"24863706","name":"Balur30 ","data":"(03-Фев-15)"},{"id":"4387710","name":"sachalin ","data":"(01-Фев-15)"},{"id":"11719165","name":"eko1og ","data":"(29-Янв-15)"},{"id":"18733251","name":"ViRUS2k10 ","data":"(07-Янв-15)"},{"id":"36184294","name":"tele-ga ","data":"(07-Янв-15)"}]}