{"link":"4833541","name":"RazorSQL 6.3.12 x86 x64 [09/23/2014, ENG]","date":"28-Сен-14 10:21","author":"113344ds","description":"\nRazorSQL 6.3.12 Windows x86-64 [2014, ENG]Год/Дата Выпуска: 09/23/2014\nВерсия: 6.3.12\nРазработчик: Richardson Software\nСайт разработчика: razorsql.comРазрядность: 32bit, 64bit\nЯзык интерфейса: Английский\nТаблэтка: Присутствует\nСистемные требования: Windows x86-64\nОписание: RazorSQL является инструментом SQL запросов, обозревателя баз данных, редактор SQL и средства администрирования базы данных для Windows, Mac OS X, Linux, и Solaris. RazorSQL была протестирована на более чем 30 баз данных, могут подключаться к базам данных через любой JDBC или ODBC, и включает в себя поддержку следующих баз данных: Кассандра Greenplum MariaDB OpenBase SolidDB DB2 H2 Microsoft Access Oracle SQLite DBASE HSQLDB Mimer SQL Paradox SQL Anywhere Дерби Informix MonetDB Pervasive SQL Azure DynamoDB Энгр MongoDB PostgreSQL Sybase (ASE) Filemaker Interbase MS SQL Server Salesforce Sybase IQ Firebird Int.Sys. Кэш MySQL SimpleDB Teradata Frontbase JavaDB Netezza RazorSQL предоставляет одновременно простым в использовании визуальных средств и расширенные функции, чтобы пользователи могли сделать просмотра базы данных, редактирование, управление, администрирование и программирование. Обзор конкретных баз данных функции или полную ссылку функций. Особенности Навигатор База данных для просмотра объектов базы данных. Редактор SQL для создания запросов SQL. Визуальные инструменты для создания, редактирования, падать, описания, изменяя, и просмотр таблицы, представления, индексы, и последовательности Визуальные инструменты для создания, редактирования, удаление и выполнение хранимых процедур, функций и триггеров Надежный редактор программирования, который встраивает мощный редактор кода EditRocket, который поддерживает 20 языков программирования, включая SQL, PL / SQL, TransactSQL, SQL PL, HTML, XML, и многое другое. Инструмент экспорта - Экспорт данных в различных форматах Инструмент импорта - Импорт данных из файлов с разделителями, файлы Excel, или фиксированную ширину файлов в таблицах Корабли с встроенным двигателем реляционных баз данных (HSQLDB), что находится в рабочем состоянии из коробки и не требует администрирования конечных пользователей Генерация DDL инструмент для создания таблицы, представления, и указательным DDL. Таблица / SQL Query инструмент для сравнения для сравнения таблиц или запросов по нескольким соединений База данных Поиск данных инструмент для поиска одного или нескольких табличных данных базы данных и просмотра. Объект Поиск по базе инструмент для поиска объектов базы данных. Средства резервного копирования, такие как инструмент резервного копирования баз данных и таблиц Backup Tool База данных переходов инструмент для многих популярных баз данных. Авто колонки и автосалонов таблица поиска SQL Formatter SQL Query Builder инструмент SQL Query Планировщик инструмент Интерфейс командной строки PHP Мосты для подключения к MySQL, PostgreSQL, и баз данных SQL Server удаленно через PHP включен веб-серверов ASP мост для подключения к MS SQL Server базы данных удаленно через поддержкой ASP веб-серверов SQL Инструменты GUI для генерации SQL для различных операций Изменение, удаление и вставка данных базы данных с базой данных редактора Работает со всеми основными операционными системами, включая Windows, Mac OS X, Linux, Solaris, и любой другой Java включен OS Испытано с Apache Cassandra, Apache Derby / JavaDB, нарциссов БД, DB2, DBASE, DynamoDB, Firebird, FrontBase, H2, HSQLDB / HyperSQL, Informix, Ingres, Interbase, Mckoi, Microsoft Access, Microsoft SQL Server, Mimer SQL, MongoDB, MySQL , Netezza, OpenBase, Oracle, Pervasive, Pointbase, PostgreSQL, Salesforce, SimpleDB, Solid, SQLite, Sybase Adaptive Server Enterprise, Sybase SQL Anywhere, и TeradataНе требует установки, распаковать и запускать. Для запуска кейгена нужен Java SDK. Может не принимать ключи сразу, генерируйте до тех пор пока не примет ключ, обычно хватает 5-6 раз.\n\nСкриншоты\n\n \n \n \n\n\n\nСкриншоты окна About\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:37D5262E805473EFABA8D5864E7AF7A1DBD03EA3&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=RazorSQL%206.3.12%20x86%20x64%20%5B09%2F23%2F2014%2C%20ENG%5D","torrent_link":"dl.php?t=4833541","thanked_list":[{"id":"38561581","name":"emil.jakybaliev ","data":"(04-Апр-23)"},{"id":"30727380","name":"dfgsdfgsdfg ","data":"(20-Мар-23)"},{"id":"14886158","name":"pat4005 ","data":"(18-Мар-23)"},{"id":"19844831","name":"2kin2ck ","data":"(13-Мар-23)"},{"id":"26248179","name":"collister ","data":"(15-Дек-22)"},{"id":"3104170","name":"superdumb ","data":"(06-Окт-22)"},{"id":"13514303","name":"CodeRFoX ","data":"(25-Май-22)"},{"id":"18315508","name":"ss7806 ","data":"(27-Апр-22)"},{"id":"14653970","name":"bdm_m ","data":"(27-Апр-22)"},{"id":"17256989","name":"wlalele ","data":"(07-Апр-22)"},{"id":"2223310","name":"Erroman ","data":"(15-Мар-22)"},{"id":"24945483","name":"jerinicd ","data":"(09-Ноя-21)"},{"id":"42735966","name":"GoodGod128 ","data":"(03-Окт-21)"},{"id":"14013740","name":"senile123 ","data":"(26-Авг-21)"},{"id":"45271280","name":"hexadec ","data":"(01-Авг-21)"},{"id":"36401310","name":"nuku ","data":"(24-Июл-21)"},{"id":"45825627","name":"vt005 ","data":"(12-Июл-21)"},{"id":"4693951","name":"spair2k ","data":"(11-Май-21)"},{"id":"22426953","name":"xqss ","data":"(01-Апр-21)"},{"id":"26638604","name":"julio213180 ","data":"(29-Мар-21)"},{"id":"685470","name":"Илья Муромец ","data":"(14-Фев-21)"},{"id":"2685597","name":"rosenkrantz ","data":"(09-Фев-21)"},{"id":"39055181","name":"Berserker2015 ","data":"(18-Июн-20)"},{"id":"14856343","name":"derbov ","data":"(29-Май-20)"},{"id":"14710439","name":"tihij1969 ","data":"(06-Май-20)"},{"id":"23458840","name":"hhhhhhdddddd ","data":"(03-Янв-20)"},{"id":"17349093","name":"mdtmto ","data":"(16-Дек-19)"},{"id":"44382516","name":"jpetkov89 ","data":"(09-Дек-19)"},{"id":"11150795","name":"stefmag ","data":"(10-Окт-19)"},{"id":"41831403","name":"Xuan Hung ","data":"(20-Июл-19)"},{"id":"13906093","name":"geotronic ","data":"(20-Май-19)"},{"id":"4424588","name":"band001 ","data":"(20-Май-19)"},{"id":"25977955","name":"ool_ool ","data":"(24-Мар-19)"},{"id":"15775313","name":"ejs ","data":"(09-Мар-19)"},{"id":"14790144","name":"6860055 ","data":"(14-Янв-19)"},{"id":"43676819","name":"Vesna2014 ","data":"(16-Дек-18)"},{"id":"17853166","name":"Dipusechka ","data":"(26-Ноя-18)"},{"id":"29485769","name":"Vivi121 ","data":"(22-Авг-18)"},{"id":"24922094","name":"parodent ","data":"(22-Авг-18)"},{"id":"14282423","name":"zhidra ","data":"(26-Июл-18)"},{"id":"20752060","name":"SuperBase ","data":"(25-Июл-18)"},{"id":"22057081","name":"ARVTGO ","data":"(20-Июл-18)"},{"id":"7456527","name":"Арканоид ","data":"(31-Май-18)"},{"id":"39168742","name":"zero0110 ","data":"(09-Фев-18)"},{"id":"23330732","name":"GunmanNN ","data":"(02-Фев-18)"},{"id":"19576963","name":"innvision ","data":"(01-Фев-18)"},{"id":"10660400","name":"alex_rt ","data":"(27-Ноя-17)"},{"id":"20385859","name":"shem-90 ","data":"(03-Ноя-17)"}]}