{"link":"4862316","name":"Oracle Database 10g R2 (10.2.0.1.0) Solaris x86 64 [02.07.2005, ENG]","date":"06-Ноя-14 11:26","author":"zacisco","description":"\nOracle Database 10g R2 (10.2.0.1.0) Solaris x86_64Год/Дата Выпуска: 02.07.2005\nВерсия: 10g R2 Build 10.2.0.1.0\nРазработчик: Oracle Inc.\nСайт разработчика: www.oracle.comРазрядность: 64bit\nЯзык интерфейса: Английский\nТаблэтка: Не требуется\nСистемные требования:\n- ОЗУ - 512 MB\n- объем раздела swap - 1 GB\n- свободное место в /tmp - 400 MB\n- место под софт - 2,5 GB\n- место под базы данных - 1,2 GB\nОписание:\n\nВНУТРИ\nOracle Database 10g — первая в мире база данных, разработанная специально для работы в сетях распределенных вычислений. Oracle Database 10g предназначена для эффективного развертывания на базе различных типов оборудования, от небольших серверов до Oracle Enterprise Grid мощных многопроцессорных серверных систем, от отдельных кластеров до корпоративных распределенных вычислительных систем. Oracle Database 10g предоставляет возможность автоматиче- ской настройки и управления, которая делает ее использование простым и экономически выгодным. Ее уникальные возможности осуществлять управление всеми данными предприятия — от обычных операций с бизнес-информацией до динамического многомерного анализа данных (OLAP), операций с документами формата XML, управления распределенной/локальной информацией — делает ее идеальным выбором для выполнения приложений, обеспечивающих обработку оперативных транзакций, интеллектуальный анализ информации, хранение данных и управление информационным наполнением.Oracle Database 10g позволяет пользователям виртуализировать использование аппаратного обеспечения — серверов и систем хранения данных. Oracle Database 10g обладает технологиями, которые позволяют администраторам надежно хранить и быстро распределять и извлекать данные для пользователей и приложений, работающих в сетях Grid. Oracle Database 10g значительно повышает производительность обработки данных и включает в себя удобные средства администрирования.Вот только некоторые ключевые возможности Oracle Database 10g:\nReal Application Cluster (RAC) обеспечивает работу одного экземпляра базы данных на нескольких узлах grid, позволяя управлять нагрузкой и гибко масштабировать систему в случае необходимости.\nAutomatic Storage Management (ASM) позволяет автоматически распределять данные между имеющимися ресурсами систем хранения данных, что повышает отказоустойчивость системы и снижает общую стоимость владения (TCO).\nПроизводительность. Oracle Database 10g позволяет автоматически управлять уровнями сервиса и тиражировать эталонные конфигурации в рамках всей сети.\nПростые средства разработки. Новый инструмент разработки приложений HTML DB позволит простым пользователям создавать эффективные приложения для работы с базами данных в короткие сроки.\nСамоуправление. Специальные механизмы Oracle Database 10g позволяют самостоятельно перераспределять нагрузку на систему, оптимизировать и корректировать SQL-запросы, выявлять и прогно- зировать ошибки.\nБольшие базы данных. Теперь максимальный размер экземпляра базы данных Oracle может достигать 8 экзабайт.\nНедорогие серверные системы. Oracle Database 10g может использовать недорогие однопроцессорные компьютеры или модульные системы из «серверов-лезвий».В новой версии базы данных реализована поддержка переносимых табличных пространств, система управления потоками данных Oracle Streams и модель распределенных SQL-запросов. Для переноса существующих баз данных в среду Grid в них не потребуется вносить изменений, что позволяет быстро начать использовать все преимущества Oracle Database 10g.\n\nДоп. информация: С оффа скачать можно уже только после регистрации и платной подпискиесли есть какие-то неточности или хотите дополнить шапку - пишите,всё добавлю\n\nOther Distrib\nOracle Database 10g R2 (10.2.0.1.0) Linux x86_64\nOracle Database 10g R2 (10.2.0.1.0) Linux x32\nOracle Database 10g R2 (10.2.0.1.0) Solaris (SPARC) x64\nOracle Database 10g R2 (10.2.0.2.0) Solaris x86\nOracle Database Companion 10g R2 (10.2.0.1.0) Linux x86\n\n\nСкриншоты\n\n\n\n\nСкриншоты окна About\n\n\n\n16.06.2021 - Добавлен трекер в файл - облом,он стирается форумом (всю стату загрузок потерял)  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:65F4BF24DEF23B32A3C1DE8A036742DFB47194A6&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=Oracle%20Database%2010g%20R2%20(10.2.0.1.0)%20Solaris%20x86%2064%20%5B02.07.2005%2C%20ENG%5D","torrent_link":"dl.php?t=4862316","thanked_list":[{"id":"9473366","name":"sanphir28 ","data":"(30-Июл-19)"},{"id":"21214790","name":"yashko-87 ","data":"(29-Май-18)"},{"id":"16618779","name":"val-loner ","data":"(28-Май-18)"},{"id":"12097086","name":"CatTenshi ","data":"(02-Авг-16)"},{"id":"7941534","name":"АлексейТВ ","data":"(14-Июл-16)"},{"id":"18502830","name":"besruk ","data":"(01-Июл-16)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"19081981","name":"zero1050 ","data":"(14-Мар-16)"},{"id":"12602954","name":"Mahal ","data":"(12-Янв-16)"},{"id":"10340160","name":"Drummer-Georg ","data":"(28-Дек-15)"},{"id":"2962949","name":"ssadmn2008 ","data":"(28-Окт-15)"},{"id":"37582254","name":"aleksxss ","data":"(28-Мар-15)"},{"id":"11154480","name":"Pol_Pavel ","data":"(11-Фев-15)"},{"id":"23791154","name":"nwm973 ","data":"(30-Дек-14)"},{"id":"0","name":"Гость","data":"(18-Дек-14)"},{"id":"27089571","name":"exUSSRex ","data":"(01-Дек-14)"},{"id":"4056163","name":"kuzka84 ","data":"(06-Ноя-14)"}]}