{"link":"5293151","name":"Oracle Database 12c R1 Standard Edition 2 for Linux x86-64, Solaris SPARC, Solaris x86-64, Windows x86-64, IBM AIX, z/Linux, HP-UX IA64","date":"07-Окт-16 20:34","author":"oracloid3","description":"\nOracle Database 12c R1 Standard Edition 2Oracle Database Standard Edition 2 - доступная по цене, полнофункциональная СУБД, обеспечивающая беспрецедентную легкость использования, мощность и производительность. С диапазоном использования от oдносерверной архитектуры для заказчиков малого и среднего бизнеса до высокораспределенных структур, Oracle Database Standard Edition 2 включает все необходимые функции для создания бизнес-приложений.\n\nОптимизирована для внедрения на малых предприятиях, в отдельных направлениях бизнеса и распределенных отраслевых структурах.\nПредлагает новую, предназначенную для облачных технологий контейнерную архитектуру СУБД, упрощая миграцию на облачные технологии.\nВключает инструменты быстрой разработки приложений и поддерживает широкий диапазон платформ разработки и типов данных, включая XML и JSON.\nОбеспечивает высокую доступность корпоративного уровня с Oracle Real Application Clusters (Oracle RAC).\nОбеспечивает полную сквозную совместимость, защищая ваши инвестиции по мере роста ваших требований.\nМожет быть развернута на серверах, поддерживающих максимум 2 сокета, и подходит для всех поддерживаемых Oracle операционных систем, включая Windows, Linux и Unix.\n\nOracle Database Standard Edition 2 может лицензироваться на 2-сокетных серверах, у которых текущее число ядер может достигать 36 ядер на сервер и до 16 потоков для одного экземпляра базы данных. Максимально допустимое количество ядер для 2-сокетных серверов может со временем увеличиваться, не влияя на лицензионные обязательства заказчика.ПРЕИМУЩЕСТВА\n\nРасширенная функциональность, включая высокую доступность и инструменты быстрой разработки приложений, поддерживающие широкий спектр платформ разработки.\nЭкономически эффективная модель лицензирования: лицензирование в зависимости от числа сокетов вне зависимости от того, сколько процессорных ядер будет добавлено в будущем.\nПростота миграции на облачные технологии.\nОбеспечивает простой подход к масштабированию и расширению до решений Enterprise Edition или Oracle Cloud.\nНулевая стоимость миграции лицензий с решений Standard Edition (SE) либо Standard Edition One (SE1) на Standard Edition 2 (SE2).\n\nПочему Oracle Database Standard Edition 2?Oracle Database Standard Edition 2 (SE2) развивает существующие предложения Standard Edition (SE) и Standard Edition One (SE1) и объединяет их в одном продукте, продолжая быть доступным решением корпоративного класса для заказчиков малого и среднего бизнеса. Во времена выпуска решения Standard Edition (SE) одно- и двухъядерные процессоры были нормой. Сегодня выпускаются 18-ядерные процессоры, в ближайшем будущем ожидаются 32-ядерные, не говоря уже о том, что производительность каждого отдельного ядра значительно возросла. Данное предложение учитывает текущую аппаратную тенденцию к увеличению количества ядер в процессорах. Эта тенденция, по сути, отменяет потребность в 4-сокетных серверах. Таким образом, Standard Edition 2 (SE2) лучше подходит к оборудованию, которое используют наши заказчики.Что это означает для заказчиков, в настоящий момент имеющих лицензию на Oracle Database Standard Edition One (SE1)? [*]Защита инвестиций. Вы можете продолжить использование Oracle Database Standard Edition One (SE1), и Oracle будет продолжать предлагать техническую поддержку в соответствии с нашими правилами поддержки.\n[*] Нулевая стоимость миграции лицензий. Вы можете перейти на Oracle Database Standard Edition 2 (SE2) без каких-либо дополнительных затрат на приобретение лицензий.\n[*] Расширенная функциональность и показатели. С незначительным ростом затрат на техническую поддержку (20%), что в среднем составляет около $ 500 за сокет для всех заказчиков Standard Edition One (SE1), вы получаете доступ к функциональности корпоративного класса, в том числе к RAC для обеспечения высокой доступности, и к новым возможностям, таким как база данных контейнерной архитектуры, что облегчает процесс миграции на облачные технологии, и поддержку JSON и XML, что открывает возможности анализа больших объемов данных и обеспечивает хранилище документов корпоративного класса. С дополнительной информацией о возможностях, в том числе о возможностях данной версии, вы можете ознакомиться в правилах лицензирования базы данных.\n[*] Преимущество в стоимости и масштабируемости. Oracle Database Standard Edition 2 может лицензироваться на 2-сокетных серверах, у которых текущее число ядер может достигать 36 ядер на сервер и до 16 потоков для одного экземпляра базы данных. Максимально допустимое количество ядер для 2-сокетных серверов может со временем увеличиваться, не влияя на лицензионные обязательства заказчика. С Oracle затраты заказчика на лицензии остаются неизменными вне зависимости от количества ядер на сокете. Каждая база данных Standard Edition 2 (SE2) может использовать до 16 потоков, и, поскольку большинство заказчиков располагает несколько баз данных на одном 2-сокетном сервере для полноценного использования вычислительного потенциала CPU, лицензионные обязательства заказчика, независимо от того, сколько баз данных работают на одном сервере, ограничиваются только 2 сокетами.Что это означает для заказчиков, использующих Oracle Database Standard Edition (SE)?[*] Неизменная цена. Для заказчиков, использующих Standard Edition (SE), цена за сокет остается прежней для Standard Edition 2 (SE2).\n[*] Защита инвестиций. Заказчики могут продолжать использовать Standard Edition (SE). Oracle продолжит предлагать техническую поддержку в соответствии с нашими правилами поддержки.\n[*] Расширенная функциональность и улучшенные показатели. Заказчики продолжают получать доступ к RAC для обеспечения высокой доступности. Они также получают много новых возможностей, таких как контейнерная архитектура базы данных, что облегчает процесс миграции на облачные технологии, и поддержку JSON и XML, что открывает возможности анализа больших объемов данных и обеспечивает хранилище документов корпоративного класса.\n[*] Преимущество в стоимости и масштабируемости. Oracle Database Standard Edition 2 может лицензироваться на 2-сокетных серверах, у которых текущее число ядер может достигать 36 ядер на сервер и до 16 потоков для одного экземпляра базы данных. Максимально допустимое количество ядер для 2-сокетных серверов может со временем увеличиваться, не влияя на лицензионные обязательства заказчика. С Oracle затраты заказчика на лицензии остаются неизменными вне зависимости от количества ядер на сокете. Каждая база данных Standard Edition 2 (SE2) может использовать до 16 потоков, и, поскольку большинство заказчиков располагает несколько баз данных на одном 2-сокетном сервере для полноценного использования потенциала CPU, лицензионные обязательства заказчика, независимо от того, сколько баз данных работают на одном сервере, ограничиваются только 2 сокетами.Со Standard Edition мы могли расширить свою лицензию до 4 сокетов, однако сейчас, со Standard Edition 2, мы можем использовать максимум 2 сокета.Очень небольшой процент заказчиков использует Standard Edition с 4-сокетными системами. Наиболее распространенной является конфигурация с 2 сокетами. Для небольшого процента заказчиков, которые используют Standard Edition на 4-сокетных платформах, существуют следующие сценарии:[*] Благодаря правилам ценообразования на основе количества сокетов вы получаете значительный вычислительный потенциал на 2-сокетной платформе (вероятно, более высокий, чем на прежних 4-сокетных системах).\n[*] Вы можете продолжить использование Standard Edition в рамках имеющихся лицензий, и Oracle продолжит обеспечивать поддержку в соответствии с правилами поддержки.\n[*] Вы можете рассмотреть вариант обновления решения до Oracle Enterprise Edition или до Oracle Cloud Database Service.\n[*]Для Standard Edition и Standard Edition One не устанавливались ограничения на количество потоков CPU, но для Standard Edition 2 установлен предел в 16 потоков на базу данных.  [*] Основная часть заказчиков Standard Edition и Standard Edition One с высокой долей вероятности задействует максимум 8 потоков, поэтому вопрос об ограничениях менее критичен, чем он кажется.С учетом того, что большинство наших заказчиков Standard Edition и Standard Edition One уже работает на 2-сокетных серверах, основная часть наших заказчиков не будет затронута этим изменением в лицензировании.Улучшенные показатели. Расширенная функциональность Oracle Database Standard Edition 2 предлагает доступную по цене, полнофункциональную базу данных со множеством новых функций, с высокими показателями мощности и производительности, которая разработана специально для удобства использования и обеспечивает простоту масштабирования и расширения до облачных технологий.  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:48CD634C5FB75CD81B2B5B368395E4EDA1AED6C0&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=Oracle%20Database%2012c%20R1%20Standard%20Edition%202%20for%20Linux%20x86-64%2C%20Solaris%20SPARC%2C%20Solaris%20x86-64%2C%20Windows%20x86-64%2C%20IBM%20AIX%2C%20z%2FLinux%2C%20HP-UX%20IA64","torrent_link":"dl.php?t=5293151","thanked_list":[{"id":"15246670","name":"Bukaspb ","data":"(16-Апр-23)"},{"id":"11455488","name":"Афанасий_rnd ","data":"(10-Фев-23)"},{"id":"42853978","name":"pvz_pvz ","data":"(31-Май-22)"},{"id":"15033198","name":"maphuong ","data":"(28-Апр-22)"},{"id":"39237087","name":"Thiago Pimenta ","data":"(08-Апр-22)"},{"id":"12827950","name":"ArchitectCP ","data":"(17-Дек-21)"},{"id":"43007127","name":"DusanMix ","data":"(11-Сен-21)"},{"id":"29997111","name":"MoonGoose ","data":"(07-Сен-21)"},{"id":"13558038","name":"kot_v_konople ","data":"(24-Июн-21)"},{"id":"23293691","name":"masesto ","data":"(01-Апр-21)"},{"id":"23389721","name":"Cheapfox ","data":"(18-Дек-20)"},{"id":"35278200","name":"f117-1 ","data":"(06-Дек-20)"},{"id":"6840056","name":"pgabriel ","data":"(05-Апр-20)"},{"id":"17960453","name":"4bakra ","data":"(17-Июл-19)"},{"id":"43389435","name":"mk-vityaz ","data":"(12-Фев-19)"},{"id":"25593662","name":"edshadow9 ","data":"(09-Янв-19)"},{"id":"16554033","name":"agentsmith170390 ","data":"(22-Ноя-18)"},{"id":"12440323","name":"serg_x ","data":"(10-Окт-18)"},{"id":"2631237","name":"morozov_an ","data":"(07-Фев-18)"},{"id":"16223123","name":"yurinn44 ","data":"(02-Фев-18)"},{"id":"19769177","name":"tridevil ","data":"(27-Ноя-17)"},{"id":"11608872","name":"Stanislav37 ","data":"(01-Окт-17)"},{"id":"37922782","name":"Dmitry_77777 ","data":"(15-Сен-17)"},{"id":"11629570","name":"gimmig ","data":"(09-Авг-17)"},{"id":"14537458","name":"anti_gnu ","data":"(15-Июн-17)"},{"id":"16254082","name":"44shop ","data":"(06-Май-17)"},{"id":"13926190","name":"gvallo ","data":"(05-Май-17)"},{"id":"31035166","name":"HellInfernal ","data":"(25-Апр-17)"},{"id":"32383020","name":"irfan136 ","data":"(31-Мар-17)"},{"id":"23518415","name":"Maxi_Nikolaich ","data":"(24-Мар-17)"},{"id":"38127971","name":"Spigul ","data":"(23-Мар-17)"},{"id":"14556175","name":"potemkin20 ","data":"(16-Мар-17)"},{"id":"5438854","name":"rootmax ","data":"(10-Мар-17)"},{"id":"15821103","name":"yurm2008 ","data":"(13-Фев-17)"},{"id":"14337870","name":"Lsoft ","data":"(15-Янв-17)"},{"id":"26225898","name":"karatuch1996 ","data":"(14-Янв-17)"},{"id":"13110511","name":"DimonCrimea ","data":"(02-Янв-17)"},{"id":"20237862","name":"ci7alex1 ","data":"(30-Дек-16)"},{"id":"5664624","name":"txb ","data":"(26-Дек-16)"},{"id":"18294530","name":"AndrewRats ","data":"(24-Дек-16)"},{"id":"18055636","name":"ShameSame ","data":"(21-Дек-16)"},{"id":"16689957","name":"zlodejko ","data":"(18-Дек-16)"},{"id":"9159512","name":"noram ","data":"(14-Дек-16)"},{"id":"13420074","name":"Nemonius ","data":"(02-Дек-16)"},{"id":"9723448","name":"Wurther ","data":"(27-Ноя-16)"},{"id":"13221851","name":"Zerobarmen ","data":"(18-Ноя-16)"},{"id":"3052548","name":"Nik_alex_p ","data":"(16-Ноя-16)"}]}