{"link":"5667268","name":"IDERA DBArtisan 17.0.2 x86 x64 [2018, ENG]","date":"30-Дек-18 23:50","author":"KostyantynKo","description":"\nIDERA DBArtisan 17.0.2Год/Дата Выпуска: 2018\nВерсия: 17.0.2 Build: 15386\nРазработчик: IDERA Technologies\nСайт разработчика: www.idera.comРазрядность: 32bit, 64bit\nЯзык интерфейса: Английский\nТаблэтка: присутствуетСистемные требования:\n1 ГГц или более быстрый процессор\n3 ГБ ОЗУ\n1 ГБ свободного дискового пространства\nДисплей 1024 x 768Поддерживаемые операционные системы:\nWindows 10, Windows 8.1, Windows 8, Windows 7 (32- и 64-разрядная версия)\nWindows Server 2008 SP1 & 2008 R2 (32- и 64-разрядная версия)\nWindows Server 2012 & 2012 R2\nWindows Server 2016Описание:\nIDERA DBArtisan - ведущая система администрирования баз данных Oracle, Sybase, Microsoft SQL Server, IBM DB2 UDB, и DB2 OS/390. Ее богатый функционал поможет обеспечить максимальную доступность, производительность и защищенность баз данных в масштабах всего предприятия. DBArtisan позволит одновременно управлять различными базами данных с одной графической консоли и обеспечит существенный прирост производительности труда, как профессионалам, так и новичкам.DBArtisan упрощает и автоматизирует ежедневные задачи администрирования, такие, как управление доступным пространством, создание пользовательских учетных записей, изменение объектов, осуществление миграции схем между разработческими, тестовыми и \"боевыми\" базами данных, контроль производительности и многие другие. Тот факт, что DBArtisan предоставляет единый интерфейс для всех основных СУБД, позволяет бизнесу уменьшить затраты и увеличить производительность, применив единое стандартное решение для управления всеми базами данных.Сделать базу данных доступной, производительной и защищенной - одна из важнейших целей администратора. Достижение этой цели требует постоянной бдительности, учета непредвиденных обстоятельств и большого объема утомительной работы. IDERA® DBArtisan® освобождает от рутины, предоставляя мощные графические средства, которые, охватывают все стороны деятельности администратора и оставляют в прошлом многие из его функций, таящие в себе опасность ошибок и отнимающие много времени.DBArtisan Space Analyst - инструмент для идентификации и устранения разнообразных проблем,связанных с пространством, которые оказывают отрицательное влияние на работу баз данных.DBArtisan Capacity Analyst - средство сбора информации, необходимой для дальнейшего глубокого анализа изменений, происходящих с базой\nDBArtisan Performance Analyst - полный визуальный контроль всех параметров производительности баз данных.Управление схемами баз данных\nDBArtisan предоставляет не имеющие себе равных возможности управления объектами баз данных. Его графические редакторы объектов и мастера, учитывающие особенности платформ баз данных и их версий, позволяют создавать, удалять или изменять широкий спектр объектов, включая таблицы, ограничивающие условия, индексы, виды, представления, пользователей, процедуры, функции, триггеры, группы, роли, профили и пакеты.DBArtisan включает стандартизованные многорежимные графические редакторы для каждого типа объектов баз данных, что позволит Вам без усилий перейти от управления схемами SQL Server или Sybase к управлению схемами Oracle и наоборот. Продукт содержит знания по системным каталогам основных СУБД, синтаксису и правилам изменений. При создании документации на схемы баз данных Вы можете воспользоваться специальными средствами построения отчетов, основанными на интерфейсе мастеров, которые помогут Вам создать веб-сайты с фреймовой структурой, содержащие описания как одного объекта, так и всей базы данных.Доп. информация:\nУправление безопасностью\nDBArtisan поможет эффективно реализовать и поддерживать безопасность баз данных. Независимо от того, администрируете Вы уже существующую базу данных или создаете новую, Вы получите мощные средства, которые позволят:\nУправлять пользователями, ролями, учетными записями, профилями, группами и ссылками.\nПеремещать учетные записи внутри одной или между несколькими базами данных\nУправлять безопасностью на уровне паролей\nПрисваивать и изменять роли пользователям, а также другим ролям, как на объектном уровне, так и на системном.\nДавать привилегии многим пользователям всего за одну операцию\nОсуществлять удаленное администрирование Microsoft SQL Server и SybaseУправление пространством\nУправление пространством является жизненно важным для обеспечения доступности и производительности Ваших баз данных. DBArtisan содержит много встроенных функций по управлению пространством, что позволяет Вам квалифицированно управлять и эффективно использовать запоминающие устройства, на которых размещены базы данных.Для более тонкого анализа пространства может быть использован дополнительный компонент (покупается и лицензируется отдельно) - DBArtisan Space Analyst, содержащий специальные средства диагностики, которые помогут Вам точно определить все проблемы, связанные с пространством, относящиеся к Вашей базе данных, а мастер интеллектуальной реорганизации поможет перестроить Вашу базу данных или ее отдельные части.Управление SQL\nDBArtisan предоставляет мощные графические инструменты для создания и анализа сложных SQL-запросов и размещенных на сервере программных объектов, таких как хранимые процедуры, триггеры, и др. Используя Embarcadero Query Builder, Вы можете конструировать даже самые сложные SQL-запросы просто с помощью мыши. Как только Вы выбираете объекты и методы, которые нужно использовать для SQL-запроса, DBArtisan автоматически генерирует код.Встроенная проверка синтаксиса дает уверенность в том, что все SQL-запросы будут построены и выполнены правильно с первого раза. Обладающая большим количеством настроек утилита DBArtisan ISQL позволяет Вам с легкостью создавать, сохранять и выполнять любой SQL код, относящийся к любой Вашей базе данных. Встроенные горячие клавиши и возможность завершения кода помогут Вам программировать SQL с очень высокой скоростью. Для анализа и отладки кода DBArtisan предоставляет анализатор производительности выполнения кода со встроенными пояснениями, а для выявления ошибок в хранимых на сервере программных объектах Вы можете использовать кросс-платформенные отладчики кода (покупаются и лицензируются отдельно).Для автоматического захвата и анализа выполнения SQL Вы можете использовать опциональный компонент SQL Profiler (покупается и лицензируется отдельно).Управление заданиями\nТакие задачи, как масштабная реорганизация или выполнение скриптов, осуществляющих критические изменения в базе данных, часто должны выполняться в нерабочие часы. DBArtisan легко интегрируется с Microsoft Windows Task Scheduler, который позволяет Вам запланировать запуск практически любого задания тогда, когда Вам угодно и с любой частотой.Управление данными\nDBArtisan предоставляет всеобъем-лющие средства, которые помогут Вам управлять данными во всех Ваших базах данных. Визуальный редактор данных поможет Вам добавлять, изменять и удалять данные из Ваших таблиц с контролем за ссылочной целостностью. Вы можете создавать операторы вставки для таблиц, использующие текущие данные, а также для определенных баз данных извлекать данные как XML документы.DBArtisan также предлагает утилиты, основанные на интерфейсе мастеров, для миграции объектов, являющихся схемами, и ассоциированных с ними таблиц, с одного сервера баз данных на другой. Вы можете копировать отдельный объект базы данных, все объекты, принадлежащие пользователю определенной схемы, или всю базу данных целиком. В качестве альтернативы Вы можете определить специально созданное задание миграции, которое выполнит миграцию любой группы объектов базы данных. DBArtisan также может производить комбинации кросс-платформенной миграции между различными СУБД для общих объектов баз данных, таких как таблицы, данные, пользователи, индексы и представления.Управление производительностью\nЯвляясь занятым администратором баз данных, Вы не можете неэффективно тратить время на попытки обнаружить критичные для производительности узкие места в Вашей базе данных. Но в таком случае Вам нужны инструменты, которые исключат любую работу, основанную на догадках, из управления производительностью. DBArtisan предоставляет несколько таких инструментов, реализованных в виде различных опций, которые помогут Вам в управлении производительностью Ваших ключевых баз данных.DBArtisan поставляется вместе со встроенным диспетчером процессов, который поможет понять, кто подключен к Вашей базе данных в процессе текущей активности, осуществляемой в каждой сессии. Кроме этого, осуществляется фиксация деталей и всевозможных данных, касающихся сессий.\nТе, кто хочет получать расширенную информацию о производительности, могут использовать опционный компонент DBArtisan Performance Analyst (покупается и лицензируется отдельно). Это мощный, устанавливающийся на стороне клиента монитор баз данных, вся функциональность которого содержится в консоли DBArtisan. Embarcadero® Performance Analyst предоставляет интеллектуальную диагностическую информацию с возможностью последующей детализации полученных данных (\"drill down\"), чтобы помочь Вам проникнуть в суть любого случая потери производительности. Embarcadero Performance Analyst полностью интегрируется с DBArtisan, так что Вы можете исправлять любые проблемы с производительностью всего несколькими щелчками мыши.\nЕсли Вам требуется автоматизированное обслуживание Ваших баз данных в режиме 24x7, то Вам следует обратить внимание на Embarcadero® Performance Center. Это отдельное решение масштаба предприятия, которое может круглосуточно оповещать Вас о любых проблемах с производительностью, требующих Вашего внимания. Performance Center полностью интегрирован с DBArtisan, что поможет Вам легко устранять обнаруженные узкие места.Управление резервами\nПланирование будущего Ваших критических баз данных обычно является трудной задачей. Однако специальный инструмент - Capacity Analyst, который является опционным компонентом DBArtisan (покупается и лицензируется отдельно), облегчает понимание текущего состояния Вашей базы данных и того, что ее ожидает в будущем. Embarcadero® Capacity Analyst позволяет Вам отслеживать изменения во времени любых метаданных и параметров производительности основных баз данных и, как результат, осуществлять анализ тенденций в ключевых областях, таких как рост базы данных, фрагментация объектов, операции ввода-вывода и загрузка сессий. В Embarcadero Capacity Analyst встроен интеллектуальный механизм прогнозирования, позволяющий вам предсказывать, когда Ваша база данных исчерпает свободное пространство или когда появится необходимость в реорганизации объектов.Отсутствие вмешательства\nВ отличие от других инструментов администрирования баз данных, DBArtisan не инсталлирует никаких объектов в рабочий сервер базы данных, так что не возникает проблемы отслеживания занимаемого такими объектами пространства или других побочных эффектов. Опционный компонент Performance Analyst системы DBArtisan инсталлирует только два пакета в каждую базу данных, за которой он следит. Опционный компонент Capacity Analyst требует инсталляции нескольких таблиц, представляющих собой репозиторий, для сбора, сохранения и анализа исторической информации базы данных.\nПоддерживаемые СУБД\n\nПоддерживаемые платформы баз данных\nGreenplum\nIBM DB2 для z / OS 9 - 10.x и 11.x *\nIBM DB2 LUW 9 - 10.x и 11.x *\nMicrosoft SQL Server 2008, 2012, 2014, 2016 *, 2017 *\nMySQL 4.x, 5.x\nOracle 9i, 10g, 11g и 12c\nPostgreSQL 9.3, 9.4, 9.5, 9.6.x\nSybase ASE 12,5-15,7, 16,0\nSybase IQ 12,7-15,4, 16,0\n\n\nОблако\nDBArtisan работает на облачных виртуальных машинах (таких как Microsoft Azure VM и AWS EC2) с Microsoft Windows. Он поддерживает экземпляры базы данных на облачных виртуальных машинах (таких как Microsoft Azure VM и AWS EC2).\nДля этих баз данных DBArtisan поддерживает подмножество функций / функций этой версии базы данных.\n\n\nКак патчить?\n!!!При применении патча, Антивирус лучше отключить!!!\nЗапускаем среду первый раз от имени Администратора, закрываем.\nОтрываем КейПатч(KeyPatch), кликаем на кнопку \"Патч\"(Patch), сохраняем Лицензию СЛИП(Save Slip).\nЗапускаем среду, пользуемся...\n\n\nSplash Screen\n\n\n\n\nСкриншоты\n\n\n\n\n\n\nСкриншоты окна About\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:8AD0D4499DF2E35F5E677DB98097341C31D48229&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=IDERA%20DBArtisan%2017.0.2%20x86%20x64%20%5B2018%2C%20ENG%5D","torrent_link":"dl.php?t=5667268","thanked_list":[{"id":"28024648","name":"whiplash13 ","data":"(08-Май-23)"},{"id":"31886013","name":"DimaLesnik ","data":"(26-Ноя-21)"},{"id":"33116010","name":"alvahob ","data":"(28-Апр-21)"},{"id":"30070607","name":"spravka09 ","data":"(02-Окт-20)"},{"id":"4188474","name":"QweZxc25 ","data":"(17-Фев-20)"},{"id":"4953342","name":"sk2468 ","data":"(28-Янв-20)"},{"id":"27407402","name":"MYXOMOP_RU ","data":"(11-Янв-20)"},{"id":"34870798","name":"carton ","data":"(08-Янв-20)"},{"id":"9159512","name":"noram ","data":"(16-Дек-19)"},{"id":"18766499","name":"nekto763 ","data":"(27-Сен-19)"},{"id":"33618710","name":"Early Down ","data":"(13-Сен-19)"},{"id":"11182698","name":"d09 ","data":"(15-Авг-19)"},{"id":"11890608","name":"BESM6 ","data":"(03-Авг-19)"},{"id":"37965634","name":"DormidontLoewe ","data":"(08-Июн-19)"},{"id":"27529607","name":"Мирамани ","data":"(30-Май-19)"},{"id":"16619799","name":"rebuss001 ","data":"(17-Май-19)"},{"id":"15139588","name":"wital_79 ","data":"(01-Май-19)"},{"id":"6610194","name":"Jack_Doe ","data":"(31-Мар-19)"},{"id":"19212090","name":"shara_ban ","data":"(22-Мар-19)"},{"id":"27625798","name":"MiktorH ","data":"(14-Мар-19)"},{"id":"13595881","name":"topotun05 ","data":"(15-Фев-19)"},{"id":"3168010","name":"Arthur Daedrah ","data":"(15-Фев-19)"},{"id":"2135061","name":"amz ","data":"(30-Янв-19)"},{"id":"27466161","name":"hjuma ","data":"(23-Янв-19)"},{"id":"15760837","name":"IGHG ","data":"(07-Янв-19)"},{"id":"17700110","name":"perd ","data":"(05-Янв-19)"},{"id":"4760475","name":"grdraf ","data":"(31-Дек-18)"}]}