{"link":"5667295","name":"IDERA RapidSQL 17.0.2 x86 x64 [2018, ENG]","date":"31-Дек-18 01:15","author":"KostyantynKo","description":"\nIDERA RapidSQL 17.0.2Год/Дата Выпуска: 2018\nВерсия: 17.0.2 Build: 15386\nРазработчик: IDERA Technologies\nСайт разработчика: www.idera.comРазрядность: 32bit, 64bit\nЯзык интерфейса: Английский\nТаблэтка: присутствуетСистемные требования:\n1 ГГц или более быстрый процессор\n3 ГБ ОЗУ\n1 ГБ свободного дискового пространства\nДисплей 1024 x 768Поддерживаемые операционные системы\nWindows 10, Windows 8.1, Windows 8, Windows 7 (32- и 64-разрядная версия)\nWindows Server 2008 SP1 & 2008 R2 (32- и 64-разрядная версия)\nWindows Server 2012 & 2012 R2\nWindows Server 2016Описание:\nIDERA Rapid SQL - интегрированный инструментарий разработчиков, помогающим им создавать, редактировать, поддерживать версионность, настраивать, а также внедрять серверные объекты, относящиеся к различным СУБД - Oracle, Microsoft SQL Server, IBM DB2 и Sybase. Его возможности по программированию на HTML и Java образуют унифицированную среду разработки для баз данных и Web-сайтов, при этом разнообразные графические инструменты существенно упрощают создание SQL-скриптов, управление объектами, обратное проектирование, управление версиями и внедрение схем.Rapid SQL содержит обширный набор шаблонов кода, которые избавляют от необходимости помнить синтаксис SQL и набирать на клавиатуре длинные скрипты. Вдобавок его графические возможности по отображению объектов позволяют наглядно представлять структуру и зависимости объектов базы данных посредством одного движения мышью. С помощью Rapid SQL программисты могут разрабатывать и поддерживать высококачественные, высокопроизводительные клиент-серверные и Web приложения с меньшими затратами времени, при этом полностью достигая поставленные цели. Основной задачей разработчиков, создающих прикладные системы, использующие базы данных, является создание эффективного, тщательно оптимизированного кода баз данных за ограниченное время. Разработка и тестирование логики баз данных является зачастую той фазой построения подобных систем, которая \"съедает\" большую часть затрачиваемого времени, будучи при этом весьма потенциально опасной с точки зрения внесения ошибок.IDERA Rapid SQL является всеохватывающим решением, которое помогает разработчикам баз данных ускорить создание качественного кода, сокращая сроки разработки критически важных приложений.Доп. информация:\nПовышение продуктивности\nДаже самые опытные программисты, работающие на Oracle PL/SQL или Microsoft и Sybase Transact-SQL обнаружат, что Rapid SQL является очень эффективным инструментарием разработчика, поскольку он предоставляет многосторонние возможности по написанию кода серверной логики.Эти возможности, в частности, включают:\n* Генерацию кода для хранимых процедур, функций и пакаджей Oracle\n* Многооконный графический инструментарий (MDI - многодокументный интерфейс, реализованный в виде множества рабочих столов)\n* Настраиваемые возможности по использованию шаблонов кода\n* Просмотр колонок баз данных\n* Автозамены\n* Мощный браузер для каталогов баз данных\n* Параллельные (многотредовые) запросы\n* Офф-лайновую разработку кода\n* Проверку синтаксиса для Oracle, SQL Server, Sybase, DB2, Java и HTML\n* Автоматическую локализацию ошибок на отдельном экране\n* Помощь в синтаксисе\n* Плавающее окно с описаниями для таблиц, представлений, процедур и пр.\n* Графические оконные браузеры для объектов баз данных\n* Быстрые полноэкранные инструменты\n* Встроенные и определяемые пользователем \"горячие клавиши\"\n* Загрузку данных из внешних файлов, управляемую визардами\n* Поддержку закладок\n* Разработка схемRapid SQL обладает не имеющими себе равных средствами разработки объектов. Его графические редакторы и визарды, знающие специфику конкретных СУБД и их версий, позволяют создавать, удалять и изменять разнообразные объекты баз данных, включая таблицы, констрайнты, индексы, представления, процедуры, функции, триггеры и пакаджи\nСтандартизованные в рамках Rapid SQL многозакладочные графические редакторы объектов позволяют для любых объектов без всяких усилий переходить от управления схемами в SQL Server или Sybase к работе со схемами Oracle и наоборот. Продукт содержит в себе полную информацию о системных каталогах, синтаксисе, правилах изменений для всех соответствующих СУБД, с которыми производится работа.SQL скрипты и разработка\nRapid SQL имеет мощный визуальный инструментарий для создания и анализа комплексных SQL предложений и кода серверных объектов, таких, как хранимые процедуры, триггеры и т.д. Используя Query Builder - построитель запросов, разработчик может конструировать даже наиболее сложные SQL предложения с помощью мыши. По мере того, как разработчик выбирает объекты и методы, используемые в SQL предложениях, Rapid SQL автоматически генерирует код. Встроенные средства проверки синтаксиса обеспечивают правильную работу всех построенных SQL предложений с первого раза. Встроенный в Rapid SQL ISQL инструментарий, имеющий богатый набор возможностей, позволяет с легкостью создавать, сохранять и выполнять любой SQL код в заданной базе данных. Встроенные горячие клавиши, просмотр колонок, средства выполнения кода и использование шаблонов позволяют разрабатывать SQL код с максимальной быстротой.\nДля анализа и отладки кода Rapid SQL имеет встроенные средства, предназначенные для толкования и анализа скорости исполнения, а также кросс-платформенные отладчики (приобретаются и лицензируются отдельно), которые можно использовать для отладки серверных объектов. Для автоматического захвата фрагментов SQL и анализа их выполнения может быть использована опционная компонента SQL Profiler, которая приобретается и лицензируется отдельно.Управление проектами баз данных\nРабота с SQL кодом в офф-лайновом режиме, в отличие от манипуляций с \"живыми\" объектами баз данных, является более безопасной. Rapid SQL организует и категоризирует объекты баз данных в офф-лайновом репозитории исходного SQL кода, управление которым осуществляется через графический интерфейс, отображающий древовидную структуру. Таким образом обеспечивается простота и легкость работы с исходным SQL кодом в противоположность работе с \"живыми\" объектами базы данных. Мощный инструмент обратного проектирования может извлечь заданное подмножество существующих объектов из базы данных и поместить их в проект Rapid SQL, размещая каждый объект базы данных в отдельном файле.Встроенное управление версиями\nRapid SQL обеспечивает бесшовную интеграцию с большинством коммерческих систем управления версиями, такими, как Microsoft Source Safe®, PVCS™ и Clear Case. Проект может быть перемещен в центральную систему управления версиями с помощью всего лишь нескольких нажатий мыши, что позволяет организовать работу целой группы разработчиков с одним и тем же проектом. Поддерживаются все операции, связанные с управлением версиями, такие, как get, checkout, check-in, history, и diff.\nВ дополнение к этому, при работе с проектами Rapid SQL позволяет работать с индивидуальными файлами управления версиями исходного кода, которые уже существуют в репозиториях управления версиями.Визуальное создание SQL предложений и редактирование данных\nRapid SQL имеет мощный визуальный инструмент для создания SQL предложений и редактирования данных. Как уже упоминалось, Query Builder позволяет конструировать даже наиболее сложные SQL предложения простыми нажатиями мыши.\nПредставление данных в виде таблиц позволяет редактировать в Rapid SQL реально существующие данные. Можно добавлять, изменять или удалять данные в построчном режиме, или можно сохранить все модификации и послать их в базу данных в виде единого модуля. Все констрайнты ссылочной целостности принудительно применяются в каждой сессии редактирования.Web разработка\nWeb- программисты, использующие Java и HTML, обнаружат, что Rapid SQL имеет много инструментов для разработки Web приложений, связанных с базами данных. Rapid SQL позволяет одновременно просматривать данные в базе данных Oracle, отлаживать процедуру на PL/SQL, компилировать Java программу и редактировать Web страницу.Web-ориентированные свойства Rapid SQL включают:\nОкна HTML и Java редакторов, обеспечивающих контроль синтаксиса\nВстроенный браузер, поддерживающий Java, для тестирования HTLM и Java аплетов\nСредства сообщения об ошибках на разделенных экранах и автопозиционирование для Java\nИнтеграцию с любым Java компилятором, включая Sun Microsystems JDKАнализатор кода\nАнализатор кода позволяет осуществлять детальный анализ времени реакции при выполнении хранимых процедур и функций. Можно осуществлять тестирование производительности при выполнении одной или большего числа хранимых процедур или функций для определения конкретных кодовых объектов и строк кода, которые требуют наибольшего времени для своего выполнения. Анализатор кода позволяет также хранить исторические данные о временах реакции и выполнять разумные сравнения времен выполнения с текущими значениями, с тем, чтобы можно было оценить их отклонения от предыдущих приемлемых значений.Опции для осуществления отладки и профилирования:\nEmbarcadero/IDERA поставляет два модуля, являющихся опциями:\nThe Embarcadero/IDERA SQL Debugger\nПозволяет отлаживать программные объекты, такие, как хранимые процедуры, функции, пакаджи и триггеры\nThe Embarcadero/IDERA SQL Profiler\nПозволяет измерять параметры исполнения в базе данных разнообразных программных объектов, таких, как хранимые процедуры и функции. Эта информация помогает обнаруживать и устранять проблемы с производительностью и эффективностью. Будучи сохраненной в базе данных, она может быть использована в будущем для сравнительного анализа. (Система работает только для Oracle, начиная с версии 8.1.5).Инсталляция, не нарушающая работу базы\nВ отличие от других средств разработки, Rapid SQL не инсталлирует каких-либо объектов в рабочие серверы баз данных.\n\nПоддерживаемые платформы баз данных\nGreenplum\nIBM DB2 для z / OS 9 - 10.x и 11.x *\nIBM DB2 LUW 9 - 10.x и 11.x *\nMicrosoft SQL Server 2008, 2012, 2014, 2016 *, 2017 *\nMySQL 4.x, 5.x\nOracle 9i, 10g, 11g и 12c\nPostgreSQL 9.3, 9.4, 9.5, 9.6.x\nSybase ASE 12,5-15,7, 16,0\nSybase IQ 12,7-15,4, 16,0\n\n\nКак патчить?\n!!!При применении патча, Антивирус лучше отключить!!!\nЗапускаем среду первый раз от имени Администратора, закрываем.\nОтрываем КейПатч(KeyPatch), кликаем на кнопку \"Патч\"(Patch), сохраняем Лицензию СЛИП(Save Slip).\nЗапускаем среду, пользуемся...\n\n\nSplash Screen\n\n\n\n\nСкриншоты\n\n\n\n\n\n\nСкриншоты окна About\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:56FC6CF2276CD800FA497AF6F2ED9EFA80E6C081&tr=http%3A%2F%2Fbt4.t-ru.org%2Fann%3Fmagnet&dn=IDERA%20RapidSQL%2017.0.2%20x86%20x64%20%5B2018%2C%20ENG%5D","torrent_link":"dl.php?t=5667295","thanked_list":[{"id":"27407402","name":"MYXOMOP_RU ","data":"(11-Янв-20)"},{"id":"9159512","name":"noram ","data":"(16-Дек-19)"},{"id":"11182698","name":"d09 ","data":"(07-Авг-19)"},{"id":"16619799","name":"rebuss001 ","data":"(26-Июн-19)"},{"id":"37965634","name":"DormidontLoewe ","data":"(08-Июн-19)"},{"id":"27529607","name":"Мирамани ","data":"(30-Май-19)"},{"id":"43641680","name":"NevTheTech ","data":"(31-Мар-19)"},{"id":"17668257","name":"alexmay77 ","data":"(31-Мар-19)"},{"id":"13595881","name":"topotun05 ","data":"(15-Фев-19)"},{"id":"9433431","name":"LexR ","data":"(15-Фев-19)"},{"id":"25920799","name":"obzerver9 ","data":"(05-Фев-19)"},{"id":"2135061","name":"amz ","data":"(30-Янв-19)"},{"id":"26248179","name":"collister ","data":"(26-Янв-19)"},{"id":"27466161","name":"hjuma ","data":"(23-Янв-19)"},{"id":"1727139","name":"gma-FFFFF ","data":"(12-Янв-19)"},{"id":"15760837","name":"IGHG ","data":"(07-Янв-19)"},{"id":"5139033","name":"vlad2005 ","data":"(07-Янв-19)"},{"id":"17700110","name":"perd ","data":"(05-Янв-19)"},{"id":"9765009","name":"Bill_PHO ","data":"(31-Дек-18)"},{"id":"4760475","name":"grdraf ","data":"(31-Дек-18)"}]}