{"link":"5755117","name":"Oracle Database 19c (19.3) - all OS","date":"13-Июл-19 23:45","author":"lucif1234","description":"\nOracle Database 19cUpdate 1:\nДобавлен дистрибутив для Solaris x86 и Linux/zГод/Дата Выпуска: 2019\nВерсия: 19.3\nРазработчик: Oracle Corporation\nСайт разработчика: www.oracle.com/databaseГотовые виртуальные машины с установленной СУБД Oracle Database 19c:\nВиртуальная машина VirtualBox для разработчика приложений для СУБД Oracle 19c (Oracle Linux + Database + SQLDeveloper + APEX)(Образ VirtualBox)\nOracle Database 19c (12.2.0.3) for Linux - лабораторные по обновлению и миграции на Oracle 19c - виртуальная машина VBox\nOracle Database 19c (12.2.0.3) for Linux x64 (Виртуальная машина VirtualBox)\nOracle Real Application Cluster 19c (12.2.0.3) for Linux x86-64 (Образы VBox - две ВМ)\nOracle Database 19c (12.2.0.3) for Linux x64 (Образ VMWare vSphere)\nOracle Database 19c (12.2.0.3) for Linux x64 (Образ VMWare Workstation/Player)\nOracle Database 19c (12.2.0.3) for Linux x64 (Образ Hyper-V)Описание:Раскрыты ключевые возможности Oracle Database 19c\nПресс-релиз | 25.04.2019Новые функции, включенные в Oracle Database 19c, сделали СУБД еще полезнее для поддержки бизнеса в цифровую эпоху. Oracle Database 19c предлагает впечатляющий набор инноваций и является стабильной версией, рассчитанной на длительное использование.Функция Automatic Indexing создает индексы автоматически с использованием алгоритмов машинного обучения, причем, как показали тесты, она часто справляется с этой задачей лучше, чем человек. «Впервые база данных может сама определить оптимальный набор индексов, — пояснил Доминик Джайлс, главный менеджер Oracle по продуктам Oracle Database. — При их создании учитываются структура данных, сами данные и запросы». Это означает, что «базу данных можно создать и начать использовать вовсе без каких-либо индексов или с очень небольшим набором индексов. База данных проанализирует ресурсоемкие запросы, чтобы понять, какие индексы потенциально нужны, проверит полезность отобранных кандидатов, а затем сама построит индексы, причем все это займет меньше времени, чем создание индексов вручную».Эта функция будет прекрасно работать и с базой данных, для которой индексы уже построены. В этом случае автоматическое индексирование может помочь в тонкой настройке набора индексов в БД. После создания индексов база данных постоянно проверяет их использование и удаляет ненужные. Это важно, потому что с течением времени индексы накапливаются — крупные коммерческие приложения, работающие с Oracle Database, могут создавать за годы использования тысячи таких индексов. «Часто они создаются для отчетов или пакетных заданий, в которых уже больше нет нужды», — отметил Доминик Джайлс. Это не так безобидно, поскольку индексы увеличивают потребность базы данных в вычислительных ресурсах и ресурсах хранения.Active Data Guard DML Redirect помогает эффективнее использовать резервную базу данных — зеркальную копию рабочей базы данных, предназначенную для аварийного восстановления. «Эта часть инфраструктуры дорого обходится нашим корпоративным клиентам, — сказал Доминик Джайлс. — Она занимает место и увеличивает энергопотребление».Чтобы помочь клиентам эффективнее ее использовать, в Oracle Database 11g корпорация Oracle предложила опцию Oracle Active Data Guard, с помощью которой можно открывать резервную базу данных на чтение, создавать на ней отчеты и выполнять бэкапы.В Oracle Database 19c реализована важная дополнительная возможность Active Data Guard DML Redirect, которая позволяет изменять данные в резервной базе данных. Как объяснил Доминик Джайлз, одна из причин такого нововведения в том, что «многие приложениям при создании отчетов требуется не только читать данные, но и делать некоторые записи в базе данных. С помощью Active Data Guard DML Redirect операции записи немедленно и прозрачно перенаправляются в первичную базу данных и после занесения в нее реплицируются в резервную БД. С точки зрения пользователя это выглядит так, как будто он обновляет данные в резервной базе данных».Active Data Guard DML Redirect работает одинаково хорошо при размещении резервной базы данных как в локальной среде, так и в облаке, а также когда и основная, и резервная базы данных выполняются в облачной среде. «Это позволяет клиентам более гибко и креативно использовать данный дополнительный ресурс», — отметил Доминик Джайлс.Клиенты Oracle постоянно сталкиваются с проблемой хранения растущих объемов данных, причем для соответствия требованиям регуляторов, данные подчас должны храниться годами и находиться всегда под рукой. Гибридные секционированные таблицы в Oracle Database 19c помогут справиться с этой задачей.Гибридные секционированные таблицы (Hybrid Partitioned Tables) позволяют совмещать в рамках одной таблицы как секции, которые находятся внутри стандартного табличного пространства, так и секции, которые размещаются на внешних дешевых системах хранения вне базы данных.«Это означает, что все возможности аналитики СУБД Oracle можно использовать даже тогда, когда данные размещены на внешней недорогой системе хранения», — пояснил Доминик Джайлс. Эти системы хранения данных могут располагаться как в локальном ЦОД клиента, так и в облаке. «Привлекательность такой модели в том, что некоторые секции таблицы, размещенной в БД вашего ЦОД могут лежать в облаке», — говорит он.Данные вне базы данных Oracle доступны только для чтения и не нуждаются в регулярном бэкапе, но к ним можно обращаться из Oracle Database. «Это очень привлекательное решение для управления жизненным циклом данных, и клиенты, с которыми я общался, весьма заинтересованы в этой технологии», — рассказал Доминик Джайлс.Поддержка JSON появилась еще в Oracle Database 12c, где было реализовано нативное хранилище документов JSON и SQL-доступ. Она получила дальнейшее развитие в версии 18c с внедрением высокопроизводительной аналитики для документов JSON . «Это очень эффективное средство для аналитики документов JSON — оно работает столь же быстро, как если бы данные JSON хранились в строках и столбцах таблицы базы данных», — добавил Доминик Джайлз.В Oracle Database 19c корпорация Oracle улучшила поддержку JSON. Для традиционных разработчиков все стало еще проще.«Мы улучшили и упростили синтаксис наших функций JSON и реализовали возможность частичного обновления JSON. Это позволяет изменить один атрибут большого документа JSON, не обновляя его целиком», — сообщил Доминик Джайлс.Кроме того, в Oracle Database 19c появилась поддержка интерфейсов прикладного программирования Simple Oracle Document Access (SODA) для Java, Python, C и Node.js.«Вы можете работать с широким спектром легких API-интерфейсов NoSQL, которые получают строки из документов JSON в базе данных», — сказал Доминик Джайлс.Общая производительность витрины данных или хранилища данных может резко упасть при частом выполнении запросов с очень высокими требованиями к ресурсам ЦПУ и вводу-выводу. СУБД Oracle Database 19c «может автоматически помещать эти запросы в карантин (Query Quarantine) и блокировать их выполнение, если уровень потребления ресурсов превосходит заданные для них пороговые значения». Как отметил Доминик Джайлс, это позволяет обеспечить стабильную работу базы данных для всех пользователей.Новые механизмы и возможности важны, но также важна стабильность приложений и локальных инсталляций баз данных — и Oracle Database 19c ее обеспечивает.«Стабильность является основной целью Oracle Database 19c — это релиз с долгосрочной поддержкой, — сказал Доминик Джайлс. — Циклы обновления локальных СУБД у наших клиентов достаточно длительные, и многие клиенты ждали релиз Oracle Database 19c, чтобы перейти на него с Oracle Database 11g или Oracle Database 12c».  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:ABA70AEE190570F0BE37539F3D29E57EA767957E&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=Oracle%20Database%2019c%20(19.3)%20-%20all%20OS","torrent_link":"dl.php?t=5755117","thanked_list":[{"id":"15642281","name":"kostya277 ","data":"(06-Июл-23)"},{"id":"4162761","name":"severe_angel ","data":"(28-Мар-23)"},{"id":"29690006","name":"Raulo ","data":"(14-Мар-23)"},{"id":"16095178","name":"anasty260682 ","data":"(13-Мар-23)"},{"id":"29100292","name":"diamondik1976 ","data":"(28-Фев-23)"},{"id":"17523958","name":"Michael_Isaev ","data":"(05-Фев-23)"},{"id":"18100570","name":"CrazYViruS333 ","data":"(21-Янв-23)"},{"id":"8236631","name":"nn030372 ","data":"(18-Дек-22)"},{"id":"10693220","name":"Urif ","data":"(16-Дек-22)"},{"id":"15334724","name":"Tolmy ","data":"(02-Дек-22)"},{"id":"1927585","name":"kexc ","data":"(13-Ноя-22)"},{"id":"17676873","name":"mrpeter ","data":"(06-Ноя-22)"},{"id":"18470634","name":"fed-rus ","data":"(02-Ноя-22)"},{"id":"14122106","name":"IvanXXL ","data":"(25-Окт-22)"},{"id":"46359420","name":"Vladimir-1969 ","data":"(13-Окт-22)"},{"id":"8200463","name":"Marduk_Vvardenfellish ","data":"(30-Авг-22)"},{"id":"6143024","name":"azterk ","data":"(06-Авг-22)"},{"id":"36723171","name":"Dmitry614347 ","data":"(04-Авг-22)"},{"id":"17821325","name":"obik2 ","data":"(01-Авг-22)"},{"id":"14434485","name":"titan1000 ","data":"(14-Июл-22)"},{"id":"7639703","name":"cacxa81 ","data":"(11-Июл-22)"},{"id":"17981338","name":"Вячеслав Б ","data":"(28-Июн-22)"},{"id":"3474941","name":"dkfleirf ","data":"(21-Июн-22)"},{"id":"20489677","name":"n0fun ","data":"(20-Май-22)"},{"id":"16389007","name":"BRoN5871 ","data":"(19-Май-22)"},{"id":"18542443","name":"SibirSky_88 ","data":"(17-Май-22)"},{"id":"23336452","name":"ShadowDL ","data":"(09-Апр-22)"},{"id":"23269124","name":"Vehsned ","data":"(24-Мар-22)"},{"id":"18295467","name":"von_moltke ","data":"(22-Мар-22)"},{"id":"7649765","name":"KarKino ","data":"(22-Мар-22)"},{"id":"22554915","name":"bgreg ","data":"(11-Мар-22)"},{"id":"19327540","name":"asteroid84 ","data":"(07-Мар-22)"},{"id":"31105378","name":"stephengenov ","data":"(24-Фев-22)"},{"id":"35509157","name":"towhid71 ","data":"(17-Фев-22)"},{"id":"17194353","name":"viktorpavlovih ","data":"(11-Дек-21)"},{"id":"27373735","name":"victork_rutracker ","data":"(03-Дек-21)"},{"id":"25746235","name":"Patriot242 ","data":"(27-Окт-21)"},{"id":"25059888","name":"vv878 ","data":"(26-Окт-21)"},{"id":"9993271","name":"kouvaev ","data":"(30-Сен-21)"},{"id":"11005109","name":"roman_ssh ","data":"(29-Сен-21)"},{"id":"9035293","name":"orcinus.7d7 ","data":"(23-Сен-21)"},{"id":"4295219","name":"alf-ufo ","data":"(15-Сен-21)"},{"id":"21107484","name":"kvn99 ","data":"(12-Сен-21)"},{"id":"1465434","name":"HellWing ","data":"(31-Авг-21)"},{"id":"22570682","name":"alen04ka92 ","data":"(19-Авг-21)"},{"id":"937401","name":"L_u_k_a ","data":"(16-Авг-21)"},{"id":"24674453","name":"ShandyV ","data":"(26-Июл-21)"}]}