{"link":"5930433","name":"TablePlus 4.2.8 Build 176 (x86) (x64) [2021, ENG]","date":"15-Авг-20 12:28","author":"GoAkko","description":"\nTablePlus  Database management\nГод выпуска:: 2021\nВерсия: 4.2.8 Build 176\nРазработчик: TablePlus Inc.\nРазрядность: 32bit, 64bit\nЯзык интерфейса: Английский\nТаблетка: присутствует\nСистемные требования: Windows 7 and newer |.NET 4.8 or higherОписание: TablePlus - это удобное приложение для работы с различными базами данных. TablePlus включает в себя множество функций безопасности для защиты вашей базы данных, включая собственные libssh и TLS для шифрования вашего соединения. TablePlus поддерживает просмотр с несколькими вкладками и несколькими окнами, а также генерирует проверку кода всякий раз, когда вы вносите изменения в свою базу данных. Кроме того, в Tableplus также включен мощный редактор SQL, такой как синтаксис выделения и команда SQL отступа.\nНа данный момент он поддерживает работу с: PostgreSQL, MySQL, MariaDB, SQLite, Microsoft SQL Server, Amazon Redshift, Oracle, CockroachDB, Snowflake, Cassandra, Redis, Vertica, MongoDB (Beta). И любые базы данных, которые используют тот же протокол с базами данных, перечисленными выше, такими как Percona, Yugabyte DB и т. д.\n\nПодробнее\nКлючевые функции TablePlus\nTablePlus - это мощный и понятный GUI инструмент для реляционных баз данных, созданный, чтобы обеспечить вас удобным центром контроля за вашим SQL. Управляете ли вы одной базой данных, или десятком - простой в использовании интерфейс приложения и его комфортный вид избавят вас от суеты в рабочем процессе. Созданное с учетом производительности, приложение даст вам скорость и простоту, не жертвуя мощностью или управлением. Даже более того, для помощи в сокращении ваших задач создан полный набор сочетаний клавиш.Созданный для управления стандартным набором форматов SQL, включая PostgreSQL, MySQL и SQLite, TablePlus развивается вместе с вами, позволяя добавлять новые плагины и драйверы по мере необходимости. Простое и минималистичное, приложение по прежнему обладает мощью и гибкостью для выполнения любых задач.Быстрый и надежный\nМгновенное переключение между работой в TablePlus и вне приложения сделает практически незаметным использование этого мощного редактора SQL для Mac. В отличие от множества конкурентов TablePlus направлен на то, чтобы избавиться от ненужных дополнений и быть максимально динамичным. Собственная сборка приложения означает, что оно оптимизировано для работы на вашем Mac на максимальной скорости, не жертвуя безопасностью. TablePlus оснащен такими функциями безопасности, как нативные libss и TLS для шифрования вашего соединения и защиты базы данных.Организованный и не допускающий ошибки\nОтделяйте и упорядочивайте инструменты для работы с базами данных при помощи множества вкладок и окон, что позволит вам легко отсортировать свои проекты. Редактор скрипта обеспечивает поддержку backend благодаря функции выделения синтаксиса и ошибок, позволяя быстро заметить погрешности и продолжить работу. Безопасный режим и предварительный просмотр кода позволят вам экспериментировать без какого-либо риска.Инструмент создания наглядных диаграмм баз данных\nЧетко определяйте необходимые данные, не жертвуя интенсивностью потока информации, при помощи инструмента реляционных баз данных для Mac. В отличие от большинства менеджеров баз данных TablePlus обладает изысканные дизайном, интуитивно понятным и приятным взгляду. В дополнение, опциональное темное оформление отлично подходит для работы в позднее время или в общих условиях слабой освещенности.Всестороннее управление базой данных\nЛегко переключайтесь между инструментами баз данных и соединениями, даже не открывая другие приложения или окна, экономя время и внимание. Вам больше не придется запускать несколько SQL клиентов для поддержки баз данных разных стилей и форматов. TablePlus решает эту проблему, предоставляя обширный выбор опциональных драйверов.Функция \"включай и работай\"\nУстанавливайте плагины, написанные другими, для расширения функциональности приложения или пишите свои на JavaScript для получения необходимых вам функций. Несмотря на то, что TablePlus гордится своим минимализмом, он также поддерживает свободу действий и не ограничивает внедрение любых желаемых изменений.Быстрая поддержка и итерация\nНапишите в TablePlus напрямую для консультации или предложите варианты улучшений реляционной базы данных для Mac. Приложение собрало вовлеченное активное сообщество, которое постоянно разрабатывает функции с учетом поступивших пожеланий. Обновления и фиксы выпускаются еженедельно, а значит всегда можно опробовать что-то новенькое.\n\n\nСкриншоты\n\n \n \n\n \n \n \n \n \n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:7A50C672ECE79492E5440A5B0C2D4C5627A2C9D6&tr=http%3A%2F%2Fbt4.t-ru.org%2Fann%3Fmagnet&dn=TablePlus%204.2.8%20Build%20176%20(x86)%20(x64)%20%5B2021%2C%20ENG%5D","torrent_link":"dl.php?t=5930433","thanked_list":[{"id":"13516421","name":"Axlband ","data":"(04-Июн-23)"},{"id":"20274147","name":"KoCher13 ","data":"(01-Мар-23)"},{"id":"27466161","name":"hjuma ","data":"(04-Янв-23)"},{"id":"35750883","name":"маx86 ","data":"(31-Дек-22)"},{"id":"26555296","name":"Coldenol ","data":"(06-Дек-22)"},{"id":"48269373","name":"zackreyw ","data":"(07-Ноя-22)"},{"id":"39873473","name":"denistort ","data":"(26-Окт-22)"},{"id":"48988525","name":"ml.volkov ","data":"(26-Окт-22)"},{"id":"1924095","name":"mike528 ","data":"(25-Июл-22)"},{"id":"8118764","name":"almador ","data":"(12-Июл-22)"},{"id":"32985700","name":"pavelpi289 ","data":"(30-Июн-22)"},{"id":"18366876","name":"cross449 ","data":"(14-Июн-22)"},{"id":"16675632","name":"akrnew ","data":"(31-Май-22)"},{"id":"16254612","name":"vitovich ","data":"(27-Май-22)"},{"id":"9660019","name":"Washio01 ","data":"(20-Май-22)"},{"id":"14748064","name":"SuperSonic45 ","data":"(05-Май-22)"},{"id":"1478588","name":"N_A ","data":"(04-Май-22)"},{"id":"46867504","name":"aga.mustafayevv ","data":"(22-Апр-22)"},{"id":"8270329","name":"Nova_Chaser ","data":"(29-Мар-22)"},{"id":"47971484","name":"notificare ","data":"(27-Мар-22)"},{"id":"43415969","name":"ipower81 ","data":"(27-Мар-22)"},{"id":"13748228","name":"lds_94 ","data":"(13-Мар-22)"},{"id":"7263485","name":"Semalexa ","data":"(21-Фев-22)"},{"id":"6832034","name":"prontom ","data":"(09-Фев-22)"},{"id":"23191766","name":"JeT A ","data":"(27-Дек-21)"},{"id":"1985806","name":"tuser31 ","data":"(02-Дек-21)"},{"id":"21221996","name":"VetalM84 ","data":"(18-Ноя-21)"},{"id":"10089963","name":"ALeh_ ","data":"(17-Ноя-21)"},{"id":"1875609","name":"libra-12 ","data":"(04-Ноя-21)"},{"id":"30906180","name":"lomadze1 ","data":"(03-Ноя-21)"},{"id":"3607635","name":"Buldogas7 ","data":"(22-Окт-21)"},{"id":"24635106","name":"crover3000 ","data":"(03-Окт-21)"},{"id":"45883696","name":"BT_Rover ","data":"(22-Сен-21)"},{"id":"28645910","name":"enc0ded.enable ","data":"(18-Сен-21)"},{"id":"38799798","name":"alisherrakhimov ","data":"(01-Сен-21)"},{"id":"42815620","name":"DeathCarcass ","data":"(25-Авг-21)"},{"id":"43536809","name":"arjevanidze ","data":"(28-Июл-21)"},{"id":"5741448","name":"ShinodaLP ","data":"(02-Июн-21)"},{"id":"46143751","name":"annethost ","data":"(10-Апр-21)"},{"id":"12978196","name":"NorthCross ","data":"(31-Мар-21)"},{"id":"20243668","name":"club_zzz ","data":"(25-Мар-21)"},{"id":"33946425","name":"MyrkotynAndrew ","data":"(24-Мар-21)"},{"id":"9159512","name":"noram ","data":"(15-Мар-21)"},{"id":"35968320","name":"rjay88 ","data":"(10-Мар-21)"},{"id":"43013678","name":"7urkm3n ","data":"(09-Мар-21)"},{"id":"15288866","name":"7kill ","data":"(27-Фев-21)"},{"id":"27729246","name":"vini2com ","data":"(22-Фев-21)"},{"id":"28909595","name":"mony_koleg ","data":"(18-Фев-21)"},{"id":"31460384","name":"atanasov80 ","data":"(03-Фев-21)"},{"id":"44765595","name":"ahmdalgendi ","data":"(22-Янв-21)"},{"id":"16818355","name":"vortexghost ","data":"(08-Янв-21)"},{"id":"45717089","name":"Leonard1o ","data":"(06-Янв-21)"}]}