{"link":"6095995","name":"Oracle Database 21c (Linux x86-64б HPUX IA64 и Windows)","date":"15-Авг-21 23:55","author":"lucif1234","description":"\nOracle Database 21cUpdate 1\nДобавлены дистрибутивы для HPUX IA64 и WindowsГод/Дата Выпуска: 2021\nВерсия: 21.3\nРазработчик: Oracle Corporation\nСайт разработчика: www.oracle.com/databaseОписание:Корпорация Oracle объявила о выпуске новой версии конвергентной базы данных Oracle Database 21c.\nOracle Database 21c включает в себя более 200 новых возможностей, в том числе: неизменяемые блокчейн-таблицы, встроенную поддержку языка программирования JavaScript, встроенную поддержку бинарного формата JSON, встроенное в БД автоматизированное машинное обучение и поддержку энергонезависимой памяти Persistent Memory. А также усовершенствования в технологии Oracle Database in-Memory, производительности обработки геоинформации, шардинге, технологии подключаемых баз данных (pluggable database) и безопасности.Oracle Database 21c призвана обеспечивать поддержку многомодельных мультиарендных архитектур для выполнения приложений самого разного типа в единой конвергентной базе данных.Инновации Oracle Database 21c включают следующее: Неизменяемые блокчейн-таблицы: Блокчейн-таблицы обеспечивают преимущества технологии блокчейн в плане безопасности для корпоративных приложений. Технология блокчейн-таблиц является частью платформы Oracle Crypto-Secure Data Management. Блокчейн-таблицы доступны только для вставки, а их строки связаны в блокчейн-цепочку и зашифрованы, что гарантирует их неизменность. Таким образом обеспечивается эффективная защита от несанкционированных изменений, которые могли бы внести сотрудники организации или хакеры, выдающие себя за администраторов или пользователей. Встроенная поддержка типа JSON: На протяжении уже многих лет Oracle предоставляет мощную поддержку выполнения SQL-запросов и индексирования данных в формате JSON. В Oracle Database 21c добавлен новый встроенный тип данных JSON, который позволяет выполнять сканирование в 10 раз быстрее, а обновление — в 4 раза быстрее. Встроенное в БД автоматизированное машинное обучение: Эта функция позволяет автоматически создавать и сравнивать масштабируемые модели машинного обучения и упрощает его применение для рядовых пользователей. Новый пользовательский интерфейс AutoML упрощает применение встроенных возможностей машинного обучения для неспециалистов. Также к обширной библиотеке алгоритмов машинного обучения Oracle были добавлены новые — для выявления отклонений, регрессии и углубленного анализа. Поддержка JavaScript внутри базы данных: Позволяет разработчикам эффективно работать на современных языках программирования. Благодаря технологии Graal Multilingual Engine, которая встроена в СУБД Oracle, можно запускать код обработки данных на JavaScript прямо внутри базы данных, в которой хранятся данные, что устраняет необходимость в дорогостоящем сетевом взаимодействии. Поддержка энергонезависимой памяти: Сохраняет файлы данных и журналы транзакций в энергонезависимой памяти (Persistent Memory - PMEM), что значительно повышает производительность операций, связанных с вводом-выводом. Графовые модели с более высокой производительностью: Позволяют моделировать данные на основе отношений, а также исследовать связи и закономерности в социальных сетях, Интернете вещей и т. д. За счет дальнейшей оптимизации можно уменьшить объем необходимой оперативной памяти, требуемой для анализа больших графовых моделей, что позволяет существующим приложениям работать быстрее без каких-либо изменений. Автоматизация Database In-Memory: Oracle поддерживает строчный формат и формат столбцов в памяти для одной и той же таблицы, поэтому аналитику и транзакции можно одновременно выполнять на одной таблице. Oracle Database 21c вводит функциональность полностью автоматического управления столбцов таблиц в оперативной памяти. Это позволяет упростить работу и повысить эффективность за счет автоматического управления размещением и удалением столбцов в In-Memory Columnar Store. Автоматизация шардинга данных: Встроенная в СУБД Oracle Database технология шардинга данных (Oracle Sharding) обеспечивает масштабируемую производительность и доступность, облегчая международным компаниям задачу\nсоблюдения требований законодательства и регулирующих органов. Шарды (сегменты данных) не имеют между собой общих компонент и могут располагаться как локально, так и в облаке.Готовые виртуальные машины с установленной СУБД Oracle Database 21c:\nOracle Database 21c (21.3) for Linux x64 (Виртуальная машина VBox)  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:9FE3F00218D737A534B4FE6441B6F0A5AA63C93C&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=Oracle%20Database%2021c%20(Linux%20x86-64%D0%B1%20HPUX%20IA64%20%D0%B8%20Windows)","torrent_link":"dl.php?t=6095995","thanked_list":[{"id":"26261683","name":"Schizzit ","data":"(07-Июл-23)"},{"id":"19934554","name":"anzul36 ","data":"(21-Июн-23)"},{"id":"20218287","name":"andreym_ya ","data":"(16-Май-23)"},{"id":"34717208","name":"Маргарита Горелик ","data":"(24-Апр-23)"},{"id":"1569417","name":"simba_max ","data":"(18-Апр-23)"},{"id":"26421897","name":"Shadowrun_ ","data":"(15-Апр-23)"},{"id":"3340958","name":"Kucher_ ","data":"(06-Апр-23)"},{"id":"13228050","name":"rinat.mag ","data":"(31-Мар-23)"},{"id":"15015554","name":"airon5 ","data":"(28-Мар-23)"},{"id":"8367415","name":"m12777 ","data":"(14-Янв-23)"},{"id":"20383627","name":"Komnata311 ","data":"(14-Янв-23)"},{"id":"5922250","name":"x2270 ","data":"(12-Дек-22)"},{"id":"1974475","name":"suntexnik ","data":"(09-Дек-22)"},{"id":"4663109","name":"phoenix990 ","data":"(26-Ноя-22)"},{"id":"27161653","name":"7419489 ","data":"(21-Ноя-22)"},{"id":"29690006","name":"Raulo ","data":"(14-Ноя-22)"},{"id":"3594","name":"henkel ","data":"(08-Ноя-22)"},{"id":"39416430","name":"yogin86 ","data":"(07-Ноя-22)"},{"id":"18470634","name":"fed-rus ","data":"(02-Ноя-22)"},{"id":"29841400","name":"Avarom2 ","data":"(15-Окт-22)"},{"id":"38987233","name":"yvne ","data":"(21-Сен-22)"},{"id":"36576859","name":"PEAKTOP1 ","data":"(27-Авг-22)"},{"id":"22241658","name":"hadush4416 ","data":"(23-Авг-22)"},{"id":"15229726","name":"him1974 ","data":"(10-Авг-22)"},{"id":"6143024","name":"azterk ","data":"(06-Авг-22)"},{"id":"16689006","name":"timurrv ","data":"(27-Июл-22)"},{"id":"10864012","name":"AntonKonsul ","data":"(27-Июл-22)"},{"id":"22936940","name":"oleggenn ","data":"(21-Июл-22)"},{"id":"47381249","name":"usolcew ","data":"(19-Июн-22)"},{"id":"9035293","name":"orcinus.7d7 ","data":"(15-Июн-22)"},{"id":"11247694","name":"eProk ","data":"(31-Май-22)"},{"id":"5481824","name":"KING_vova ","data":"(25-Май-22)"},{"id":"20473234","name":"dzhillian ","data":"(20-Май-22)"},{"id":"5377023","name":"Valuha1971 ","data":"(16-Май-22)"},{"id":"18542443","name":"SibirSky_88 ","data":"(12-Май-22)"},{"id":"23468627","name":"majbrother ","data":"(11-Май-22)"},{"id":"297743","name":"lanceX ","data":"(06-Май-22)"},{"id":"13782594","name":"Самурай Джек ","data":"(26-Апр-22)"},{"id":"45274318","name":"Holy_writer ","data":"(24-Апр-22)"},{"id":"15621319","name":"teksab ","data":"(15-Апр-22)"},{"id":"24674453","name":"ShandyV ","data":"(01-Апр-22)"},{"id":"24534712","name":"mad-man-old ","data":"(30-Мар-22)"},{"id":"47560383","name":"p_redator ","data":"(24-Мар-22)"},{"id":"18295467","name":"von_moltke ","data":"(22-Мар-22)"},{"id":"22554915","name":"bgreg ","data":"(11-Мар-22)"},{"id":"16432270","name":"Atrofat ","data":"(09-Мар-22)"},{"id":"19479255","name":"Nj93 ","data":"(07-Мар-22)"},{"id":"21107484","name":"kvn99 ","data":"(05-Мар-22)"},{"id":"20947940","name":"Dostapo ","data":"(28-Фев-22)"},{"id":"13697692","name":"BlackSysop ","data":"(07-Фев-22)"}]}