{"link":"6255647","name":"Oracle Autonomous Health Framework (AHF) On-Premise v22.2.3 - все платформы","date":"07-Сен-22 08:09","author":"p4vwd7","description":"\nOracle Autonomous Health Framework (AHF) On-Premise v22.2.3 - все платформыГод/Дата Выпуска: 2022\nВерсия: 22.2.3\nРазработчик: Oracle Corporation\nСайт разработчика: support.oracle.comРазрядность: 32bit, 64bit\nЯзык интерфейса: Английский\nТаблэтка: не требуется\nСистемные требования:\nLinux OEL\nLinux RedHat\nLinux SuSE\nzLinux\nOracle Solaris SPARC\nOracle Solaris x86-64\nAIX\nHP-UX\nMicrosoft Windows 64-bit\nMicrosoft Windows Server 2012 R2 and above\nОписание: Oracle Autonomous Health Framework (AHF) includes the functionality from Oracle ORAchk, Oracle EXAchk, and Oracle Trace File Analyzer (TFA).As a DBA, you are expected to do more work with fewer resources. You are under pressure to maintain the mission-critical applications up and running. When something goes wrong, everyone looks to you to understand what went wrong and how to fix it.To accomplish this, you have to run the right tools at the right time. If you're using Oracle Grid Infrastructure, then you also have to collect diagnostic data from all the database nodes. Collecting this data can require you to use tools that you rarely use. Needless to say, each tool has its own syntax.\n\nВ состав AHF входит\nTFA - Primary diagnostic collection tool, with Database Support Tools Bundle\nORAchk / EXAchk - Oracle Stack Compliance Checks\nprocwatcher - Automate & capture database performance diagnostics & session level hangs\nevents - Reports warnings and errors seen in the logs\nmanagelogs - Shows disk space usage and purges ADR log and trace files\nalertsummary - Provides summary of events for one or more database or ASM alert files from all nodes\nls / dir - Lists all files TFA knows about for a given file name pattern across all nodes\nsummary - High level summary of the configuration\nvi / notepad - Open alert or trace files for viewing a given database and file name pattern in the vi editor\ntail - Run a tail on an alert or trace files for a given database and file name pattern\nparam - Show all database and OS parameters that match a specified pattern\noswatcher - Collect and archive OS metrics, useful for instance / node evictions & performance Issues.\noratop - Near real-time database monitoring\npstack - Generate process stack for specified processes across all\ngrep / findstr - Search alert or trace files with a given database and file name pattern, for a search string\ndbglevel - Set and unset multiple CRS trace levels with one command\nhistory - Show the shell history for the tfactl shell\nchanges - Report any noted changes in the system setup over a given time period. This includes database a parameters, OS parameters, patches applied etc\ncalog - Reports major events from the Cluster Event log\nps / tasklist - Finds processes\ntriage - Summarize oswatcher/exawatcher data\n\n\nСкриншоты\n\n\n\n\nСкриншоты окна About\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:BE3EE6B32AE6ABAFD20B7A675B582C1E24D887AF&tr=http%3A%2F%2Fbt3.t-ru.org%2Fann%3Fmagnet&dn=Oracle%20Autonomous%20Health%20Framework%20(AHF)%20On-Premise%20v22.2.3%20-%20%D0%B2%D1%81%D0%B5%20%D0%BF%D0%BB%D0%B0%D1%82%D1%84%D0%BE%D1%80%D0%BC%D1%8B","torrent_link":"dl.php?t=6255647","thanked_list":[{"id":"1974475","name":"suntexnik ","data":"(09-Дек-22)"},{"id":"17676873","name":"mrpeter ","data":"(22-Ноя-22)"},{"id":"17838872","name":"quadrofx8100 ","data":"(22-Сен-22)"},{"id":"33551653","name":"siv10 ","data":"(08-Сен-22)"},{"id":"350293","name":"XXXVip ","data":"(08-Сен-22)"},{"id":"4868380","name":"nirwander ","data":"(08-Сен-22)"}]}