{"link":"6372321","name":"Oracle Data Integrator 12.2.1.4.0","date":"05-Июн-23 08:50","author":"p4vwd7","description":"\nOracle Data IntegratorГод/Дата Выпуска: 2019\nВерсия: 12.2.1.4.0\nРазработчик: Oracle Corporation\nСайт разработчика: www.oracle.comРазрядность: 64bit\nЯзык интерфейса: Английский\nТаблэтка: не требуется\nСистемные требования: Memory: 3 GB of RAM for one agent\nОписание: ODI ключевой инструмент интеграции различных источников данных в корпоративной ИТ-среде, предназначенный для решения таких задач как создание хранилищ данных, консолидация и синхронизация приложений, управление мастер-данными (MDM - Master Data Management), мониторинга активности бизнеса (BAM - Business Activity Monitoring) и т. д. Главная особенность этого продукта заключается в возможности извлекать данные из разнородных источников и загружать их также в разнородные базы данных. При этом поддержка большого числа источников возможна именно благодаря его ELT-архитектуре, когда все преобразования данных выполняются либо на стороне источника, либо на стороне получателя, а также благодаря тому, что ODI позволяет разделять схемы отображения или мэппинга данных (data mappings) на бизнес-правила (business rules) и специфические для платформ и процессов загрузки (platform/load-type specifics) части. Также возможности продукта расширяемы благодаря поддержке модулей знаний (knowledge modules), которые позволяют хранить специфические конструкции - SQL-шаблоны, выполняющие определенные функции.\n\nСкриншоты\n\n\n\n\n\n\nСкриншоты окна About\n\n\n  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:AA6ECC75CC50A0BF62D73D4C125437772FDE843F&tr=http%3A%2F%2Fbt2.t-ru.org%2Fann%3Fmagnet&dn=Oracle%20Data%20Integrator%2012.2.1.4.0","torrent_link":"dl.php?t=6372321","thanked_list":[{"id":"8367415","name":"m12777 ","data":"(27-Июн-23)"},{"id":"46151243","name":"Planinec ","data":"(23-Июн-23)"},{"id":"17838872","name":"quadrofx8100 ","data":"(17-Июн-23)"},{"id":"350293","name":"XXXVip ","data":"(07-Июн-23)"},{"id":"20778933","name":"pnt2 ","data":"(06-Июн-23)"},{"id":"26369581","name":"isaax ","data":"(05-Июн-23)"},{"id":"7783065","name":"green733 ","data":"(05-Июн-23)"}]}