{"link":"765217","name":"Sybase PowerBuilder 10.5 [СУБД]","date":"03-Апр-08 19:33","author":"vklementev","description":"\nSybase PowerBuilder 10.5\nВерсия в раздаче:10.5\nПоследняя версия:11.0\nГод выпуска:2006\nРазработчик:Sybase\nАдрес официального сайта:http://www.sybase.com/\nОперационная система:Windows\nСовместимость с Windows Vista:Нет информации\nЛекарство:Не нужноВ данной версии PowerBuilder акценты сделаны на давно ожидаемых новых функциях продукта. Строите ли вы традиционные клиент-серверные приложения, интернет-приложения, или приложение для распределенных архитектур, PowerBuilder 10.5 упростит вашу работу.Патентованная технология DataWindow в течение многих лет делала жизнь разработчиков на PowerBuilder легче, избавляя их от необходимости писать сложные SQL-запросы, используя декларативное программирование для создания сложной бизнес-логики приложения, и делая заметно легче доступ, управление и обновление корпоративных данных. В данной версии реализована давно ожидаемая разработчиками функция авторазмера всех секций отчета, а не только секции основных данных. Благодаря этим функциональным возможностям, разработчики могут более легко строить сложные формы и сообщения. Также Sybase осуществила новый вид представления - TreeView DataWindow, благодаря чему можно легко увидеть данные в иерархическом порядке.Помимо нововведений в DataWindow также обновлена среда разработки IDE и появилась возможность строить еще более усовершенствованные приложения для конечных пользователей и клиентов. В этой версии изменен дизайн использующихся картинок и иконок.Тысячи изображений с разным разрешением были тщательно исследованы, чтобы гарантировать хорошее восприятие символов и отображаемых понятий. Обеспечено стилистическое соответствие графических элементов среды разработки стандартам современных операционных систем Windows. Как результат этой работы новый вид получила не только среда разработки, но и создаваемые в ней приложения. На случай, если для преемственности версий приложений вы захотите использовать старый дизайн изображений и иконок, необходимые для этого файлы и ресурсы также поставляются в комплекте среды разработки.Обновили меню и панели инструментов. Вы можете использовать новый вид меню или, если захотите, сохранить классический стиль. Также в ответ на пожелания разработчиков появились такие возможности как объект DateTimePicker, для облегчения ввода дат и времени в формы обработки данных, и поддержка маски ввода данных в виде типа колонки таблиц. Возможности объекта RichTextEdit для полноценного редактирования и форматирования текста были расширены за счет использования решения стороннего поставщика. При этом полноценная обработка текстовой информации возможна как в виде отдельного элемента окна, так и в составе форм DataWindow.Помимо новшеств, которые видны сразу, добавлены и другие скрытые функциональные возможности, делающие применение PowerBuilder более эффективным. Продолжая стратегическую поддержку компанией Sybase технологии .NET, была расширена поддержка веб-служб в направлении совместимости и использования приложений .NET. Это повышает ценность PowerBuilder для информационных систем предприятия и позволяет использовать индустриальные стандарты при разработке информационных систем, делая приложения более эффективными и надежными. Также в новой версии появилась поддержка типов данных BYTE и 30-значных числовых типов DECIMAL. Добавлена и поддержка новых СУБД Sybase ASE 15 и Oracle 10g.Двигаясь в направлении интеграции PowerBuilder в мир .NET, текущая версия продукта была выпущена, чтобы лишний раз подтвердить, что технология PowerBuilder, став уже классикой, продолжает отвечать современным требованиям индустрии и пользователей, оставаясь одним из самых эффективных сред построения информационных систем.Преимущества\n\nскрытый текст\nИнтеллектуальность - Вы являетесь высококвалифицированным специалистом и создали множество приложений на PowerBuilder. Теперь вы можете разворачивать свои приложения на платформе .Net без изучения новых технологий - используя только знание PowerBuilder.\nОткрытость и гибкость - PowerBuilder предоставляет возможность выбора СУБД для которой разрабатывать, и платформы на которую распространять свои клиент/серверные, Smart Client или .Net Webform приложения. Вы даже можете создавать приложения для планшетных ПК, не имеющих постоянного подключения. Разрабатывая приложения для рабочих станций, Web-ориентированные или распределённые приложения, вы можете решить все свои задачи с использованием единого инструментария.\nВысокая производительность - Время - деньги. Используя PowerBuilder, Вы можете создавать приложения за несколько дней или недель, а не месяцев или лет. Вы можете быстро и легко поставлять стабильные бизнес-приложения, и использовать патентованную технологию DataWindow для доступа к данным практически без написания программного кода.\nПроверенное, надежное средство - PowerBuilder - это опробованная, проверенная временем технология, позволяющая минимизировать риски при разработке. PowerBuilder скрывает сложность новых технологий, тем самым делая их лёгкими для использования, что позволяет создавать современные приложения с наименьшим риском.\nБыстрая разработка приложений (RAD) - 4GL IDE содержит сотни встроенных функций и свойств, применение которых позволяет сократить сроки написания кода.\n\nА также в пакете:\nSybase Adaptive Server Anywhere (ASA), входящая в состав SQL Anywhere Studio, - это полноценная, компактная, мощная реляционная СУБД для решений масштаба рабочих групп, мобильных и встроенных вычислений. Sybase ASA поддерживает полноценную обработку данных на портативных компьютерах и мобильных карманных устройствах, включая технологии репликации и синхронизации данных. SQL Anywhere Studio – это многофункциональный программный пакет для управления и синхронизации данных предприятия, позволяющий быстро разрабатывать и внедрять решения в области баз данных для мобильных вычислений и рабочих групп.Время раздачи: 10:00 - 22:00  \n Набор в группу «Хранители» - Помогите сохранить редкие раздачи  ","magnet_link":"magnet:?xt=urn:btih:57DE5CC226555CDCF08AE406519D1CFCA106238B&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=Sybase%20PowerBuilder%2010.5%20%5B%D0%A1%D0%A3%D0%91%D0%94%5D","torrent_link":"dl.php?t=765217","thanked_list":[{"id":"5964985","name":"liwux ","data":"(17-Фев-22)"},{"id":"1677469","name":"Bungee73 ","data":"(28-Июн-21)"},{"id":"10309331","name":"dimks.s2 ","data":"(28-Окт-20)"},{"id":"36364657","name":"Gzork777 ","data":"(02-Апр-20)"},{"id":"27101345","name":"8NOON8 ","data":"(01-Июн-18)"},{"id":"29506474","name":"hopsmalt ","data":"(19-Окт-17)"},{"id":"40382408","name":"cybercyborg ","data":"(06-Май-16)"},{"id":"8935226","name":"Автомат_Калашникова ","data":"(08-Фев-16)"},{"id":"16057773","name":"Enforcer1976 ","data":"(12-Ноя-15)"},{"id":"36623643","name":"KaifasKain ","data":"(28-Фев-15)"},{"id":"27466161","name":"hjuma ","data":"(08-Янв-15)"},{"id":"17003795","name":"fours4 ","data":"(08-Ноя-14)"},{"id":"0","name":"Гость","data":"(31-Окт-14)"},{"id":"0","name":"Гость","data":"(14-Окт-14)"},{"id":"27334344","name":"gigaxer ","data":"(25-Авг-14)"},{"id":"15572872","name":"NigDan0) ","data":"(02-Июн-14)"},{"id":"0","name":"Гость","data":"(14-Янв-14)"},{"id":"4161843","name":"КлимЧуг ","data":"(29-Авг-13)"},{"id":"20399907","name":"sudokuman ","data":"(30-Июн-13)"},{"id":"21331516","name":"elemoh ","data":"(24-Мар-13)"},{"id":"28610155","name":"msela ","data":"(08-Мар-13)"},{"id":"0","name":"Гость","data":"(19-Ноя-12)"},{"id":"19062234","name":"igorchess1 ","data":"(08-Окт-12)"},{"id":"9656805","name":"Andre135 ","data":"(24-Июн-12)"},{"id":"24348643","name":"fefdbi ","data":"(23-Июн-12)"},{"id":"1171593","name":"sn0wday ","data":"(06-Июн-12)"},{"id":"21418821","name":"102bur ","data":"(29-Май-12)"},{"id":"1759778","name":"kharshakh ","data":"(22-Янв-12)"},{"id":"1107351","name":"Kyccc ","data":"(30-Дек-11)"},{"id":"7584586","name":"Smichster ","data":"(16-Сен-11)"},{"id":"14998244","name":"Phant0001 ","data":"(20-Авг-11)"},{"id":"22103797","name":"clair61 ","data":"(19-Июл-11)"},{"id":"626785","name":"naemnik ","data":"(24-Апр-10)"},{"id":"706687","name":"sersan ","data":"(17-Мар-10)"},{"id":"8689201","name":"MoaDo ","data":"(24-Фев-10)"},{"id":"13781210","name":"ASButov ","data":"(08-Дек-09)"},{"id":"0","name":"Гость","data":"(03-Окт-09)"},{"id":"0","name":"Гость","data":"(27-Сен-09)"},{"id":"9777454","name":"alexd63 ","data":"(12-Сен-09)"},{"id":"3913036","name":"farmspam ","data":"(24-Авг-09)"},{"id":"312477","name":"amigor ","data":"(30-Июл-09)"},{"id":"0","name":"Гость","data":"(10-Июл-09)"},{"id":"0","name":"Гость","data":"(20-Июн-09)"},{"id":"4524525","name":"fantom75 ","data":"(28-Май-09)"},{"id":"9644567","name":"Abushev ","data":"(16-Май-09)"},{"id":"0","name":"Гость","data":"(09-Май-09)"},{"id":"0","name":"Гость","data":"(20-Янв-09)"},{"id":"6258188","name":"RayArcher ","data":"(16-Янв-09)"},{"id":"0","name":"Гость","data":"(08-Янв-09)"},{"id":"2316787","name":"prostodima ","data":"(22-Дек-08)"},{"id":"2173019","name":"vitabios ","data":"(12-Дек-08)"},{"id":"1990777","name":"vovic ","data":"(04-Дек-08)"}]}